-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 26, 2017 at 09:27 PM
-- Server version: 5.7.14
-- PHP Version: 5.6.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bathline_uno`
--

-- --------------------------------------------------------

--
-- Table structure for table `agent`
--

CREATE TABLE `agent` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `phone` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `region_id` int(8) NOT NULL,
  `agent_type_id` int(4) NOT NULL,
  `province_id` int(4) NOT NULL,
  `bank_account_1` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account_2` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `tax_identification` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `agent`
--

INSERT INTO `agent` (`id`, `created`, `modified`, `owner`, `name`, `phone`, `description`, `region_id`, `agent_type_id`, `province_id`, `bank_account_1`, `bank_account_2`, `tax_identification`) VALUES
(1, '2017-01-24 00:01:20', '2017-01-23 17:01:20', 1, 'วู็ดแอนด์เซรามิค', '', '', 4, 2, 7, '', '', ''),
(2, '2017-01-24 00:16:43', '2017-01-23 17:16:43', 1, 'testt', '', '', 2, 2, 2, '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `agent_credit_log`
--

CREATE TABLE `agent_credit_log` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `agent_id` int(8) NOT NULL,
  `amount` decimal(10,0) NOT NULL,
  `note` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `agent_type`
--

CREATE TABLE `agent_type` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `agent_type`
--

INSERT INTO `agent_type` (`id`, `created`, `modified`, `owner`, `name`, `description`) VALUES
(1, '2017-01-23 23:28:14', '2017-01-23 16:28:14', 1, 'Moderntrade', 'Moderntrade'),
(2, '2017-01-23 23:31:49', '2017-01-23 16:34:02', 1, 'ร้านค้า', 'ร้านค้า');

-- --------------------------------------------------------

--
-- Table structure for table `amphur`
--

CREATE TABLE `amphur` (
  `id` int(5) UNSIGNED NOT NULL,
  `code` varchar(4) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `geo_id` int(5) UNSIGNED NOT NULL DEFAULT '0',
  `province_id` int(5) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `amphur`
--

INSERT INTO `amphur` (`id`, `code`, `name`, `name_english`, `geo_id`, `province_id`) VALUES
(1, '1001', 'เขตพระนคร   ', 'Khet Phra Nakhon', 2, 1),
(2, '1002', 'เขตดุสิต   ', 'Khet Dusit', 2, 1),
(3, '1003', 'เขตหนองจอก   ', 'Khet  Nong Chok', 2, 1),
(4, '1004', 'เขตบางรัก   ', 'Khet Bang Rak', 2, 1),
(5, '1005', 'เขตบางเขน   ', 'Khet Bang Khen', 2, 1),
(6, '1006', 'เขตบางกะปิ   ', 'Khet Bang Kapi', 2, 1),
(7, '1007', 'เขตปทุมวัน   ', 'Khet Pathum Wan', 2, 1),
(8, '1008', 'เขตป้อมปราบศัตรูพ่าย   ', 'Khet Pom Prap Sattru Phai', 2, 1),
(9, '1009', 'เขตพระโขนง   ', 'Khet Phra Khanong', 2, 1),
(10, '1010', 'เขตมีนบุรี   ', 'Khet Min Buri', 2, 1),
(11, '1011', 'เขตลาดกระบัง   ', 'Khet Lat Krabang', 2, 1),
(12, '1012', 'เขตยานนาวา   ', 'Khet Yan Nawa', 2, 1),
(13, '1013', 'เขตสัมพันธวงศ์   ', 'Khet Samphanthawong', 2, 1),
(14, '1014', 'เขตพญาไท   ', 'Khet Phaya Thai', 2, 1),
(15, '1015', 'เขตธนบุรี   ', 'Khet Thon Buri', 2, 1),
(16, '1016', 'เขตบางกอกใหญ่   ', 'Khet Bangkok Yai', 2, 1),
(17, '1017', 'เขตห้วยขวาง   ', 'Khet Huai Khwang', 2, 1),
(18, '1018', 'เขตคลองสาน   ', 'Khet Khlong San', 2, 1),
(19, '1019', 'เขตตลิ่งชัน   ', 'Khet Taling Chan', 2, 1),
(20, '1020', 'เขตบางกอกน้อย   ', 'Khet Bangkok Noi', 2, 1),
(21, '1021', 'เขตบางขุนเทียน   ', 'Khet Bang Khun Thian', 2, 1),
(22, '1022', 'เขตภาษีเจริญ   ', 'Khet Phasi Charoen', 2, 1),
(23, '1023', 'เขตหนองแขม   ', 'Khet Nong Khaem', 2, 1),
(24, '1024', 'เขตราษฎร์บูรณะ   ', 'Khet Rat Burana', 2, 1),
(25, '1025', 'เขตบางพลัด   ', 'Khet Bang Phlat', 2, 1),
(26, '1026', 'เขตดินแดง   ', 'Khet Din Daeng', 2, 1),
(27, '1027', 'เขตบึงกุ่ม   ', 'Khet Bueng Kum', 2, 1),
(28, '1028', 'เขตสาทร   ', 'Khet Sathon', 2, 1),
(29, '1029', 'เขตบางซื่อ   ', 'Khet Bang Sue', 2, 1),
(30, '1030', 'เขตจตุจักร   ', 'Khet Chatuchak', 2, 1),
(31, '1031', 'เขตบางคอแหลม   ', 'Khet Bang Kho Laem', 2, 1),
(32, '1032', 'เขตประเวศ   ', 'Khet Prawet', 2, 1),
(33, '1033', 'เขตคลองเตย   ', 'Khet Khlong Toei', 2, 1),
(34, '1034', 'เขตสวนหลวง   ', 'Khet Suan Luang', 2, 1),
(35, '1035', 'เขตจอมทอง   ', 'Khet Chom Thong', 2, 1),
(36, '1036', 'เขตดอนเมือง   ', 'Khet Don Mueang', 2, 1),
(37, '1037', 'เขตราชเทวี   ', 'Khet Ratchathewi', 2, 1),
(38, '1038', 'เขตลาดพร้าว   ', 'Khet Lat Phrao', 2, 1),
(39, '1039', 'เขตวัฒนา   ', 'Khet Watthana', 2, 1),
(40, '1040', 'เขตบางแค   ', 'Khet Bang Khae', 2, 1),
(41, '1041', 'เขตหลักสี่   ', 'Khet Lak Si', 2, 1),
(42, '1042', 'เขตสายไหม   ', 'Khet Sai Mai', 2, 1),
(43, '1043', 'เขตคันนายาว   ', 'Khet Khan Na Yao', 2, 1),
(44, '1044', 'เขตสะพานสูง   ', 'Khet Saphan Sung', 2, 1),
(45, '1045', 'เขตวังทองหลาง   ', 'Khet Wang Thonglang', 2, 1),
(46, '1046', 'เขตคลองสามวา   ', 'Khet Khlong Sam Wa', 2, 1),
(47, '1047', 'เขตบางนา   ', 'Khet Bang Na', 2, 1),
(48, '1048', 'เขตทวีวัฒนา   ', 'Khet Thawi Watthana', 2, 1),
(49, '1049', 'เขตทุ่งครุ   ', 'Khet Thung Khru', 2, 1),
(50, '1050', 'เขตบางบอน   ', 'Khet Bang Bon', 2, 1),
(51, '1081', '*บ้านทะวาย   ', '*Bantawai', 2, 1),
(52, '1101', 'เมืองสมุทรปราการ   ', 'Mueang Samut Prakan', 2, 2),
(53, '1102', 'บางบ่อ   ', 'Bang Bo', 2, 2),
(54, '1103', 'บางพลี   ', 'Bang Phli', 2, 2),
(55, '1104', 'พระประแดง   ', 'Phra Pradaeng', 2, 2),
(56, '1105', 'พระสมุทรเจดีย์   ', 'Phra Samut Chedi', 2, 2),
(57, '1106', 'บางเสาธง   ', 'Bang Sao Thong', 2, 2),
(58, '1201', 'เมืองนนทบุรี   ', 'Mueang Nonthaburi', 2, 3),
(59, '1202', 'บางกรวย   ', 'Bang Kruai', 2, 3),
(60, '1203', 'บางใหญ่   ', 'Bang Yai', 2, 3),
(61, '1204', 'บางบัวทอง   ', 'Bang Bua Thong', 2, 3),
(62, '1205', 'ไทรน้อย   ', 'Sai Noi', 2, 3),
(63, '1206', 'ปากเกร็ด   ', 'Pak Kret', 2, 3),
(64, '1251', 'เทศบาลนครนนทบุรี (สาขาแขวงท่าทราย)*   ', 'Tetsaban Nonthaburi', 2, 3),
(65, '1297', 'เทศบาลเมืองปากเกร็ด*   ', 'Tetsaban Pak Kret', 2, 3),
(66, '1301', 'เมืองปทุมธานี   ', 'Mueang Pathum Thani', 2, 4),
(67, '1302', 'คลองหลวง   ', 'Khlong Luang', 2, 4),
(68, '1303', 'ธัญบุรี   ', 'Thanyaburi', 2, 4),
(69, '1304', 'หนองเสือ   ', 'Nong Suea', 2, 4),
(70, '1305', 'ลาดหลุมแก้ว   ', 'Lat Lum Kaeo', 2, 4),
(71, '1306', 'ลำลูกกา   ', 'Lam Luk Ka', 2, 4),
(72, '1307', 'สามโคก   ', 'Sam Khok', 2, 4),
(73, '1351', 'ลำลูกกา (สาขาตำบลคูคต)*   ', 'Khlong Luang(Kukod)', 2, 4),
(74, '1401', 'พระนครศรีอยุธยา   ', 'Phra Nakhon Si Ayutthaya', 2, 5),
(75, '1402', 'ท่าเรือ   ', 'Tha Ruea', 2, 5),
(76, '1403', 'นครหลวง   ', 'Nakhon Luang', 2, 5),
(77, '1404', 'บางไทร   ', 'Bang Sai', 2, 5),
(78, '1405', 'บางบาล   ', 'Bang Ban', 2, 5),
(79, '1406', 'บางปะอิน   ', 'Bang Pa-in', 2, 5),
(80, '1407', 'บางปะหัน   ', 'Bang Pahan', 2, 5),
(81, '1408', 'ผักไห่   ', 'Phak Hai', 2, 5),
(82, '1409', 'ภาชี   ', 'Phachi', 2, 5),
(83, '1410', 'ลาดบัวหลวง   ', 'Lat Bua Luang', 2, 5),
(84, '1411', 'วังน้อย   ', 'Wang Noi', 2, 5),
(85, '1412', 'เสนา   ', 'Sena', 2, 5),
(86, '1413', 'บางซ้าย   ', 'Bang Sai', 2, 5),
(87, '1414', 'อุทัย   ', 'Uthai', 2, 5),
(88, '1415', 'มหาราช   ', 'Maha Rat', 2, 5),
(89, '1416', 'บ้านแพรก   ', 'Ban Phraek', 2, 5),
(90, '1501', 'เมืองอ่างทอง   ', 'Mueang Ang Thong', 2, 6),
(91, '1502', 'ไชโย   ', 'Chaiyo', 2, 6),
(92, '1503', 'ป่าโมก   ', 'Pa Mok', 2, 6),
(93, '1504', 'โพธิ์ทอง   ', 'Pho Thong', 2, 6),
(94, '1505', 'แสวงหา   ', 'Sawaeng Ha', 2, 6),
(95, '1506', 'วิเศษชัยชาญ   ', 'Wiset Chai Chan', 2, 6),
(96, '1507', 'สามโก้   ', 'Samko', 2, 6),
(97, '1601', 'เมืองลพบุรี   ', 'Mueang Lop Buri', 2, 7),
(98, '1602', 'พัฒนานิคม   ', 'Phatthana Nikhom', 2, 7),
(99, '1603', 'โคกสำโรง   ', 'Khok Samrong', 2, 7),
(100, '1604', 'ชัยบาดาล   ', 'Chai Badan', 2, 7),
(101, '1605', 'ท่าวุ้ง   ', 'Tha Wung', 2, 7),
(102, '1606', 'บ้านหมี่   ', 'Ban Mi', 2, 7),
(103, '1607', 'ท่าหลวง   ', 'Tha Luang', 2, 7),
(104, '1608', 'สระโบสถ์   ', 'Sa Bot', 2, 7),
(105, '1609', 'โคกเจริญ   ', 'Khok Charoen', 2, 7),
(106, '1610', 'ลำสนธิ   ', 'Lam Sonthi', 2, 7),
(107, '1611', 'หนองม่วง   ', 'Nong Muang', 2, 7),
(108, '1681', '*อ.บ้านเช่า  จ.ลพบุรี   ', '*Amphoe Ban Chao', 2, 7),
(109, '1701', 'เมืองสิงห์บุรี   ', 'Mueang Sing Buri', 2, 8),
(110, '1702', 'บางระจัน   ', 'Bang Rachan', 2, 8),
(111, '1703', 'ค่ายบางระจัน   ', 'Khai Bang Rachan', 2, 8),
(112, '1704', 'พรหมบุรี   ', 'Phrom Buri', 2, 8),
(113, '1705', 'ท่าช้าง   ', 'Tha Chang', 2, 8),
(114, '1706', 'อินทร์บุรี   ', 'In Buri', 2, 8),
(115, '1801', 'เมืองชัยนาท   ', 'Mueang Chai Nat', 2, 9),
(116, '1802', 'มโนรมย์   ', 'Manorom', 2, 9),
(117, '1803', 'วัดสิงห์   ', 'Wat Sing', 2, 9),
(118, '1804', 'สรรพยา   ', 'Sapphaya', 2, 9),
(119, '1805', 'สรรคบุรี   ', 'Sankhaburi', 2, 9),
(120, '1806', 'หันคา   ', 'Hankha', 2, 9),
(121, '1807', 'หนองมะโมง   ', 'Nong Mamong', 2, 9),
(122, '1808', 'เนินขาม   ', 'Noen Kham', 2, 9),
(123, '1901', 'เมืองสระบุรี   ', 'Mueang Saraburi', 2, 10),
(124, '1902', 'แก่งคอย   ', 'Kaeng Khoi', 2, 10),
(125, '1903', 'หนองแค   ', 'Nong Khae', 2, 10),
(126, '1904', 'วิหารแดง   ', 'Wihan Daeng', 2, 10),
(127, '1905', 'หนองแซง   ', 'Nong Saeng', 2, 10),
(128, '1906', 'บ้านหมอ   ', 'Ban Mo', 2, 10),
(129, '1907', 'ดอนพุด   ', 'Don Phut', 2, 10),
(130, '1908', 'หนองโดน   ', 'Nong Don', 2, 10),
(131, '1909', 'พระพุทธบาท   ', 'Phra Phutthabat', 2, 10),
(132, '1910', 'เสาไห้   ', 'Sao Hai', 2, 10),
(133, '1911', 'มวกเหล็ก   ', 'Muak Lek', 2, 10),
(134, '1912', 'วังม่วง   ', 'Wang Muang', 2, 10),
(135, '1913', 'เฉลิมพระเกียรติ   ', 'Chaloem Phra Kiat', 2, 10),
(136, '2001', 'เมืองชลบุรี   ', 'Mueang Chon Buri', 5, 11),
(137, '2002', 'บ้านบึง   ', 'Ban Bueng', 5, 11),
(138, '2003', 'หนองใหญ่   ', 'Nong Yai', 5, 11),
(139, '2004', 'บางละมุง   ', 'Bang Lamung', 5, 11),
(140, '2005', 'พานทอง   ', 'Phan Thong', 5, 11),
(141, '2006', 'พนัสนิคม   ', 'Phanat Nikhom', 5, 11),
(142, '2007', 'ศรีราชา   ', 'Si Racha', 5, 11),
(143, '2008', 'เกาะสีชัง   ', 'Ko Sichang', 5, 11),
(144, '2009', 'สัตหีบ   ', 'Sattahip', 5, 11),
(145, '2010', 'บ่อทอง   ', 'Bo Thong', 5, 11),
(146, '2011', 'เกาะจันทร์   ', 'Ko Chan', 5, 11),
(147, '2051', 'สัตหีบ (สาขาตำบลบางเสร่)*   ', 'Sattahip(Bang Sre)*', 5, 11),
(148, '2072', 'ท้องถิ่นเทศบาลเมืองหนองปรือ*   ', 'Tong Tin Tetsaban Mueang Nong Prue*', 5, 11),
(149, '2093', 'เทศบาลตำบลแหลมฉบัง*   ', 'Tetsaban Tambon Lamsabang*', 5, 11),
(150, '2099', 'เทศบาลเมืองชลบุรี*   ', 'Mueang Chon Buri', 5, 11),
(151, '2101', 'เมืองระยอง   ', 'Mueang Rayong', 5, 12),
(152, '2102', 'บ้านฉาง   ', 'Ban Chang', 5, 12),
(153, '2103', 'แกลง   ', 'Klaeng', 5, 12),
(154, '2104', 'วังจันทร์   ', 'Wang Chan', 5, 12),
(155, '2105', 'บ้านค่าย   ', 'Ban Khai', 5, 12),
(156, '2106', 'ปลวกแดง   ', 'Pluak Daeng', 5, 12),
(157, '2107', 'เขาชะเมา   ', 'Khao Chamao', 5, 12),
(158, '2108', 'นิคมพัฒนา   ', 'Nikhom Phatthana', 5, 12),
(159, '2151', 'สาขาตำบลมาบข่า*   ', 'Saka Tambon Mabka', 5, 12),
(160, '2201', 'เมืองจันทบุรี   ', 'Mueang Chanthaburi', 5, 13),
(161, '2202', 'ขลุง   ', 'Khlung', 5, 13),
(162, '2203', 'ท่าใหม่   ', 'Tha Mai', 5, 13),
(163, '2204', 'โป่งน้ำร้อน   ', 'Pong Nam Ron', 5, 13),
(164, '2205', 'มะขาม   ', 'Makham', 5, 13),
(165, '2206', 'แหลมสิงห์   ', 'Laem Sing', 5, 13),
(166, '2207', 'สอยดาว   ', 'Soi Dao', 5, 13),
(167, '2208', 'แก่งหางแมว   ', 'Kaeng Hang Maeo', 5, 13),
(168, '2209', 'นายายอาม   ', 'Na Yai Am', 5, 13),
(169, '2210', 'เขาคิชฌกูฏ   ', 'Khoa Khitchakut', 5, 13),
(170, '2281', '*กิ่ง อ.กำพุธ  จ.จันทบุรี   ', '*King Amphoe Kampud', 5, 13),
(171, '2301', 'เมืองตราด   ', 'Mueang Trat', 5, 14),
(172, '2302', 'คลองใหญ่   ', 'Khlong Yai', 5, 14),
(173, '2303', 'เขาสมิง   ', 'Khao Saming', 5, 14),
(174, '2304', 'บ่อไร่   ', 'Bo Rai', 5, 14),
(175, '2305', 'แหลมงอบ   ', 'Laem Ngop', 5, 14),
(176, '2306', 'เกาะกูด   ', 'Ko Kut', 5, 14),
(177, '2307', 'เกาะช้าง   ', 'Ko Chang', 5, 14),
(178, '2401', 'เมืองฉะเชิงเทรา   ', 'Mueang Chachoengsao', 5, 15),
(179, '2402', 'บางคล้า   ', 'Bang Khla', 5, 15),
(180, '2403', 'บางน้ำเปรี้ยว   ', 'Bang Nam Priao', 5, 15),
(181, '2404', 'บางปะกง   ', 'Bang Pakong', 5, 15),
(182, '2405', 'บ้านโพธิ์   ', 'Ban Pho', 5, 15),
(183, '2406', 'พนมสารคาม   ', 'Phanom Sarakham', 5, 15),
(184, '2407', 'ราชสาส์น   ', 'Ratchasan', 5, 15),
(185, '2408', 'สนามชัยเขต   ', 'Sanam Chai Khet', 5, 15),
(186, '2409', 'แปลงยาว   ', 'Plaeng Yao', 5, 15),
(187, '2410', 'ท่าตะเกียบ   ', 'Tha Takiap', 5, 15),
(188, '2411', 'คลองเขื่อน   ', 'Khlong Khuean', 5, 15),
(189, '2501', 'เมืองปราจีนบุรี   ', 'Mueang Prachin Buri', 5, 16),
(190, '2502', 'กบินทร์บุรี   ', 'Kabin Buri', 5, 16),
(191, '2503', 'นาดี   ', 'Na Di', 5, 16),
(192, '2504', '*สระแก้ว   ', 'Sa Kaeo', 5, 16),
(193, '2505', '*วังน้ำเย็น   ', 'Wang Nam Yen', 5, 16),
(194, '2506', 'บ้านสร้าง   ', 'Ban Sang', 5, 16),
(195, '2507', 'ประจันตคาม   ', 'Prachantakham', 5, 16),
(196, '2508', 'ศรีมหาโพธิ   ', 'Si Maha Phot', 5, 16),
(197, '2509', 'ศรีมโหสถ   ', 'Si Mahosot', 5, 16),
(198, '2510', '*อรัญประเทศ   ', 'Aranyaprathet', 5, 16),
(199, '2511', '*ตาพระยา   ', 'Ta Phraya', 5, 16),
(200, '2512', '*วัฒนานคร   ', 'Watthana Nakhon', 5, 16),
(201, '2513', '*คลองหาด   ', 'Khlong Hat', 5, 16),
(202, '2601', 'เมืองนครนายก   ', 'Mueang Nakhon Nayok', 2, 17),
(203, '2602', 'ปากพลี   ', 'Pak Phli', 2, 17),
(204, '2603', 'บ้านนา   ', 'Ban Na', 2, 17),
(205, '2604', 'องครักษ์   ', 'Ongkharak', 2, 17),
(206, '2701', 'เมืองสระแก้ว   ', 'Mueang Sa Kaeo', 5, 18),
(207, '2702', 'คลองหาด   ', 'Khlong Hat', 5, 18),
(208, '2703', 'ตาพระยา   ', 'Ta Phraya', 5, 18),
(209, '2704', 'วังน้ำเย็น   ', 'Wang Nam Yen', 5, 18),
(210, '2705', 'วัฒนานคร   ', 'Watthana Nakhon', 5, 18),
(211, '2706', 'อรัญประเทศ   ', 'Aranyaprathet', 5, 18),
(212, '2707', 'เขาฉกรรจ์   ', 'Khao Chakan', 5, 18),
(213, '2708', 'โคกสูง   ', 'Khok Sung', 5, 18),
(214, '2709', 'วังสมบูรณ์   ', 'Wang Sombun', 5, 18),
(215, '3001', 'เมืองนครราชสีมา   ', 'Mueang Nakhon Ratchasima', 3, 19),
(216, '3002', 'ครบุรี   ', 'Khon Buri', 3, 19),
(217, '3003', 'เสิงสาง   ', 'Soeng Sang', 3, 19),
(218, '3004', 'คง   ', 'Khong', 3, 19),
(219, '3005', 'บ้านเหลื่อม   ', 'Ban Lueam', 3, 19),
(220, '3006', 'จักราช   ', 'Chakkarat', 3, 19),
(221, '3007', 'โชคชัย   ', 'Chok Chai', 3, 19),
(222, '3008', 'ด่านขุนทด   ', 'Dan Khun Thot', 3, 19),
(223, '3009', 'โนนไทย   ', 'Non Thai', 3, 19),
(224, '3010', 'โนนสูง   ', 'Non Sung', 3, 19),
(225, '3011', 'ขามสะแกแสง   ', 'Kham Sakaesaeng', 3, 19),
(226, '3012', 'บัวใหญ่   ', 'Bua Yai', 3, 19),
(227, '3013', 'ประทาย   ', 'Prathai', 3, 19),
(228, '3014', 'ปักธงชัย   ', 'Pak Thong Chai', 3, 19),
(229, '3015', 'พิมาย   ', 'Phimai', 3, 19),
(230, '3016', 'ห้วยแถลง   ', 'Huai Thalaeng', 3, 19),
(231, '3017', 'ชุมพวง   ', 'Chum Phuang', 3, 19),
(232, '3018', 'สูงเนิน   ', 'Sung Noen', 3, 19),
(233, '3019', 'ขามทะเลสอ   ', 'Kham Thale So', 3, 19),
(234, '3020', 'สีคิ้ว   ', 'Sikhio', 3, 19),
(235, '3021', 'ปากช่อง   ', 'Pak Chong', 3, 19),
(236, '3022', 'หนองบุญมาก   ', 'Nong Bunnak', 3, 19),
(237, '3023', 'แก้งสนามนาง   ', 'Kaeng Sanam Nang', 3, 19),
(238, '3024', 'โนนแดง   ', 'Non Daeng', 3, 19),
(239, '3025', 'วังน้ำเขียว   ', 'Wang Nam Khiao', 3, 19),
(240, '3026', 'เทพารักษ์   ', 'Thepharak', 3, 19),
(241, '3027', 'เมืองยาง   ', 'Mueang Yang', 3, 19),
(242, '3028', 'พระทองคำ   ', 'Phra Thong Kham', 3, 19),
(243, '3029', 'ลำทะเมนชัย   ', 'Lam Thamenchai', 3, 19),
(244, '3030', 'บัวลาย   ', 'Bua Lai', 3, 19),
(245, '3031', 'สีดา   ', 'Sida', 3, 19),
(246, '3032', 'เฉลิมพระเกียรติ   ', 'Chaloem Phra Kiat', 3, 19),
(247, '3049', 'ท้องถิ่นเทศบาลตำบลโพธิ์กลาง*   ', 'Pho Krang', 3, 19),
(248, '3051', 'สาขาตำบลมะค่า-พลสงคราม*   ', 'Ma Ka-Pon Songkram*', 3, 19),
(249, '3081', '*โนนลาว   ', '*Non Lao', 3, 19),
(250, '3101', 'เมืองบุรีรัมย์   ', 'Mueang Buri Ram', 3, 20),
(251, '3102', 'คูเมือง   ', 'Khu Mueang', 3, 20),
(252, '3103', 'กระสัง', 'Krasang', 3, 20),
(253, '3104', 'นางรอง   ', 'Nang Rong', 3, 20),
(254, '3105', 'หนองกี่   ', 'Nong Ki', 3, 20),
(255, '3106', 'ละหานทราย   ', 'Lahan Sai', 3, 20),
(256, '3107', 'ประโคนชัย   ', 'Prakhon Chai', 3, 20),
(257, '3108', 'บ้านกรวด   ', 'Ban Kruat', 3, 20),
(258, '3109', 'พุทไธสง   ', 'Phutthaisong', 3, 20),
(259, '3110', 'ลำปลายมาศ   ', 'Lam Plai Mat', 3, 20),
(260, '3111', 'สตึก   ', 'Satuek', 3, 20),
(261, '3112', 'ปะคำ   ', 'Pakham', 3, 20),
(262, '3113', 'นาโพธิ์   ', 'Na Pho', 3, 20),
(263, '3114', 'หนองหงส์   ', 'Nong Hong', 3, 20),
(264, '3115', 'พลับพลาชัย   ', 'Phlapphla Chai', 3, 20),
(265, '3116', 'ห้วยราช   ', 'Huai Rat', 3, 20),
(266, '3117', 'โนนสุวรรณ   ', 'Non Suwan', 3, 20),
(267, '3118', 'ชำนิ   ', 'Chamni', 3, 20),
(268, '3119', 'บ้านใหม่ไชยพจน์   ', 'Ban Mai Chaiyaphot', 3, 20),
(269, '3120', 'โนนดินแดง   ', 'Din Daeng', 3, 20),
(270, '3121', 'บ้านด่าน   ', 'Ban Dan', 3, 20),
(271, '3122', 'แคนดง   ', 'Khaen Dong', 3, 20),
(272, '3123', 'เฉลิมพระเกียรติ   ', 'Chaloem Phra Kiat', 3, 20),
(273, '3201', 'เมืองสุรินทร์   ', 'Mueang Surin', 3, 21),
(274, '3202', 'ชุมพลบุรี   ', 'Chumphon Buri', 3, 21),
(275, '3203', 'ท่าตูม   ', 'Tha Tum', 3, 21),
(276, '3204', 'จอมพระ   ', 'Chom Phra', 3, 21),
(277, '3205', 'ปราสาท   ', 'Prasat', 3, 21),
(278, '3206', 'กาบเชิง   ', 'Kap Choeng', 3, 21),
(279, '3207', 'รัตนบุรี   ', 'Rattanaburi', 3, 21),
(280, '3208', 'สนม   ', 'Sanom', 3, 21),
(281, '3209', 'ศีขรภูมิ   ', 'Sikhoraphum', 3, 21),
(282, '3210', 'สังขะ   ', 'Sangkha', 3, 21),
(283, '3211', 'ลำดวน   ', 'Lamduan', 3, 21),
(284, '3212', 'สำโรงทาบ   ', 'Samrong Thap', 3, 21),
(285, '3213', 'บัวเชด   ', 'Buachet', 3, 21),
(286, '3214', 'พนมดงรัก   ', 'Phanom Dong Rak', 3, 21),
(287, '3215', 'ศรีณรงค์   ', 'Si Narong', 3, 21),
(288, '3216', 'เขวาสินรินทร์   ', 'Khwao Sinarin', 3, 21),
(289, '3217', 'โนนนารายณ์   ', 'Non Narai', 3, 21),
(290, '3301', 'เมืองศรีสะเกษ   ', 'Mueang Si Sa Ket', 3, 22),
(291, '3302', 'ยางชุมน้อย   ', 'Yang Chum Noi', 3, 22),
(292, '3303', 'กันทรารมย์   ', 'Kanthararom', 3, 22),
(293, '3304', 'กันทรลักษ์   ', 'Kantharalak', 3, 22),
(294, '3305', 'ขุขันธ์   ', 'Khukhan', 3, 22),
(295, '3306', 'ไพรบึง   ', 'Phrai Bueng', 3, 22),
(296, '3307', 'ปรางค์กู่   ', 'Prang Ku', 3, 22),
(297, '3308', 'ขุนหาญ   ', 'Khun Han', 3, 22),
(298, '3309', 'ราษีไศล   ', 'Rasi Salai', 3, 22),
(299, '3310', 'อุทุมพรพิสัย   ', 'Uthumphon Phisai', 3, 22),
(300, '3311', 'บึงบูรพ์   ', 'Bueng Bun', 3, 22),
(301, '3312', 'ห้วยทับทัน   ', 'Huai Thap Than', 3, 22),
(302, '3313', 'โนนคูณ   ', 'Non Khun', 3, 22),
(303, '3314', 'ศรีรัตนะ   ', 'Si Rattana', 3, 22),
(304, '3315', 'น้ำเกลี้ยง   ', 'Si Rattana', 3, 22),
(305, '3316', 'วังหิน   ', 'Wang Hin', 3, 22),
(306, '3317', 'ภูสิงห์   ', 'Phu Sing', 3, 22),
(307, '3318', 'เมืองจันทร์   ', 'Mueang Chan', 3, 22),
(308, '3319', 'เบญจลักษ์   ', 'Benchalak', 3, 22),
(309, '3320', 'พยุห์   ', 'Phayu', 3, 22),
(310, '3321', 'โพธิ์ศรีสุวรรณ   ', 'Pho Si Suwan', 3, 22),
(311, '3322', 'ศิลาลาด   ', 'Sila Lat', 3, 22),
(312, '3401', 'เมืองอุบลราชธานี   ', 'Mueang Ubon Ratchathani', 3, 23),
(313, '3402', 'ศรีเมืองใหม่   ', 'Si Mueang Mai', 3, 23),
(314, '3403', 'โขงเจียม   ', 'Khong Chiam', 3, 23),
(315, '3404', 'เขื่องใน   ', 'Khueang Nai', 3, 23),
(316, '3405', 'เขมราฐ   ', 'Khemarat', 3, 23),
(317, '3406', '*ชานุมาน   ', '*Shanuman', 3, 23),
(318, '3407', 'เดชอุดม   ', 'Det Udom', 3, 23),
(319, '3408', 'นาจะหลวย   ', 'Na Chaluai', 3, 23),
(320, '3409', 'น้ำยืน   ', 'Nam Yuen', 3, 23),
(321, '3410', 'บุณฑริก   ', 'Buntharik', 3, 23),
(322, '3411', 'ตระการพืชผล   ', 'Trakan Phuet Phon', 3, 23),
(323, '3412', 'กุดข้าวปุ้น   ', 'Kut Khaopun', 3, 23),
(324, '3413', '*พนา   ', '*Phana', 3, 23),
(325, '3414', 'ม่วงสามสิบ   ', 'Muang Sam Sip', 3, 23),
(326, '3415', 'วารินชำราบ   ', 'Warin Chamrap', 3, 23),
(327, '3416', '*อำนาจเจริญ   ', '*Amnat Charoen', 3, 23),
(328, '3417', '*เสนางคนิคม   ', '*Senangkhanikhom', 3, 23),
(329, '3418', '*หัวตะพาน   ', '*Hua Taphan', 3, 23),
(330, '3419', 'พิบูลมังสาหาร   ', 'Phibun Mangsahan', 3, 23),
(331, '3420', 'ตาลสุม   ', 'Tan Sum', 3, 23),
(332, '3421', 'โพธิ์ไทร   ', 'Pho Sai', 3, 23),
(333, '3422', 'สำโรง   ', 'Samrong', 3, 23),
(334, '3423', '*กิ่งอำเภอลืออำนาจ   ', '*King Amphoe Lue Amnat', 3, 23),
(335, '3424', 'ดอนมดแดง   ', 'Don Mot Daeng', 3, 23),
(336, '3425', 'สิรินธร   ', 'Sirindhorn', 3, 23),
(337, '3426', 'ทุ่งศรีอุดม   ', 'Thung Si Udom', 3, 23),
(338, '3427', '*ปทุมราชวงศา   ', '*Pathum Ratchawongsa', 3, 23),
(339, '3428', '*กิ่งอำเภอศรีหลักชัย   ', '*King Amphoe Sri Lunk Chai', 3, 23),
(340, '3429', 'นาเยีย   ', 'Na Yia', 3, 23),
(341, '3430', 'นาตาล   ', 'Na Tan', 3, 23),
(342, '3431', 'เหล่าเสือโก้ก   ', 'Lao Suea Kok', 3, 23),
(343, '3432', 'สว่างวีระวงศ์   ', 'Sawang Wirawong', 3, 23),
(344, '3433', 'น้ำขุ่น   ', 'Nam Khun', 3, 23),
(345, '3481', '*อ.สุวรรณวารี  จ.อุบลราชธานี   ', '*Suwan Wari', 3, 23),
(346, '3501', 'เมืองยโสธร   ', 'Mueang Yasothon', 3, 24),
(347, '3502', 'ทรายมูล   ', 'Sai Mun', 3, 24),
(348, '3503', 'กุดชุม   ', 'Kut Chum', 3, 24),
(349, '3504', 'คำเขื่อนแก้ว   ', 'Kham Khuean Kaeo', 3, 24),
(350, '3505', 'ป่าติ้ว   ', 'Pa Tio', 3, 24),
(351, '3506', 'มหาชนะชัย   ', 'Maha Chana Chai', 3, 24),
(352, '3507', 'ค้อวัง   ', 'Kho Wang', 3, 24),
(353, '3508', 'เลิงนกทา   ', 'Loeng Nok Tha', 3, 24),
(354, '3509', 'ไทยเจริญ   ', 'Thai Charoen', 3, 24),
(355, '3601', 'เมืองชัยภูมิ   ', 'Mueang Chaiyaphum', 3, 25),
(356, '3602', 'บ้านเขว้า   ', 'Ban Khwao', 3, 25),
(357, '3603', 'คอนสวรรค์   ', 'Khon Sawan', 3, 25),
(358, '3604', 'เกษตรสมบูรณ์   ', 'Kaset Sombun', 3, 25),
(359, '3605', 'หนองบัวแดง   ', 'Nong Bua Daeng', 3, 25),
(360, '3606', 'จัตุรัส   ', 'Chatturat', 3, 25),
(361, '3607', 'บำเหน็จณรงค์   ', 'Bamnet Narong', 3, 25),
(362, '3608', 'หนองบัวระเหว   ', 'Nong Bua Rawe', 3, 25),
(363, '3609', 'เทพสถิต   ', 'Thep Sathit', 3, 25),
(364, '3610', 'ภูเขียว   ', 'Phu Khiao', 3, 25),
(365, '3611', 'บ้านแท่น   ', 'Ban Thaen', 3, 25),
(366, '3612', 'แก้งคร้อ   ', 'Kaeng Khro', 3, 25),
(367, '3613', 'คอนสาร   ', 'Khon San', 3, 25),
(368, '3614', 'ภักดีชุมพล   ', 'Phakdi Chumphon', 3, 25),
(369, '3615', 'เนินสง่า   ', 'Noen Sa-nga', 3, 25),
(370, '3616', 'ซับใหญ่   ', 'Sap Yai', 3, 25),
(371, '3651', 'เมืองชัยภูมิ (สาขาตำบลโนนสำราญ)*   ', 'Mueang Chaiyaphum(Non Sumran)*', 3, 25),
(372, '3652', 'สาขาตำบลบ้านหว่าเฒ่า*   ', 'Ban Wha Tao*', 3, 25),
(373, '3653', 'หนองบัวแดง (สาขาตำบลวังชมภู)*   ', 'Nong Bua Daeng', 3, 25),
(374, '3654', 'กิ่งอำเภอซับใหญ่ (สาขาตำบลซับใหญ่)*   ', 'King Amphoe Sap Yai*', 3, 25),
(375, '3655', 'สาขาตำบลโคกเพชร*   ', 'Coke Phet*', 3, 25),
(376, '3656', 'เทพสถิต (สาขาตำบลนายางกลัก)*   ', 'Thep Sathit*', 3, 25),
(377, '3657', 'บ้านแท่น (สาขาตำบลบ้านเต่า)*   ', 'Ban Thaen', 3, 25),
(378, '3658', 'แก้งคร้อ (สาขาตำบลท่ามะไฟหวาน)*   ', 'Kaeng Khro*', 3, 25),
(379, '3659', 'คอนสาร (สาขาตำบลโนนคูณ)*   ', 'Khon San*', 3, 25),
(380, '3701', 'เมืองอำนาจเจริญ   ', 'Mueang Amnat Charoen', 3, 26),
(381, '3702', 'ชานุมาน   ', 'Chanuman', 3, 26),
(382, '3703', 'ปทุมราชวงศา   ', 'Pathum Ratchawongsa', 3, 26),
(383, '3704', 'พนา   ', 'Phana', 3, 26),
(384, '3705', 'เสนางคนิคม   ', 'Senangkhanikhom', 3, 26),
(385, '3706', 'หัวตะพาน   ', 'Hua Taphan', 3, 26),
(386, '3707', 'ลืออำนาจ   ', 'Lue Amnat', 3, 26),
(387, '3901', 'เมืองหนองบัวลำภู   ', 'Mueang Nong Bua Lam Phu', 3, 27),
(388, '3902', 'นากลาง   ', 'Na Klang', 3, 27),
(389, '3903', 'โนนสัง   ', 'Non Sang', 3, 27),
(390, '3904', 'ศรีบุญเรือง   ', 'Si Bun Rueang', 3, 27),
(391, '3905', 'สุวรรณคูหา   ', 'Suwannakhuha', 3, 27),
(392, '3906', 'นาวัง   ', 'Na Wang', 3, 27),
(393, '4001', 'เมืองขอนแก่น   ', 'Mueang Khon Kaen', 3, 28),
(394, '4002', 'บ้านฝาง   ', 'Ban Fang', 3, 28),
(395, '4003', 'พระยืน   ', 'Phra Yuen', 3, 28),
(396, '4004', 'หนองเรือ   ', 'Nong Ruea', 3, 28),
(397, '4005', 'ชุมแพ   ', 'Chum Phae', 3, 28),
(398, '4006', 'สีชมพู   ', 'Si Chomphu', 3, 28),
(399, '4007', 'น้ำพอง   ', 'Nam Phong', 3, 28),
(400, '4008', 'อุบลรัตน์   ', 'Ubolratana', 3, 28),
(401, '4009', 'กระนวน   ', 'Kranuan', 3, 28),
(402, '4010', 'บ้านไผ่   ', 'Ban Phai', 3, 28),
(403, '4011', 'เปือยน้อย   ', 'Pueai Noi', 3, 28),
(404, '4012', 'พล   ', 'Phon', 3, 28),
(405, '4013', 'แวงใหญ่   ', 'Waeng Yai', 3, 28),
(406, '4014', 'แวงน้อย   ', 'Waeng Noi', 3, 28),
(407, '4015', 'หนองสองห้อง   ', 'Nong Song Hong', 3, 28),
(408, '4016', 'ภูเวียง   ', 'Phu Wiang', 3, 28),
(409, '4017', 'มัญจาคีรี   ', 'Mancha Khiri', 3, 28),
(410, '4018', 'ชนบท   ', 'Chonnabot', 3, 28),
(411, '4019', 'เขาสวนกวาง   ', 'Khao Suan Kwang', 3, 28),
(412, '4020', 'ภูผาม่าน   ', 'Phu Pha Man', 3, 28),
(413, '4021', 'ซำสูง   ', 'Sam Sung', 3, 28),
(414, '4022', 'โคกโพธิ์ไชย   ', 'Khok Pho Chai', 3, 28),
(415, '4023', 'หนองนาคำ   ', 'Nong Na Kham', 3, 28),
(416, '4024', 'บ้านแฮด   ', 'Ban Haet', 3, 28),
(417, '4025', 'โนนศิลา   ', 'Non Sila', 3, 28),
(418, '4029', 'เวียงเก่า   ', 'Wiang Kao', 3, 28),
(419, '4068', 'ท้องถิ่นเทศบาลตำบลบ้านเป็ด*   ', 'Ban Pet*', 3, 28),
(420, '4098', 'เทศบาลตำบลเมืองพล*   ', 'Tet Saban Tambon Muang Phon*', 3, 28),
(421, '4101', 'เมืองอุดรธานี   ', 'Mueang Udon Thani', 3, 29),
(422, '4102', 'กุดจับ   ', 'Kut Chap', 3, 29),
(423, '4103', 'หนองวัวซอ   ', 'Nong Wua So', 3, 29),
(424, '4104', 'กุมภวาปี   ', 'Kumphawapi', 3, 29),
(425, '4105', 'โนนสะอาด   ', 'Non Sa-at', 3, 29),
(426, '4106', 'หนองหาน   ', 'Nong Han', 3, 29),
(427, '4107', 'ทุ่งฝน   ', 'Thung Fon', 3, 29),
(428, '4108', 'ไชยวาน   ', 'Chai Wan', 3, 29),
(429, '4109', 'ศรีธาตุ   ', 'Si That', 3, 29),
(430, '4110', 'วังสามหมอ   ', 'Wang Sam Mo', 3, 29),
(431, '4111', 'บ้านดุง   ', 'Ban Dung', 3, 29),
(432, '4112', '*หนองบัวลำภู   ', '*Nong Bua Lam Phu', 3, 29),
(433, '4113', '*ศรีบุญเรือง   ', '*Si Bun Rueang', 3, 29),
(434, '4114', '*นากลาง   ', '*Na Klang', 3, 29),
(435, '4115', '*สุวรรณคูหา   ', '*Suwannakhuha', 3, 29),
(436, '4116', '*โนนสัง   ', '*Non Sang', 3, 29),
(437, '4117', 'บ้านผือ   ', 'Ban Phue', 3, 29),
(438, '4118', 'น้ำโสม   ', 'Nam Som', 3, 29),
(439, '4119', 'เพ็ญ   ', 'Phen', 3, 29),
(440, '4120', 'สร้างคอม   ', 'Sang Khom', 3, 29),
(441, '4121', 'หนองแสง   ', 'Nong Saeng', 3, 29),
(442, '4122', 'นายูง   ', 'Na Yung', 3, 29),
(443, '4123', 'พิบูลย์รักษ์   ', 'Phibun Rak', 3, 29),
(444, '4124', 'กู่แก้ว   ', 'Ku Kaeo', 3, 29),
(445, '4125', 'ประจักษ์ศิลปาคม   ', 'rachak-sinlapakhom', 3, 29),
(446, '4201', 'เมืองเลย   ', 'Mueang Loei', 3, 30),
(447, '4202', 'นาด้วง   ', 'Na Duang', 3, 30),
(448, '4203', 'เชียงคาน   ', 'Chiang Khan', 3, 30),
(449, '4204', 'ปากชม   ', 'Pak Chom', 3, 30),
(450, '4205', 'ด่านซ้าย   ', 'Dan Sai', 3, 30),
(451, '4206', 'นาแห้ว   ', 'Na Haeo', 3, 30),
(452, '4207', 'ภูเรือ   ', 'Phu Ruea', 3, 30),
(453, '4208', 'ท่าลี่   ', 'Tha Li', 3, 30),
(454, '4209', 'วังสะพุง   ', 'Wang Saphung', 3, 30),
(455, '4210', 'ภูกระดึง   ', 'Phu Kradueng', 3, 30),
(456, '4211', 'ภูหลวง   ', 'Phu Luang', 3, 30),
(457, '4212', 'ผาขาว   ', 'Pha Khao', 3, 30),
(458, '4213', 'เอราวัณ   ', 'Erawan', 3, 30),
(459, '4214', 'หนองหิน   ', 'Nong Hin', 3, 30),
(460, '4301', 'เมืองหนองคาย   ', 'Mueang Nong Khai', 3, 31),
(461, '4302', 'ท่าบ่อ   ', 'Tha Bo', 3, 31),
(462, '4303', 'เมืองบึงกาฬ   ', 'Mueang Bueng Kan', 3, 97),
(463, '4304', 'พรเจริญ   ', 'Phon Charoen', 3, 97),
(464, '4305', 'โพนพิสัย   ', 'Phon Phisai', 3, 31),
(465, '4306', 'โซ่พิสัย   ', 'So Phisai', 3, 97),
(466, '4307', 'ศรีเชียงใหม่   ', 'Si Chiang Mai', 3, 31),
(467, '4308', 'สังคม   ', 'Sangkhom', 3, 31),
(468, '4309', 'เซกา   ', 'Seka', 3, 97),
(469, '4310', 'ปากคาด   ', 'Pak Khat', 3, 97),
(470, '4311', 'บึงโขงหลง   ', 'Bueng Khong Long', 3, 97),
(471, '4312', 'ศรีวิไล   ', 'Si Wilai', 3, 97),
(472, '4313', 'บุ่งคล้า   ', 'Bung Khla', 3, 97),
(473, '4314', 'สระใคร   ', 'Sakhrai', 3, 31),
(474, '4315', 'เฝ้าไร่   ', 'Fao Rai', 3, 31),
(475, '4316', 'รัตนวาปี   ', 'Rattanawapi', 3, 31),
(476, '4317', 'โพธิ์ตาก   ', 'Pho Tak', 3, 31),
(477, '4401', 'เมืองมหาสารคาม   ', 'Mueang Maha Sarakham', 3, 32),
(478, '4402', 'แกดำ   ', 'Kae Dam', 3, 32),
(479, '4403', 'โกสุมพิสัย   ', 'Kosum Phisai', 3, 32),
(480, '4404', 'กันทรวิชัย   ', 'Kantharawichai', 3, 32),
(481, '4405', 'เชียงยืน   ', 'Kantharawichai', 3, 32),
(482, '4406', 'บรบือ   ', 'Borabue', 3, 32),
(483, '4407', 'นาเชือก   ', 'Na Chueak', 3, 32),
(484, '4408', 'พยัคฆภูมิพิสัย   ', 'Phayakkhaphum Phisai', 3, 32),
(485, '4409', 'วาปีปทุม   ', 'Wapi Pathum', 3, 32),
(486, '4410', 'นาดูน   ', 'Na Dun', 3, 32),
(487, '4411', 'ยางสีสุราช   ', 'Yang Sisurat', 3, 32),
(488, '4412', 'กุดรัง   ', 'Kut Rang', 3, 32),
(489, '4413', 'ชื่นชม   ', 'Chuen Chom', 3, 32),
(490, '4481', '*หลุบ   ', '*Lub', 3, 32),
(491, '4501', 'เมืองร้อยเอ็ด   ', 'Mueang Roi Et', 3, 33),
(492, '4502', 'เกษตรวิสัย   ', 'Kaset Wisai', 3, 33),
(493, '4503', 'ปทุมรัตต์   ', 'Pathum Rat', 3, 33),
(494, '4504', 'จตุรพักตรพิมาน   ', 'Chaturaphak Phiman', 3, 33),
(495, '4505', 'ธวัชบุรี   ', 'Thawat Buri', 3, 33),
(496, '4506', 'พนมไพร   ', 'Phanom Phrai', 3, 33),
(497, '4507', 'โพนทอง   ', 'Phon Thong', 3, 33),
(498, '4508', 'โพธิ์ชัย   ', 'Pho Chai', 3, 33),
(499, '4509', 'หนองพอก   ', 'Nong Phok', 3, 33),
(500, '4510', 'เสลภูมิ   ', 'Selaphum', 3, 33),
(501, '4511', 'สุวรรณภูมิ   ', 'Suwannaphum', 3, 33),
(502, '4512', 'เมืองสรวง   ', 'Mueang Suang', 3, 33),
(503, '4513', 'โพนทราย   ', 'Phon Sai', 3, 33),
(504, '4514', 'อาจสามารถ   ', 'At Samat', 3, 33),
(505, '4515', 'เมยวดี   ', 'Moei Wadi', 3, 33),
(506, '4516', 'ศรีสมเด็จ   ', 'Si Somdet', 3, 33),
(507, '4517', 'จังหาร   ', 'Changhan', 3, 33),
(508, '4518', 'เชียงขวัญ   ', 'Chiang Khwan', 3, 33),
(509, '4519', 'หนองฮี   ', 'Nong Hi', 3, 33),
(510, '4520', 'ทุ่งเขาหลวง   ', 'Thung Khao Luangกิ่', 3, 33),
(511, '4601', 'เมืองกาฬสินธุ์   ', 'Mueang Kalasin', 3, 34),
(512, '4602', 'นามน   ', 'Na Mon', 3, 34),
(513, '4603', 'กมลาไสย   ', 'Kamalasai', 3, 34),
(514, '4604', 'ร่องคำ   ', 'Rong Kham', 3, 34),
(515, '4605', 'กุฉินารายณ์   ', 'Kuchinarai', 3, 34),
(516, '4606', 'เขาวง   ', 'Khao Wong', 3, 34),
(517, '4607', 'ยางตลาด   ', 'Yang Talat', 3, 34),
(518, '4608', 'ห้วยเม็ก   ', 'Huai Mek', 3, 34),
(519, '4609', 'สหัสขันธ์   ', 'Sahatsakhan', 3, 34),
(520, '4610', 'คำม่วง   ', 'Kham Muang', 3, 34),
(521, '4611', 'ท่าคันโท   ', 'Tha Khantho', 3, 34),
(522, '4612', 'หนองกุงศรี   ', 'Nong Kung Si', 3, 34),
(523, '4613', 'สมเด็จ   ', 'Somdet', 3, 34),
(524, '4614', 'ห้วยผึ้ง   ', 'Huai Phueng', 3, 34),
(525, '4615', 'สามชัย   ', 'Sam Chai', 3, 34),
(526, '4616', 'นาคู   ', 'Na Khu', 3, 34),
(527, '4617', 'ดอนจาน   ', 'Don Chan', 3, 34),
(528, '4618', 'ฆ้องชัย   ', 'Khong Chai', 3, 34),
(529, '4701', 'เมืองสกลนคร   ', 'Mueang Sakon Nakhon', 3, 35),
(530, '4702', 'กุสุมาลย์   ', 'Kusuman', 3, 35),
(531, '4703', 'กุดบาก   ', 'Kut Bak', 3, 35),
(532, '4704', 'พรรณานิคม   ', 'Phanna Nikhom', 3, 35),
(533, '4705', 'พังโคน   ', 'Phang Khon', 3, 35),
(534, '4706', 'วาริชภูมิ   ', 'Waritchaphum', 3, 35),
(535, '4707', 'นิคมน้ำอูน   ', 'Nikhom Nam Un', 3, 35),
(536, '4708', 'วานรนิวาส   ', 'Wanon Niwat', 3, 35),
(537, '4709', 'คำตากล้า   ', 'Kham Ta Kla', 3, 35),
(538, '4710', 'บ้านม่วง   ', 'Ban Muang', 3, 35),
(539, '4711', 'อากาศอำนวย   ', 'Akat Amnuai', 3, 35),
(540, '4712', 'สว่างแดนดิน   ', 'Sawang Daen Din', 3, 35),
(541, '4713', 'ส่องดาว   ', 'Song Dao', 3, 35),
(542, '4714', 'เต่างอย   ', 'Tao Ngoi', 3, 35),
(543, '4715', 'โคกศรีสุพรรณ   ', 'Khok Si Suphan', 3, 35),
(544, '4716', 'เจริญศิลป์   ', 'Charoen Sin', 3, 35),
(545, '4717', 'โพนนาแก้ว   ', 'Phon Na Kaeo', 3, 35),
(546, '4718', 'ภูพาน   ', 'Phu Phan', 3, 35),
(547, '4751', 'วานรนิวาส (สาขาตำบลกุดเรือคำ)*   ', 'Wanon Niwat', 3, 35),
(548, '4781', '*อ.บ้านหัน  จ.สกลนคร   ', '*Banhan', 3, 35),
(549, '4801', 'เมืองนครพนม   ', 'Mueang Nakhon Phanom', 3, 36),
(550, '4802', 'ปลาปาก   ', 'Pla Pak', 3, 36),
(551, '4803', 'ท่าอุเทน   ', 'Tha Uthen', 3, 36),
(552, '4804', 'บ้านแพง   ', 'Ban Phaeng', 3, 36),
(553, '4805', 'ธาตุพนม   ', 'That Phanom', 3, 36),
(554, '4806', 'เรณูนคร   ', 'Renu Nakhon', 3, 36),
(555, '4807', 'นาแก   ', 'Na Kae', 3, 36),
(556, '4808', 'ศรีสงคราม   ', 'Si Songkhram', 3, 36),
(557, '4809', 'นาหว้า   ', 'Na Wa', 3, 36),
(558, '4810', 'โพนสวรรค์   ', 'Phon Sawan', 3, 36),
(559, '4811', 'นาทม   ', 'Na Thom', 3, 36),
(560, '4812', 'วังยาง   ', 'Wang Yang', 3, 36),
(561, '4901', 'เมืองมุกดาหาร   ', 'Mueang Mukdahan', 3, 37),
(562, '4902', 'นิคมคำสร้อย   ', 'Nikhom Kham Soi', 3, 37),
(563, '4903', 'ดอนตาล   ', 'Don Tan', 3, 37),
(564, '4904', 'ดงหลวง   ', 'Dong Luang', 3, 37),
(565, '4905', 'คำชะอี   ', 'Khamcha-i', 3, 37),
(566, '4906', 'หว้านใหญ่   ', 'Wan Yai', 3, 37),
(567, '4907', 'หนองสูง   ', 'Nong Sung', 3, 37),
(568, '5001', 'เมืองเชียงใหม่   ', 'Mueang Chiang Mai', 1, 38),
(569, '5002', 'จอมทอง   ', 'Chom Thong', 1, 38),
(570, '5003', 'แม่แจ่ม   ', 'Mae Chaem', 1, 38),
(571, '5004', 'เชียงดาว   ', 'Chiang Dao', 1, 38),
(572, '5005', 'ดอยสะเก็ด   ', 'Doi Saket', 1, 38),
(573, '5006', 'แม่แตง   ', 'Mae Taeng', 1, 38),
(574, '5007', 'แม่ริม   ', 'Mae Rim', 1, 38),
(575, '5008', 'สะเมิง   ', 'Samoeng', 1, 38),
(576, '5009', 'ฝาง   ', 'Fang', 1, 38),
(577, '5010', 'แม่อาย   ', 'Mae Ai', 1, 38),
(578, '5011', 'พร้าว   ', 'Phrao', 1, 38),
(579, '5012', 'สันป่าตอง   ', 'San Pa Tong', 1, 38),
(580, '5013', 'สันกำแพง   ', 'San Kamphaeng', 1, 38),
(581, '5014', 'สันทราย   ', 'San Sai', 1, 38),
(582, '5015', 'หางดง   ', 'Hang Dong', 1, 38),
(583, '5016', 'ฮอด   ', 'Hot', 1, 38),
(584, '5017', 'ดอยเต่า   ', 'Doi Tao', 1, 38),
(585, '5018', 'อมก๋อย   ', 'Omkoi', 1, 38),
(586, '5019', 'สารภี   ', 'Saraphi', 1, 38),
(587, '5020', 'เวียงแหง   ', 'Wiang Haeng', 1, 38),
(588, '5021', 'ไชยปราการ   ', 'Chai Prakan', 1, 38),
(589, '5022', 'แม่วาง   ', 'Mae Wang', 1, 38),
(590, '5023', 'แม่ออน   ', 'Mae On', 1, 38),
(591, '5024', 'ดอยหล่อ   ', 'Doi Lo', 1, 38),
(592, '5051', 'เทศบาลนครเชียงใหม่ (สาขาแขวงกาลวิละ)*   ', 'Tet Saban Nakorn Chiangmai(Kan lawi la)*', 1, 38),
(593, '5052', 'เทศบาลนครเชียงใหม่ (สาขาแขวงศรีวิชั)*   ', 'Tet Saban Nakorn Chiangmai(Sri Wi)*', 1, 38),
(594, '5053', 'เทศบาลนครเชียงใหม่ (สาขาเม็งราย)*   ', 'Tet Saban Nakorn Chiangmai(Meng Rai)*', 1, 38),
(595, '5101', 'เมืองลำพูน   ', 'Mueang Lamphun', 1, 39),
(596, '5102', 'แม่ทา   ', 'Mae Tha', 1, 39),
(597, '5103', 'บ้านโฮ่ง   ', 'Ban Hong', 1, 39),
(598, '5104', 'ลี้   ', 'Li', 1, 39),
(599, '5105', 'ทุ่งหัวช้าง   ', 'Thung Hua Chang', 1, 39),
(600, '5106', 'ป่าซาง   ', 'Pa Sang', 1, 39),
(601, '5107', 'บ้านธิ   ', 'Ban Thi', 1, 39),
(602, '5108', 'เวียงหนองล่อง   ', 'Wiang Nong Long', 1, 39),
(603, '5201', 'เมืองลำปาง   ', 'Mueang Lampang', 1, 40),
(604, '5202', 'แม่เมาะ   ', 'Mae Mo', 1, 40),
(605, '5203', 'เกาะคา   ', 'Ko Kha', 1, 40),
(606, '5204', 'เสริมงาม   ', 'Soem Ngam', 1, 40),
(607, '5205', 'งาว   ', 'Ngao', 1, 40),
(608, '5206', 'แจ้ห่ม   ', 'Chae Hom', 1, 40),
(609, '5207', 'วังเหนือ   ', 'Wang Nuea', 1, 40),
(610, '5208', 'เถิน   ', 'Thoen', 1, 40),
(611, '5209', 'แม่พริก   ', 'Mae Phrik', 1, 40),
(612, '5210', 'แม่ทะ   ', 'Mae Tha', 1, 40),
(613, '5211', 'สบปราบ   ', 'Sop Prap', 1, 40),
(614, '5212', 'ห้างฉัตร   ', 'Hang Chat', 1, 40),
(615, '5213', 'เมืองปาน   ', 'Mueang Pan', 1, 40),
(616, '5301', 'เมืองอุตรดิตถ์   ', 'Mueang Uttaradit', 1, 41),
(617, '5302', 'ตรอน   ', 'Tron', 1, 41),
(618, '5303', 'ท่าปลา   ', 'Tha Pla', 1, 41),
(619, '5304', 'น้ำปาด   ', 'Nam Pat', 1, 41),
(620, '5305', 'ฟากท่า   ', 'Fak Tha', 1, 41),
(621, '5306', 'บ้านโคก   ', 'Ban Khok', 1, 41),
(622, '5307', 'พิชัย   ', 'Phichai', 1, 41),
(623, '5308', 'ลับแล   ', 'Laplae', 1, 41),
(624, '5309', 'ทองแสนขัน   ', 'Thong Saen Khan', 1, 41),
(625, '5401', 'เมืองแพร่   ', 'Mueang Phrae', 1, 42),
(626, '5402', 'ร้องกวาง   ', 'Rong Kwang', 1, 42),
(627, '5403', 'ลอง   ', 'Long', 1, 42),
(628, '5404', 'สูงเม่น   ', 'Sung Men', 1, 42),
(629, '5405', 'เด่นชัย   ', 'Den Chai', 1, 42),
(630, '5406', 'สอง   ', 'Song', 1, 42),
(631, '5407', 'วังชิ้น   ', 'Wang Chin', 1, 42),
(632, '5408', 'หนองม่วงไข่   ', 'Nong Muang Khai', 1, 42),
(633, '5501', 'เมืองน่าน   ', 'Mueang Nan', 1, 43),
(634, '5502', 'แม่จริม   ', 'Mae Charim', 1, 43),
(635, '5503', 'บ้านหลวง   ', 'Ban Luang', 1, 43),
(636, '5504', 'นาน้อย   ', 'Na Noi', 1, 43),
(637, '5505', 'ปัว   ', 'Pua', 1, 43),
(638, '5506', 'ท่าวังผา   ', 'Tha Wang Pha', 1, 43),
(639, '5507', 'เวียงสา   ', 'Wiang Sa', 1, 43),
(640, '5508', 'ทุ่งช้าง   ', 'Thung Chang', 1, 43),
(641, '5509', 'เชียงกลาง   ', 'Chiang Klang', 1, 43),
(642, '5510', 'นาหมื่น   ', 'Na Muen', 1, 43),
(643, '5511', 'สันติสุข   ', 'Santi Suk', 1, 43),
(644, '5512', 'บ่อเกลือ   ', 'Bo Kluea', 1, 43),
(645, '5513', 'สองแคว   ', 'Song Khwae', 1, 43),
(646, '5514', 'ภูเพียง   ', 'Phu Phiang', 1, 43),
(647, '5515', 'เฉลิมพระเกียรติ   ', 'Chaloem Phra Kiat', 1, 43),
(648, '5601', 'เมืองพะเยา   ', 'Mueang Phayao', 1, 44),
(649, '5602', 'จุน   ', 'Chun', 1, 44),
(650, '5603', 'เชียงคำ   ', 'Chiang Kham', 1, 44),
(651, '5604', 'เชียงม่วน   ', 'Chiang Muan', 1, 44),
(652, '5605', 'ดอกคำใต้   ', 'Dok Khamtai', 1, 44),
(653, '5606', 'ปง   ', 'Pong', 1, 44),
(654, '5607', 'แม่ใจ   ', 'Mae Chai', 1, 44),
(655, '5608', 'ภูซาง   ', 'Phu Sang', 1, 44),
(656, '5609', 'ภูกามยาว   ', 'Phu Kamyao', 1, 44),
(657, '5701', 'เมืองเชียงราย   ', 'Mueang Chiang Rai', 1, 45),
(658, '5702', 'เวียงชัย   ', 'Wiang Chai', 1, 45),
(659, '5703', 'เชียงของ   ', 'Chiang Khong', 1, 45),
(660, '5704', 'เทิง   ', 'Thoeng', 1, 45),
(661, '5705', 'พาน   ', 'Phan', 1, 45),
(662, '5706', 'ป่าแดด   ', 'Pa Daet', 1, 45),
(663, '5707', 'แม่จัน   ', 'Mae Chan', 1, 45),
(664, '5708', 'เชียงแสน   ', 'Chiang Saen', 1, 45),
(665, '5709', 'แม่สาย   ', 'Mae Sai', 1, 45),
(666, '5710', 'แม่สรวย   ', 'Mae Suai', 1, 45),
(667, '5711', 'เวียงป่าเป้า   ', 'Wiang Pa Pao', 1, 45),
(668, '5712', 'พญาเม็งราย   ', 'Phaya Mengrai', 1, 45),
(669, '5713', 'เวียงแก่น   ', 'Wiang Kaen', 1, 45),
(670, '5714', 'ขุนตาล   ', 'Khun Tan', 1, 45),
(671, '5715', 'แม่ฟ้าหลวง   ', 'Mae Fa Luang', 1, 45),
(672, '5716', 'แม่ลาว   ', 'Mae Lao', 1, 45),
(673, '5717', 'เวียงเชียงรุ้ง   ', 'Wiang Chiang Rung', 1, 45),
(674, '5718', 'ดอยหลวง   ', 'Doi Luang', 1, 45),
(675, '5801', 'เมืองแม่ฮ่องสอน   ', 'Mueang Mae Hong Son', 1, 46),
(676, '5802', 'ขุนยวม   ', 'Khun Yuam', 1, 46),
(677, '5803', 'ปาย   ', 'Pai', 1, 46),
(678, '5804', 'แม่สะเรียง   ', 'Mae Sariang', 1, 46),
(679, '5805', 'แม่ลาน้อย   ', 'Mae La Noi', 1, 46),
(680, '5806', 'สบเมย   ', 'Sop Moei', 1, 46),
(681, '5807', 'ปางมะผ้า   ', 'Pang Mapha', 1, 46),
(682, '5881', '*อ.ม่วยต่อ  จ.แม่ฮ่องสอน   ', 'Muen Tor', 1, 46),
(683, '6001', 'เมืองนครสวรรค์   ', 'Mueang Nakhon Sawan', 2, 47),
(684, '6002', 'โกรกพระ   ', 'Krok Phra', 2, 47),
(685, '6003', 'ชุมแสง   ', 'Chum Saeng', 2, 47),
(686, '6004', 'หนองบัว   ', 'Nong Bua', 2, 47),
(687, '6005', 'บรรพตพิสัย   ', 'Banphot Phisai', 2, 47),
(688, '6006', 'เก้าเลี้ยว   ', 'Kao Liao', 2, 47),
(689, '6007', 'ตาคลี   ', 'Takhli', 2, 47),
(690, '6008', 'ท่าตะโก   ', 'Takhli', 2, 47),
(691, '6009', 'ไพศาลี   ', 'Phaisali', 2, 47),
(692, '6010', 'พยุหะคีรี   ', 'Phayuha Khiri', 2, 47),
(693, '6011', 'ลาดยาว   ', 'Phayuha Khiri', 2, 47),
(694, '6012', 'ตากฟ้า   ', 'Tak Fa', 2, 47),
(695, '6013', 'แม่วงก์   ', 'Mae Wong', 2, 47),
(696, '6014', 'แม่เปิน   ', 'Mae Poen', 2, 47),
(697, '6015', 'ชุมตาบง   ', 'Chum Ta Bong', 2, 47),
(698, '6051', 'สาขาตำบลห้วยน้ำหอม*   ', 'Huen Nam Hom', 2, 47),
(699, '6052', 'กิ่งอำเภอชุมตาบง (สาขาตำบลชุมตาบง)*   ', 'Chum Ta Bong', 2, 47),
(700, '6053', 'แม่วงก์ (สาขาตำบลแม่เล่ย์)*   ', 'Mea Ley', 2, 47),
(701, '6101', 'เมืองอุทัยธานี   ', 'Mueang Uthai Thani', 2, 48),
(702, '6102', 'ทัพทัน   ', 'Thap Than', 2, 48),
(703, '6103', 'สว่างอารมณ์   ', 'Sawang Arom', 2, 48),
(704, '6104', 'หนองฉาง   ', 'Nong Chang', 2, 48),
(705, '6105', 'หนองขาหย่าง   ', 'Nong Khayang', 2, 48),
(706, '6106', 'บ้านไร่   ', 'Ban Rai', 2, 48),
(707, '6107', 'ลานสัก   ', 'Lan Sak', 2, 48),
(708, '6108', 'ห้วยคต   ', 'Huai Khot', 2, 48),
(709, '6201', 'เมืองกำแพงเพชร   ', 'Mueang Kamphaeng Phet', 2, 49),
(710, '6202', 'ไทรงาม   ', 'Sai Ngam', 2, 49),
(711, '6203', 'คลองลาน   ', 'Khlong Lan', 2, 49),
(712, '6204', 'ขาณุวรลักษบุรี   ', 'Khanu Woralaksaburi', 2, 49),
(713, '6205', 'คลองขลุง   ', 'Khlong Khlung', 2, 49),
(714, '6206', 'พรานกระต่าย   ', 'Phran Kratai', 2, 49),
(715, '6207', 'ลานกระบือ   ', 'Lan Krabue', 2, 49),
(716, '6208', 'ทรายทองวัฒนา   ', 'Sai Thong Watthana', 2, 49),
(717, '6209', 'ปางศิลาทอง   ', 'Pang Sila Thong', 2, 49),
(718, '6210', 'บึงสามัคคี   ', 'Bueng Samakkhi', 2, 49),
(719, '6211', 'โกสัมพีนคร   ', 'Kosamphi Nakhon', 2, 49),
(720, '6301', 'เมืองตาก   ', 'Mueang Tak', 4, 50),
(721, '6302', 'บ้านตาก   ', 'Ban Tak', 4, 50),
(722, '6303', 'สามเงา   ', 'Sam Ngao', 4, 50),
(723, '6304', 'แม่ระมาด   ', 'Mae Ramat', 4, 50),
(724, '6305', 'ท่าสองยาง   ', 'Tha Song Yang', 4, 50),
(725, '6306', 'แม่สอด   ', 'Mae Sot', 4, 50),
(726, '6307', 'พบพระ   ', 'Phop Phra', 4, 50),
(727, '6308', 'อุ้มผาง   ', 'Umphang', 4, 50),
(728, '6309', 'วังเจ้า   ', 'Wang Chao', 4, 50),
(729, '6381', '*กิ่ง อ.ท่าปุย  จ.ตาก   ', '*King Ta Pui', 4, 50),
(730, '6401', 'เมืองสุโขทัย   ', 'Mueang Sukhothai', 2, 51),
(731, '6402', 'บ้านด่านลานหอย   ', 'Ban Dan Lan Hoi', 2, 51),
(732, '6403', 'คีรีมาศ   ', 'Khiri Mat', 2, 51),
(733, '6404', 'กงไกรลาศ   ', 'Kong Krailat', 2, 51),
(734, '6405', 'ศรีสัชนาลัย   ', 'Si Satchanalai', 2, 51),
(735, '6406', 'ศรีสำโรง   ', 'Si Samrong', 2, 51),
(736, '6407', 'สวรรคโลก   ', 'Sawankhalok', 2, 51),
(737, '6408', 'ศรีนคร   ', 'Si Nakhon', 2, 51),
(738, '6409', 'ทุ่งเสลี่ยม   ', 'Thung Saliam', 2, 51),
(739, '6501', 'เมืองพิษณุโลก   ', 'Mueang Phitsanulok', 2, 52),
(740, '6502', 'นครไทย   ', 'Nakhon Thai', 2, 52),
(741, '6503', 'ชาติตระการ   ', 'Chat Trakan', 2, 52),
(742, '6504', 'บางระกำ   ', 'Bang Rakam', 2, 52),
(743, '6505', 'บางกระทุ่ม   ', 'Bang Krathum', 2, 52),
(744, '6506', 'พรหมพิราม   ', 'Phrom Phiram', 2, 52),
(745, '6507', 'วัดโบสถ์   ', 'Wat Bot', 2, 52),
(746, '6508', 'วังทอง   ', 'Wang Thong', 2, 52),
(747, '6509', 'เนินมะปราง   ', 'Noen Maprang', 2, 52),
(748, '6601', 'เมืองพิจิตร   ', 'Mueang Phichit', 2, 53),
(749, '6602', 'วังทรายพูน   ', 'Wang Sai Phun', 2, 53),
(750, '6603', 'โพธิ์ประทับช้าง   ', 'Pho Prathap Chang', 2, 53),
(751, '6604', 'ตะพานหิน   ', 'Taphan Hin', 2, 53),
(752, '6605', 'บางมูลนาก   ', 'Bang Mun Nak', 2, 53),
(753, '6606', 'โพทะเล   ', 'Pho Thale', 2, 53),
(754, '6607', 'สามง่าม   ', 'Sam Ngam', 2, 53),
(755, '6608', 'ทับคล้อ   ', 'Tap Khlo', 2, 53),
(756, '6609', 'สากเหล็ก   ', 'Sak Lek', 2, 53),
(757, '6610', 'บึงนาราง   ', 'Bueng Na Rang', 2, 53),
(758, '6611', 'ดงเจริญ   ', 'Dong Charoen', 2, 53),
(759, '6612', 'วชิรบารมี   ', 'Wachirabarami', 2, 53),
(760, '6701', 'เมืองเพชรบูรณ์   ', 'Mueang Phetchabun', 2, 54),
(761, '6702', 'ชนแดน   ', 'Chon Daen', 2, 54),
(762, '6703', 'หล่มสัก   ', 'Lom Sak', 2, 54),
(763, '6704', 'หล่มเก่า   ', 'Lom Kao', 2, 54),
(764, '6705', 'วิเชียรบุรี   ', 'Wichian Buri', 2, 54),
(765, '6706', 'ศรีเทพ   ', 'Si Thep', 2, 54),
(766, '6707', 'หนองไผ่   ', 'Nong Phai', 2, 54),
(767, '6708', 'บึงสามพัน   ', 'Bueng Sam Phan', 2, 54),
(768, '6709', 'น้ำหนาว   ', 'Nam Nao', 2, 54),
(769, '6710', 'วังโป่ง   ', 'Wang Pong', 2, 54),
(770, '6711', 'เขาค้อ   ', 'Khao Kho', 2, 54),
(771, '7001', 'เมืองราชบุรี   ', 'Mueang Ratchaburi', 4, 55),
(772, '7002', 'จอมบึง   ', 'Chom Bueng', 4, 55),
(773, '7003', 'สวนผึ้ง   ', 'Suan Phueng', 4, 55),
(774, '7004', 'ดำเนินสะดวก   ', 'Damnoen Saduak', 4, 55),
(775, '7005', 'บ้านโป่ง   ', 'Ban Pong', 4, 55),
(776, '7006', 'บางแพ   ', 'Bang Phae', 4, 55),
(777, '7007', 'โพธาราม   ', 'Photharam', 4, 55),
(778, '7008', 'ปากท่อ   ', 'Pak Tho', 4, 55),
(779, '7009', 'วัดเพลง   ', 'Wat Phleng', 4, 55),
(780, '7010', 'บ้านคา   ', 'Ban Kha', 4, 55),
(781, '7074', 'ท้องถิ่นเทศบาลตำบลบ้านฆ้อง   ', 'Tet Saban Ban Kong', 4, 55),
(782, '7101', 'เมืองกาญจนบุรี   ', 'Mueang Kanchanaburi', 4, 56),
(783, '7102', 'ไทรโยค   ', 'Sai Yok', 4, 56),
(784, '7103', 'บ่อพลอย   ', 'Bo Phloi', 4, 56),
(785, '7104', 'ศรีสวัสดิ์   ', 'Si Sawat', 4, 56),
(786, '7105', 'ท่ามะกา   ', 'Tha Maka', 4, 56),
(787, '7106', 'ท่าม่วง   ', 'Tha Muang', 4, 56),
(788, '7107', 'ทองผาภูมิ   ', 'Pha Phum', 4, 56),
(789, '7108', 'สังขละบุรี   ', 'Sangkhla Buri', 4, 56),
(790, '7109', 'พนมทวน   ', 'Phanom Thuan', 4, 56),
(791, '7110', 'เลาขวัญ   ', 'Lao Khwan', 4, 56),
(792, '7111', 'ด่านมะขามเตี้ย   ', 'Dan Makham Tia', 4, 56),
(793, '7112', 'หนองปรือ   ', 'Nong Prue', 4, 56),
(794, '7113', 'ห้วยกระเจา   ', 'Huai Krachao', 4, 56),
(795, '7151', 'สาขาตำบลท่ากระดาน*   ', 'Tha Kra Dan', 4, 56),
(796, '7181', '*บ้านทวน  จ.กาญจนบุรี   ', '*Ban Tuan', 4, 56),
(797, '7201', 'เมืองสุพรรณบุรี   ', 'Mueang Suphan Buri', 2, 57),
(798, '7202', 'เดิมบางนางบวช   ', 'Doem Bang Nang Buat', 2, 57),
(799, '7203', 'ด่านช้าง   ', 'Dan Chang', 2, 57),
(800, '7204', 'บางปลาม้า   ', 'Bang Pla Ma', 2, 57),
(801, '7205', 'ศรีประจันต์   ', 'Si Prachan', 2, 57),
(802, '7206', 'ดอนเจดีย์   ', 'Don Chedi', 2, 57),
(803, '7207', 'สองพี่น้อง   ', 'Song Phi Nong', 2, 57),
(804, '7208', 'สามชุก   ', 'Sam Chuk', 2, 57),
(805, '7209', 'อู่ทอง   ', 'U Thong', 2, 57),
(806, '7210', 'หนองหญ้าไซ   ', 'Nong Ya Sai', 2, 57),
(807, '7301', 'เมืองนครปฐม   ', 'Mueang Nakhon Pathom', 2, 58),
(808, '7302', 'กำแพงแสน   ', 'Kamphaeng Saen', 2, 58),
(809, '7303', 'นครชัยศรี   ', 'Nakhon Chai Si', 2, 58),
(810, '7304', 'ดอนตูม   ', 'Don Tum', 2, 58),
(811, '7305', 'บางเลน   ', 'Bang Len', 2, 58),
(812, '7306', 'สามพราน   ', 'Sam Phran', 2, 58),
(813, '7307', 'พุทธมณฑล   ', 'Phutthamonthon', 2, 58),
(814, '7401', 'เมืองสมุทรสาคร   ', 'Mueang Samut Sakhon', 2, 59),
(815, '7402', 'กระทุ่มแบน   ', 'Krathum Baen', 2, 59),
(816, '7403', 'บ้านแพ้ว   ', 'Ban Phaeo', 2, 59),
(817, '7501', 'เมืองสมุทรสงคราม   ', 'Mueang Samut Songkhram', 2, 60),
(818, '7502', 'บางคนที   ', 'Bang Khonthi', 2, 60),
(819, '7503', 'อัมพวา   ', 'Amphawa', 2, 60),
(820, '7601', 'เมืองเพชรบุรี   ', 'Mueang Phetchaburi', 4, 61),
(821, '7602', 'เขาย้อย   ', 'Khao Yoi', 4, 61),
(822, '7603', 'หนองหญ้าปล้อง   ', 'Nong Ya Plong', 4, 61),
(823, '7604', 'ชะอำ   ', 'Cha-am', 4, 61),
(824, '7605', 'ท่ายาง   ', 'Tha Yang', 4, 61),
(825, '7606', 'บ้านลาด   ', 'Ban Lat', 4, 61),
(826, '7607', 'บ้านแหลม   ', 'Ban Laem', 4, 61),
(827, '7608', 'แก่งกระจาน   ', 'Kaeng Krachan', 4, 61),
(828, '7701', 'เมืองประจวบคีรีขันธ์   ', 'Mueang Prachuap Khiri Khan', 4, 62),
(829, '7702', 'กุยบุรี   ', 'Kui Buri', 4, 62),
(830, '7703', 'ทับสะแก   ', 'Thap Sakae', 4, 62),
(831, '7704', 'บางสะพาน   ', 'Bang Saphan', 4, 62),
(832, '7705', 'บางสะพานน้อย   ', 'Bang Saphan Noi', 4, 62),
(833, '7706', 'ปราณบุรี   ', 'Pran Buri', 4, 62),
(834, '7707', 'หัวหิน   ', 'Hua Hin', 4, 62),
(835, '7708', 'สามร้อยยอด   ', 'Sam Roi Yot', 4, 62),
(836, '8001', 'เมืองนครศรีธรรมราช   ', 'Mueang Nakhon Si Thammarat', 6, 63),
(837, '8002', 'พรหมคีรี   ', 'Phrom Khiri', 6, 63),
(838, '8003', 'ลานสกา   ', 'Lan Saka', 6, 63),
(839, '8004', 'ฉวาง   ', 'Chawang', 6, 63),
(840, '8005', 'พิปูน   ', 'Phipun', 6, 63),
(841, '8006', 'เชียรใหญ่   ', 'Chian Yai', 6, 63),
(842, '8007', 'ชะอวด   ', 'Cha-uat', 6, 63),
(843, '8008', 'ท่าศาลา   ', 'Tha Sala', 6, 63),
(844, '8009', 'ทุ่งสง   ', 'Thung Song', 6, 63),
(845, '8010', 'นาบอน   ', 'Na Bon', 6, 63),
(846, '8011', 'ทุ่งใหญ่   ', 'Thung Yai', 6, 63),
(847, '8012', 'ปากพนัง   ', 'Pak Phanang', 6, 63),
(848, '8013', 'ร่อนพิบูลย์   ', 'Ron Phibun', 6, 63),
(849, '8014', 'สิชล   ', 'Sichon', 6, 63),
(850, '8015', 'ขนอม   ', 'Khanom', 6, 63),
(851, '8016', 'หัวไทร   ', 'Hua Sai', 6, 63),
(852, '8017', 'บางขัน   ', 'Bang Khan', 6, 63),
(853, '8018', 'ถ้ำพรรณรา   ', 'Tham Phannara', 6, 63),
(854, '8019', 'จุฬาภรณ์   ', 'Chulabhorn', 6, 63),
(855, '8020', 'พระพรหม   ', 'Phra Phrom', 6, 63),
(856, '8021', 'นบพิตำ   ', 'Nopphitam', 6, 63),
(857, '8022', 'ช้างกลาง   ', 'Chang Klang', 6, 63),
(858, '8023', 'เฉลิมพระเกียรติ   ', 'Chaloem Phra Kiat', 6, 63),
(859, '8051', 'เชียรใหญ่ (สาขาตำบลเสือหึง)*   ', 'Chian Yai*', 6, 63),
(860, '8052', 'สาขาตำบลสวนหลวง**   ', 'Suan Luang', 6, 63),
(861, '8053', 'ร่อนพิบูลย์ (สาขาตำบลหินตก)*   ', 'Ron Phibun', 6, 63),
(862, '8054', 'หัวไทร (สาขาตำบลควนชะลิก)*   ', 'Hua Sai', 6, 63),
(863, '8055', 'ทุ่งสง (สาขาตำบลกะปาง)*   ', 'Thung Song', 6, 63),
(864, '8101', 'เมืองกระบี่   ', 'Mueang Krabi', 6, 64),
(865, '8102', 'เขาพนม   ', 'Khao Phanom', 6, 64),
(866, '8103', 'เกาะลันตา   ', 'Ko Lanta', 6, 64),
(867, '8104', 'คลองท่อม   ', 'Khlong Thom', 6, 64),
(868, '8105', 'อ่าวลึก   ', 'Ao Luek', 6, 64),
(869, '8106', 'ปลายพระยา   ', 'Plai Phraya', 6, 64),
(870, '8107', 'ลำทับ   ', 'Lam Thap', 6, 64),
(871, '8108', 'เหนือคลอง   ', 'Nuea Khlong', 6, 64),
(872, '8201', 'เมืองพังงา   ', 'Mueang Phang-nga', 6, 65),
(873, '8202', 'เกาะยาว   ', 'Ko Yao', 6, 65),
(874, '8203', 'กะปง   ', 'Kapong', 6, 65),
(875, '8204', 'ตะกั่วทุ่ง   ', 'Takua Thung', 6, 65),
(876, '8205', 'ตะกั่วป่า   ', 'Takua Pa', 6, 65),
(877, '8206', 'คุระบุรี   ', 'Khura Buri', 6, 65),
(878, '8207', 'ทับปุด   ', 'Thap Put', 6, 65),
(879, '8208', 'ท้ายเหมือง   ', 'Thai Mueang', 6, 65),
(880, '8301', 'เมืองภูเก็ต   ', 'Mueang Phuket', 6, 66),
(881, '8302', 'กะทู้   ', 'Kathu', 6, 66),
(882, '8303', 'ถลาง   ', 'Thalang', 6, 66),
(883, '8381', '*ทุ่งคา   ', '*Tung Ka', 6, 66),
(884, '8401', 'เมืองสุราษฎร์ธานี   ', 'Mueang Surat Thani', 6, 67),
(885, '8402', 'กาญจนดิษฐ์   ', 'Kanchanadit', 6, 67),
(886, '8403', 'ดอนสัก   ', 'Don Sak', 6, 67),
(887, '8404', 'เกาะสมุย   ', 'Ko Samui', 6, 67),
(888, '8405', 'เกาะพะงัน   ', 'Ko Pha-ngan', 6, 67),
(889, '8406', 'ไชยา   ', 'Chaiya', 6, 67),
(890, '8407', 'ท่าชนะ   ', 'Tha Chana', 6, 67),
(891, '8408', 'คีรีรัฐนิคม   ', 'Khiri Rat Nikhom', 6, 67),
(892, '8409', 'บ้านตาขุน   ', 'Ban Ta Khun', 6, 67),
(893, '8410', 'พนม   ', 'Phanom', 6, 67),
(894, '8411', 'ท่าฉาง   ', 'Tha Chang', 6, 67),
(895, '8412', 'บ้านนาสาร   ', 'Ban Na San', 6, 67),
(896, '8413', 'บ้านนาเดิม   ', 'Ban Na Doem', 6, 67),
(897, '8414', 'เคียนซา   ', 'Khian Sa', 6, 67),
(898, '8415', 'เวียงสระ   ', 'Wiang Sa', 6, 67),
(899, '8416', 'พระแสง   ', 'Phrasaeng', 6, 67),
(900, '8417', 'พุนพิน   ', 'Phunphin', 6, 67),
(901, '8418', 'ชัยบุรี   ', 'Chai Buri', 6, 67),
(902, '8419', 'วิภาวดี   ', 'Vibhavadi', 6, 67),
(903, '8451', 'เกาะพงัน (สาขาตำบลเกาะเต่า)*   ', 'Ko Pha-ngan', 6, 67),
(904, '8481', '*อ.บ้านดอน  จ.สุราษฎร์ธานี   ', '*Ban Don', 6, 67),
(905, '8501', 'เมืองระนอง   ', 'Mueang Ranong', 6, 68),
(906, '8502', 'ละอุ่น   ', 'La-un', 6, 68),
(907, '8503', 'กะเปอร์   ', 'Kapoe', 6, 68),
(908, '8504', 'กระบุรี   ', 'Kra Buri', 6, 68),
(909, '8505', 'สุขสำราญ   ', 'Suk Samran', 6, 68),
(910, '8601', 'เมืองชุมพร   ', 'Mueang Chumphon', 6, 69),
(911, '8602', 'ท่าแซะ   ', 'Tha Sae', 6, 69),
(912, '8603', 'ปะทิว   ', 'Pathio', 6, 69),
(913, '8604', 'หลังสวน   ', 'Lang Suan', 6, 69),
(914, '8605', 'ละแม   ', 'Lamae', 6, 69),
(915, '8606', 'พะโต๊ะ   ', 'Phato', 6, 69),
(916, '8607', 'สวี   ', 'Sawi', 6, 69),
(917, '8608', 'ทุ่งตะโก   ', 'Thung Tako', 6, 69),
(918, '9001', 'เมืองสงขลา   ', 'Mueang Songkhla', 6, 70),
(919, '9002', 'สทิงพระ   ', 'Sathing Phra', 6, 70),
(920, '9003', 'จะนะ   ', 'Chana', 6, 70),
(921, '9004', 'นาทวี   ', 'Na Thawi', 6, 70),
(922, '9005', 'เทพา   ', 'Thepha', 6, 70),
(923, '9006', 'สะบ้าย้อย   ', 'Saba Yoi', 6, 70),
(924, '9007', 'ระโนด   ', 'Ranot', 6, 70),
(925, '9008', 'กระแสสินธุ์   ', 'Krasae Sin', 6, 70),
(926, '9009', 'รัตภูมิ   ', 'Rattaphum', 6, 70),
(927, '9010', 'สะเดา   ', 'Sadao', 6, 70),
(928, '9011', 'หาดใหญ่   ', 'Hat Yai', 6, 70),
(929, '9012', 'นาหม่อม   ', 'Na Mom', 6, 70),
(930, '9013', 'ควนเนียง   ', 'Khuan Niang', 6, 70),
(931, '9014', 'บางกล่ำ   ', 'Bang Klam', 6, 70),
(932, '9015', 'สิงหนคร   ', 'Singhanakhon', 6, 70),
(933, '9016', 'คลองหอยโข่ง   ', 'Khlong Hoi Khong', 6, 70),
(934, '9077', 'ท้องถิ่นเทศบาลตำบลสำนักขาม   ', 'Sum Nung Kam', 6, 70),
(935, '9096', 'เทศบาลตำบลบ้านพรุ*   ', 'Ban Pru*', 6, 70),
(936, '9101', 'เมืองสตูล   ', 'Mueang Satun', 6, 71),
(937, '9102', 'ควนโดน   ', 'Khuan Don', 6, 71),
(938, '9103', 'ควนกาหลง   ', 'Khuan Kalong', 6, 71),
(939, '9104', 'ท่าแพ   ', 'Tha Phae', 6, 71),
(940, '9105', 'ละงู   ', 'La-ngu', 6, 71),
(941, '9106', 'ทุ่งหว้า   ', 'Thung Wa', 6, 71),
(942, '9107', 'มะนัง   ', 'Manang', 6, 71),
(943, '9201', 'เมืองตรัง   ', 'Mueang Trang', 6, 72),
(944, '9202', 'กันตัง   ', 'Kantang', 6, 72),
(945, '9203', 'ย่านตาขาว   ', 'Yan Ta Khao', 6, 72),
(946, '9204', 'ปะเหลียน   ', 'Palian', 6, 72),
(947, '9205', 'สิเกา   ', 'Sikao', 6, 72),
(948, '9206', 'ห้วยยอด   ', 'Huai Yot', 6, 72),
(949, '9207', 'วังวิเศษ   ', 'Wang Wiset', 6, 72),
(950, '9208', 'นาโยง   ', 'Na Yong', 6, 72),
(951, '9209', 'รัษฎา   ', 'Ratsada', 6, 72),
(952, '9210', 'หาดสำราญ   ', 'Hat Samran', 6, 72),
(953, '9251', 'อำเภอเมืองตรัง(สาขาคลองเต็ง)**   ', 'Mueang Trang(Krong Teng)**', 6, 72),
(954, '9301', 'เมืองพัทลุง   ', 'Mueang Phatthalung', 6, 73),
(955, '9302', 'กงหรา   ', 'Kong Ra', 6, 73),
(956, '9303', 'เขาชัยสน   ', 'Khao Chaison', 6, 73),
(957, '9304', 'ตะโหมด   ', 'Tamot', 6, 73),
(958, '9305', 'ควนขนุน   ', 'Khuan Khanun', 6, 73),
(959, '9306', 'ปากพะยูน   ', 'Pak Phayun', 6, 73),
(960, '9307', 'ศรีบรรพต   ', 'Si Banphot', 6, 73),
(961, '9308', 'ป่าบอน   ', 'Pa Bon', 6, 73),
(962, '9309', 'บางแก้ว   ', 'Bang Kaeo', 6, 73),
(963, '9310', 'ป่าพะยอม   ', 'Pa Phayom', 6, 73),
(964, '9311', 'ศรีนครินทร์   ', 'Srinagarindra', 6, 73),
(965, '9401', 'เมืองปัตตานี   ', 'Mueang Pattani', 6, 74),
(966, '9402', 'โคกโพธิ์   ', 'Khok Pho', 6, 74),
(967, '9403', 'หนองจิก   ', 'Nong Chik', 6, 74),
(968, '9404', 'ปะนาเระ   ', 'Panare', 6, 74),
(969, '9405', 'มายอ   ', 'Mayo', 6, 74),
(970, '9406', 'ทุ่งยางแดง   ', 'Thung Yang Daeng', 6, 74),
(971, '9407', 'สายบุรี   ', 'Sai Buri', 6, 74),
(972, '9408', 'ไม้แก่น   ', 'Mai Kaen', 6, 74),
(973, '9409', 'ยะหริ่ง   ', 'Yaring', 6, 74),
(974, '9410', 'ยะรัง   ', 'Yarang', 6, 74),
(975, '9411', 'กะพ้อ   ', 'Kapho', 6, 74),
(976, '9412', 'แม่ลาน   ', 'Mae Lan', 6, 74),
(977, '9501', 'เมืองยะลา   ', 'Mueang Yala', 6, 75),
(978, '9502', 'เบตง   ', 'Betong', 6, 75),
(979, '9503', 'บันนังสตา   ', 'Bannang Sata', 6, 75),
(980, '9504', 'ธารโต   ', 'Than To', 6, 75),
(981, '9505', 'ยะหา   ', 'Yaha', 6, 75),
(982, '9506', 'รามัน   ', 'Raman', 6, 75),
(983, '9507', 'กาบัง   ', 'Kabang', 6, 75),
(984, '9508', 'กรงปินัง   ', 'Krong Pinang', 6, 75),
(985, '9601', 'เมืองนราธิวาส   ', 'Mueang Narathiwat', 6, 76),
(986, '9602', 'ตากใบ   ', 'Tak Bai', 6, 76),
(987, '9603', 'บาเจาะ   ', 'Bacho', 6, 76),
(988, '9604', 'ยี่งอ   ', 'Yi-ngo', 6, 76),
(989, '9605', 'ระแงะ   ', 'Ra-ngae', 6, 76),
(990, '9606', 'รือเสาะ   ', 'Rueso', 6, 76),
(991, '9607', 'ศรีสาคร   ', 'Si Sakhon', 6, 76);
INSERT INTO `amphur` (`id`, `code`, `name`, `name_english`, `geo_id`, `province_id`) VALUES
(992, '9608', 'แว้ง   ', 'Waeng', 6, 76),
(993, '9609', 'สุคิริน   ', 'Sukhirin', 6, 76),
(994, '9610', 'สุไหงโก-ลก   ', 'Su-ngai Kolok', 6, 76),
(995, '9611', 'สุไหงปาดี   ', 'Su-ngai Padi', 6, 76),
(996, '9612', 'จะแนะ   ', 'Chanae', 6, 76),
(997, '9613', 'เจาะไอร้อง   ', 'Cho-airong', 6, 76),
(998, '9681', '*อ.บางนรา  จ.นราธิวาส   ', '*Bang Nra', 6, 76);

-- --------------------------------------------------------

--
-- Table structure for table `attachment`
--

CREATE TABLE `attachment` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `record_name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `record_document` int(8) UNSIGNED NOT NULL,
  `attachment_type_id` int(3) NOT NULL,
  `file_dir` text COLLATE utf8_unicode_ci NOT NULL,
  `file_extension` varchar(8) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `attachment_type`
--

CREATE TABLE `attachment_type` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `authentication`
--

CREATE TABLE `authentication` (
  `id` char(23) CHARACTER SET utf8 NOT NULL,
  `username` varchar(65) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `password` varchar(65) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `email` varchar(65) CHARACTER SET utf8 NOT NULL,
  `verified` tinyint(1) UNSIGNED NOT NULL DEFAULT '0',
  `mod_timestamp` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `employee_id` int(8) NOT NULL,
  `national_id` varchar(16) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `authentication`
--

INSERT INTO `authentication` (`id`, `username`, `password`, `email`, `verified`, `mod_timestamp`, `employee_id`, `national_id`) VALUES
('11873588626f68101a', 'Kittiwut', '$2y$10$3jOpfBeeG6RZB/ZtWsWwwe0M2S8TaoSr8yTKsZNQRn3QN7VeHXqJi', 'bathlinekittiwut@gmail.com', 1, '2017-01-23 16:45:14', 4, '3169900251036'),
('227415881bf87d3424', 'มนญพัชญ์', '$2y$10$bfBGluMabuOTNb12UnvgM.75P4yUKSxtdzCUoCceN2LFtu8BcwG/y', 'tonnam.pj@gmail.com', 1, '2017-01-20 08:32:48', 3, '3101202994923'),
('304158793b89c5d93', 'seasiri', '$2y$10$KzftQTbk.c6JvJx14KtLgOf.2u8yv2BovDhzANUHwZqV.D/Na2QIq', 'seawaykung@gmail.com', 1, '2017-01-20 08:29:46', 1, ''),
('80175881985f22e56', 'aumpa', '$2y$10$ywx.BbGCBR2jUx868qxYmeE6TQuQY0TAXYajTXGQCASO7D7lhMbm.', 'aumpa2714@gmail.com', 1, '2017-01-20 05:29:35', 2, '3160300783616');

-- --------------------------------------------------------

--
-- Table structure for table `db_reference`
--

CREATE TABLE `db_reference` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `db_name` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `db_reference`
--

INSERT INTO `db_reference` (`id`, `created`, `modified`, `owner`, `name`, `db_name`) VALUES
(1, '2017-01-17 14:21:46', '2017-01-17 07:21:46', 1, 'agent', 'agent'),
(2, '2017-01-17 14:23:17', '2017-01-17 07:23:17', 1, 'order detail', 'order_detail'),
(3, '2017-01-17 14:23:33', '2017-01-17 07:23:33', 1, 'order detail status', 'order_detail_status'),
(4, '2017-01-17 14:24:16', '2017-01-17 07:24:16', 1, 'order list', 'order_list'),
(5, '2017-01-17 14:24:31', '2017-01-17 07:24:31', 1, 'order process status', 'order_process_status'),
(6, '2017-01-19 19:57:54', '2017-01-19 12:57:54', 1, 'vehicle', 'vehicle'),
(7, '2017-01-19 19:58:00', '2017-01-19 12:58:00', 1, 'employee', 'employee'),
(8, '2017-01-19 19:58:27', '2017-01-19 12:58:27', 1, 'task', 'task'),
(9, '2017-01-19 19:58:37', '2017-01-19 12:58:37', 1, 'job', 'job'),
(10, '2017-01-19 20:12:17', '2017-01-19 13:12:17', 1, 'supplier', 'supplier'),
(11, '2017-01-20 03:56:39', '2017-01-19 20:56:39', 1, 'product', 'product'),
(12, '2017-01-20 04:00:33', '2017-01-23 15:49:50', 1, 'retail_pc', 'retail_pc'),
(13, '2017-01-23 22:58:35', '2017-01-23 15:58:35', 1, 'product_catagories', 'product_catagories'),
(14, '2017-01-23 23:02:03', '2017-01-23 16:02:03', 1, 'retail_stock_report', 'retail_stock_report'),
(15, '2017-01-24 11:30:50', '2017-01-24 04:30:50', 1, 'supplier_link_trader', 'supplier_link_trader'),
(16, '2017-01-24 11:30:57', '2017-01-24 04:30:57', 1, 'trader', 'trader'),
(17, '2017-01-27 01:54:24', '2017-01-26 18:54:24', 1, 'product_attribute', 'product_attribute'),
(18, '2017-01-27 01:54:32', '2017-01-26 18:54:32', 1, 'product_attribute_option', 'product_attribute_option'),
(19, '2017-01-27 01:54:40', '2017-01-26 18:54:40', 1, 'product_attribute_value', 'product_attribute_value');

-- --------------------------------------------------------

--
-- Table structure for table `delivery`
--

CREATE TABLE `delivery` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `delivery_number` int(16) UNSIGNED NOT NULL,
  `employee_id` int(8) NOT NULL,
  `order_list_id` int(8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `delivery_log`
--

CREATE TABLE `delivery_log` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `delivery_id` int(8) NOT NULL,
  `delivery_process_status_id` int(8) NOT NULL,
  `vehicle_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `delivery_process_status`
--

CREATE TABLE `delivery_process_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `firstname_thai` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `lastname_thai` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `firstname_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `lastname_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `phone` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `address` text COLLATE utf8_unicode_ci NOT NULL,
  `post_code` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `start_date` date DEFAULT NULL,
  `join_date` date DEFAULT NULL,
  `national_id` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `province_id` int(8) UNSIGNED NOT NULL,
  `amphur_id` int(8) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`id`, `created`, `modified`, `owner`, `name`, `firstname_thai`, `lastname_thai`, `firstname_english`, `lastname_english`, `phone`, `email`, `address`, `post_code`, `start_date`, `join_date`, `national_id`, `bank_account`, `province_id`, `amphur_id`) VALUES
(1, '2017-01-15 11:46:49', '2017-01-24 04:05:13', 1, 'ซี', 'สิรภพ', 'ศิริศิลป์', 'Siraphop', 'Sirisilp', '0802689444', 'seawaykung@gmail.com', '52 ปรางค์สามยอด', '', '2017-01-15', '2017-01-15', '1101402029290', '', 7, 843),
(2, '2017-01-20 12:28:21', '2017-01-25 12:06:49', 1, 'อำ', 'อำภา', 'ตรีพืช', 'Aumpa', '', '', '', '', '', '2004-05-19', '2004-05-19', '', '', 7, 843),
(3, '2017-01-20 15:31:45', '2017-01-25 12:06:40', 1, 'เพชร', 'ชื่อต้น', 'นามสกุล', '', '', '', '', '', '', '2017-01-01', '2017-01-01', '', '', 7, 843),
(4, '2017-01-23 22:55:37', '2017-01-25 12:06:28', 1, 'น็อต', 'กิตติวุฒิ', 'ศิริศิลป์', 'Kittiwut', 'Sirisilp', '', '', '', '', '2008-01-01', '2008-01-01', '', '', 7, 843),
(5, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นคร', 'จิระภคทวี', '', '', '', '', '', '', '2003-12-01', '2003-12-01', '', '', 7, 843),
(6, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ศุภลักษณ์', 'นวลขำ', '', '', '', '', '', '', '2011-09-01', '2011-09-01', '', '', 7, 843),
(7, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นงนุช', 'คำดี', '', '', '', '', '', '', '2012-09-01', '2012-09-01', '', '', 7, 843),
(8, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ชัญญานุช', 'ด้วงตะกั่ว', '', '', '', '', '', '', '2013-03-20', '2013-03-20', '', '', 7, 843),
(9, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ณภัคมนต์', 'คงสี', '', '', '', '', '', '', '2013-09-03', '2013-09-03', '', '', 7, 843),
(10, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กนกวรรณ', 'บุญทิพย์', '', '', '', '', '', '', '2014-08-01', '2014-08-01', '', '', 7, 843),
(11, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กุลนันทน์', 'พรมเจริญ', '', '', '', '', '', '', '2014-12-01', '2014-12-01', '', '', 7, 843),
(12, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อานนท์', 'พลศรี', '', '', '', '', '', '', '2015-01-05', '2015-01-05', '', '', 7, 843),
(13, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สุพัตรา', 'กล้าประจัญ', '', '', '', '', '', '', '2015-01-23', '2015-01-23', '', '', 7, 843),
(14, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'พัชรพล', 'ขู่เข็ญ', '', '', '', '', '', '', '2015-05-20', '2015-05-20', '', '', 7, 843),
(15, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ปดิวรัดดา', 'วัฒนาศิริมงคง', '', '', '', '', '', '', '2015-05-20', '2015-05-20', '', '', 7, 843),
(16, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ภาวิณี', 'บุญจำ', '', '', '', '', '', '', '2015-08-19', '2015-08-19', '', '', 7, 843),
(17, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'วิไลพร', 'บุญยืน', '', '', '', '', '', '', '2015-08-26', '2015-08-26', '', '', 7, 843),
(18, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นพรัตน์', 'ดอนท่าโพธิ์', '', '', '', '', '', '', '2015-11-24', '2015-11-24', '', '', 7, 843),
(19, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ราตรี', 'ชื่นชม', '', '', '', '', '', '', '2016-01-04', '2016-01-04', '', '', 7, 843),
(20, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นรินทร์', 'สินวิเศษ', '', '', '', '', '', '', '2016-01-26', '2016-01-26', '', '', 7, 843),
(21, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'มุกรินทร์', 'ตีบกอง', '', '', '', '', '', '', '2016-02-15', '2016-02-15', '', '', 7, 843),
(22, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สุธาทิพย์', 'คงเจริญ', '', '', '', '', '', '', '2016-03-01', '2016-03-01', '', '', 7, 843),
(23, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ศานติบูรณ์', 'กันใจ', '', '', '', '', '', '', '2016-05-03', '2016-05-03', '', '', 7, 843),
(24, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ศิริชัย', 'ฉายสบัด', '', '', '', '', '', '', '2016-06-01', '2016-06-01', '', '', 7, 843),
(25, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'วิทูรย์', 'พิมพ์วันวงค์', '', '', '', '', '', '', '2016-07-14', '2016-07-14', '', '', 7, 843),
(26, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ปิยพงษ์', 'อินทร์ชัย', '', '', '', '', '', '', '2016-09-18', '2016-09-18', '', '', 7, 843),
(27, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นครินทร์', 'อินทร์มานะ', '', '', '', '', '', '', '2016-08-24', '2016-08-24', '', '', 7, 843),
(28, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อนันตพร', 'ศรีเมือง', '', '', '', '', '', '', '2016-08-23', '2016-08-23', '', '', 7, 843),
(29, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'รัตติกาล', 'ทองพั้ว', '', '', '', '', '', '', '2016-10-03', '2016-10-03', '', '', 7, 843),
(30, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ณัฐวุฒิ', 'ปัญญาคำ', '', '', '', '', '', '', '2016-11-23', '2016-11-23', '', '', 7, 843),
(31, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ภานุวัฒน์', 'เจริญสมบัติ', '', '', '', '', '', '', '2016-12-05', '2016-12-05', '', '', 7, 843),
(32, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ณัฐพงษ์', 'หวดสันเทียะ', '', '', '', '', '', '', '2016-12-05', '2016-12-05', '', '', 7, 843),
(33, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อภิวัฒน์', 'ธรรมจินโด', '', '', '', '', '', '', '2016-12-09', '2016-12-09', '', '', 7, 843),
(34, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ก่อเกียรติ', 'จีนอ่อง', '', '', '', '', '', '', '2005-05-16', '2005-05-16', '', '', 7, 843),
(35, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ชิตวีย์', 'เมาสาย', '', '', '', '', '', '', '2012-06-26', '2012-06-26', '', '', 7, 843),
(36, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เอกพงษ์', 'รองพล', '', '', '', '', '', '', '2009-02-02', '2009-02-02', '', '', 7, 843),
(37, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ธิติภูมิ', 'พิพัฒน์ปัญญา', '', '', '', '', '', '', '2013-01-11', '2013-01-11', '', '', 7, 843),
(38, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กฤตเมธ', 'วินัยธรรม', '', '', '', '', '', '', '2013-02-12', '2013-02-12', '', '', 7, 843),
(39, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'พิภู', 'รอดสมบูรณ์', '', '', '', '', '', '', '2014-04-21', '2014-04-21', '', '', 7, 843),
(40, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'จิราภรณ์', 'พักแพง', '', '', '', '', '', '', '2014-08-01', '2014-08-01', '', '', 7, 843),
(41, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ฉัตรชัย', 'พิชัยวานิชสิน', '', '', '', '', '', '', '2016-07-01', '2016-07-01', '', '', 7, 843),
(42, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ธนชัย', 'แสงเขียว', '', '', '', '', '', '', '2005-04-18', '2005-04-18', '', '', 7, 843),
(43, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อรวรรณ', 'ฉัตรดอน', '', '', '', '', '', '', '2008-06-09', '2008-06-09', '', '', 7, 843),
(44, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ประจักษ์', 'ฉันทลาโภ', '', '', '', '', '', '', '2009-03-27', '2009-03-27', '', '', 7, 843),
(45, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'เจี๊ยบ', 'จารุณี', 'คำสิงห์', '', '', '', '', '', '', '2012-08-01', '2012-08-01', '', '', 7, 843),
(46, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'อ้อ', 'วรรณศิริ', 'สุวรรณรี', '', '', '', '', '', '', '2014-08-26', '2014-08-26', '', '', 7, 843),
(47, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'หนก', 'จตุพร', 'สิงหะ', '', '', '', '', '', '', '2004-05-19', '2004-05-19', '', '', 7, 843),
(48, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'เด่น', 'ชมพูนุช', 'ทองพรหม', '', '', '', '', '', '', '2009-03-02', '2009-03-02', '', '', 7, 843),
(49, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ชลธิชา', 'เงินลา', '', '', '', '', '', '', '2015-09-29', '2015-09-29', '', '', 7, 843),
(50, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'มลิวรรณ', 'เป้าบ้านเซ่า', '', '', '', '', '', '', '2016-01-20', '2016-01-20', '', '', 7, 843),
(51, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'พิม', 'พิมพ์วิไล', 'จิตรวิขาม', '', '', '', '', '', '', '2008-04-21', '2008-04-21', '', '', 7, 843),
(52, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ศิริภร', 'ทองนาค', '', '', '', '', '', '', '2008-09-15', '2008-09-15', '', '', 7, 843),
(53, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ธมลวรรณ', 'สุขคุ้ม', '', '', '', '', '', '', '2014-01-13', '2014-01-13', '', '', 7, 843),
(54, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ชลธิชา', 'มังวงษ์', '', '', '', '', '', '', '2015-01-12', '2015-01-12', '', '', 7, 843),
(55, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กรรณิการ์', 'กลีบการะเกตุ', '', '', '', '', '', '', '2016-05-06', '2016-05-06', '', '', 7, 843),
(56, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'เพชร', 'มนญพัชญ์', 'ชิตสุนทรวงศ์', '', '', '', '', '', '', '2012-03-19', '2012-03-19', '', '', 7, 843),
(57, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'อ็อด', 'จันทร์จิรา', 'ม่วงวงษ์', '', '', '', '', '', '', '2011-10-12', '2011-10-12', '', '', 7, 843),
(58, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'วัชราภรณ์', 'สอนเฟือง', '', '', '', '', '', '', '2011-11-23', '2011-11-23', '', '', 7, 843),
(59, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'ป้อม', 'มนัสชัย', 'สังข์นาค', '', '', '', '', '', '', '2012-05-14', '2012-05-14', '', '', 7, 843),
(60, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'จักรพงศ์', 'อยู่จำเนียร', '', '', '', '', '', '', '2015-05-15', '2015-05-15', '', '', 7, 843),
(61, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กันตินันท์', 'พันธุ', '', '', '', '', '', '', '2014-01-27', '2014-01-27', '', '', 7, 843),
(62, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'อ๊อฟ', 'นภดล', 'เวียงสมุทร', '', '', '', '', '', '', '2014-09-18', '2014-09-18', '', '', 7, 843),
(63, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ธงชัย', 'ดีเจริญ', '', '', '', '', '', '', '2014-09-29', '2014-09-29', '', '', 7, 843),
(64, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'พิสุทธิ์', 'ผลไพบูลย์', '', '', '', '', '', '', '2015-02-26', '2015-02-26', '', '', 7, 843),
(65, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เอกรักษ์', 'น้อยสกุล', '', '', '', '', '', '', '2016-07-20', '2016-07-20', '', '', 7, 843),
(66, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สุนทร', 'ส่งศรี', '', '', '', '', '', '', '2016-12-16', '2016-12-16', '', '', 7, 843),
(67, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ฉัตรชัย', 'เมยท่าแค', '', '', '', '', '', '', '2016-12-19', '2016-12-19', '', '', 7, 843),
(68, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ณภัทรลดา', 'วงษ์คำจันทร์', '', '', '', '', '', '', '2014-02-03', '2014-02-03', '', '', 7, 843),
(69, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'จำนงค์', 'กราบพรมราช', '', '', '', '', '', '', '2006-04-18', '2006-04-18', '', '', 7, 843),
(70, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ชัยพร', 'ชันแสง', '', '', '', '', '', '', '2006-01-13', '2006-01-13', '', '', 7, 843),
(71, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สมบูรณ์', 'อินทร์เผือก', '', '', '', '', '', '', '2006-04-01', '2006-04-01', '', '', 7, 843),
(72, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'บุญชู', 'พิมแจ่ม', '', '', '', '', '', '', '2005-01-19', '2005-01-19', '', '', 7, 843),
(73, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สาคร', 'จันทร์ชม(คร)', '', '', '', '', '', '', '2007-07-10', '2007-07-10', '', '', 7, 843),
(74, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'ชัย', 'สุรชัย', 'เฉลิมฤทธิ์', '', '', '', '', '', '', '2008-12-02', '2008-12-02', '', '', 7, 843),
(75, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ธงชัย', 'ทับทอง', '', '', '', '', '', '', '2013-09-04', '2013-09-04', '', '', 7, 843),
(76, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เอกชัย', 'เรืองรักเรียน', '', '', '', '', '', '', '2014-12-22', '2014-12-22', '', '', 7, 843),
(77, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ศราวุฒิ', 'โตม่วย', '', '', '', '', '', '', '2015-06-22', '2015-06-22', '', '', 7, 843),
(78, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'กั๊ต', 'มานพ', 'แดนดงเมือง', '', '', '', '', '', '', '2015-07-23', '2015-07-23', '', '', 7, 843),
(79, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เสฎฐวุฒิ', 'ป้อมแก้ว', '', '', '', '', '', '', '2015-08-03', '2015-08-03', '', '', 7, 843),
(80, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อภิรักษ์', 'วรวิทยพิลาส', '', '', '', '', '', '', '2015-11-03', '2015-11-03', '', '', 7, 843),
(81, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'วัลลภ', 'บุ้งทอง', '', '', '', '', '', '', '2012-06-05', '2012-06-05', '', '', 7, 843),
(82, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, 'บอย', 'ศักทวี', 'เที่ยงตรงดี', '', '', '', '', '', '', '2014-08-26', '2014-08-26', '', '', 7, 843),
(83, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ณัฐพงศ์', 'กรัตนุถะ', '', '', '', '', '', '', '2015-04-20', '2015-04-20', '', '', 7, 843),
(84, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เอกชัย', 'เสียงพงษ์พันธ์', '', '', '', '', '', '', '2016-04-18', '2016-04-18', '', '', 7, 843),
(85, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'วิสิฐ', 'บัวเหลือง', '', '', '', '', '', '', '2016-09-13', '2016-09-13', '', '', 7, 843),
(86, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'กลยุทธ', 'นพวรรณ', '', '', '', '', '', '', '2016-09-19', '2016-09-19', '', '', 7, 843),
(87, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'นุกูล', 'โตปอด', '', '', '', '', '', '', '2016-12-07', '2016-12-07', '', '', 7, 843),
(88, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ฤทธิชัย', 'จังหวัดเขต', '', '', '', '', '', '', '2016-12-14', '2016-12-14', '', '', 7, 843),
(89, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'ปัญญา', 'มีบุญมา', '', '', '', '', '', '', '2002-11-01', '2002-11-01', '', '', 7, 843),
(90, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อนุชา', 'เอี่ยมพงษ์', '', '', '', '', '', '', '2003-07-01', '2003-07-01', '', '', 7, 843),
(91, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'สรรเสริญ', 'สุขเทศ', '', '', '', '', '', '', '2008-02-25', '2008-02-25', '', '', 7, 843),
(92, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'โชคชัย', 'ศรีวันนา', '', '', '', '', '', '', '2012-02-28', '2012-02-28', '', '', 7, 843),
(93, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อินทรี', 'แซ่บู๊', '', '', '', '', '', '', '2013-11-28', '2013-11-28', '', '', 7, 843),
(94, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'อภิวัฒน์', 'ประลามุข', '', '', '', '', '', '', '2013-06-27', '2013-06-27', '', '', 7, 843),
(95, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'จรัญ', 'บัวเหลือง', '', '', '', '', '', '', '2014-10-10', '2014-10-10', '', '', 7, 843),
(96, '2017-01-25 19:03:18', '2017-01-25 12:03:18', 1, '', 'เกรียงไกร', 'บุญพูล', '', '', '', '', '', '', '2016-09-19', '2016-09-19', '', '', 7, 843);

-- --------------------------------------------------------

--
-- Table structure for table `employee_suffix`
--

CREATE TABLE `employee_suffix` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job`
--

CREATE TABLE `job` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `job_parent_id` int(4) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `job`
--

INSERT INTO `job` (`id`, `created`, `modified`, `owner`, `name`, `name_english`, `description`, `job_parent_id`) VALUES
(1, '2017-01-15 11:35:32', '2017-01-22 18:55:31', 1, 'บาธไลน์', 'Bathline', 'Bathline', 1),
(2, '2017-01-15 11:35:32', '2017-01-15 06:50:33', 1, 'แผนกขาย', 'Sales Department', 'เพิ่มยอดขาย สร้างรายได้ให้แก่บริษัท เอาใจใส่ลูกค้า และบริการ ในยามคับขัน ', 6),
(3, '2017-01-15 13:20:37', '2017-01-24 20:23:10', 7777, 'แผนกจัดซื้อ', ' Purchasing Department', 'สามารถสั่งซื้อสินค้ามาได้ตรงตามเวลา และมีประสิทธิภาพในการควบคุมสินค้า ที่สั่งซื้อมา', 6),
(4, '2017-01-15 13:24:30', '2017-01-15 06:50:44', 7777, 'แผนกคลังสินค้า', 'Warehouse Department', 'ดูแล รักษาสภาพโกดังเก็บของ และสินค้านั้นๆ มีการดูแลตรวจสภาพสินค้า และจำนวนสินค้า สามารถบ่งชี้ปัญหาของขาดและเกินสต็อค มีความรักและห่วงใยในการทำงาน', 6),
(5, '2017-01-15 13:29:36', '2017-01-15 06:50:53', 7777, 'แผนกการตลาด', 'Marketing Department', 'ออกสำรวจตลาด เพื่อ เพิ่มช่องทาง ในการขาย ขยายภาพลักษณ์ของบริษัท เข้าใจและรับรู้วสิ่งที่ผู้บริโภคนั้นต้องการ  ใส่ใจทุกรายละเอียดของลูกค้าในเชิงความรู้สึก', 6),
(6, '2017-01-15 13:35:17', '2017-01-19 19:36:46', 1, 'แผนกบุคคล', '็Human Resource Manager', 'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน', 10),
(7, '2017-01-15 13:37:38', '2017-01-15 06:51:08', 7777, 'แผนกจัดส่ง', 'Shipping Department', 'ส่งปลอดภัย ตรงเวลา และ แน่วแน่ หมั่นดูแลเอาใจใส่ยานพาหนะ และ พักผ่อนอย่างเพียงพอ', 6),
(8, '2017-01-15 13:41:12', '2017-01-15 06:51:20', 7777, 'แผนกบัญชีการเงิน', ' Financial Accountant', 'ตรวจสอบความเป็นมาของเงิน และบันทึก ได้อย่างมีประสิทธิภาพ สามารถทำรายงาน วิเคราะห์ เชิงลึก เพื่อเป็นแนวทางและข้อมูลให้แก่ผู้บริหารได้ รับผิดชอบและซื่อสัตย์', 6),
(9, '2017-01-15 13:46:35', '2017-01-22 18:54:18', 1, 'ประธานบริษัทฯ', 'President', '', 1),
(10, '2017-01-15 13:49:46', '2017-01-22 18:54:33', 1, 'ประธานกรรมการบริหาร', 'Chief Executive Officer', '', 9),
(11, '2017-01-23 01:26:14', '2017-01-22 18:26:14', 1, 'พนักงานแนะนำสินค้า', 'Product Consultant', '', 2),
(12, '2017-01-23 22:49:19', '2017-01-23 15:51:34', 1, 'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย', 'Director of Distributor Development', 'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย', 2);

-- --------------------------------------------------------

--
-- Table structure for table `job_log`
--

CREATE TABLE `job_log` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `job_id` int(4) NOT NULL,
  `employee_id` int(4) NOT NULL,
  `job_log_status_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `job_log`
--

INSERT INTO `job_log` (`id`, `created`, `modified`, `owner`, `job_id`, `employee_id`, `job_log_status_id`) VALUES
(1, '2017-01-20 02:36:04', '2017-01-19 19:36:04', 1, 6, 1, 1),
(2, '2017-01-20 03:55:45', '2017-01-19 20:55:45', 1, 3, 1, 1),
(3, '2017-01-20 03:55:49', '2017-01-19 20:55:49', 1, 2, 1, 1),
(4, '2017-01-20 12:28:46', '2017-01-20 05:28:46', 1, 3, 2, 1),
(5, '2017-01-23 20:08:02', '2017-01-23 13:08:02', 1, 6, 3, 1),
(6, '2017-01-23 22:56:30', '2017-01-23 15:56:30', 1, 12, 4, 1),
(7, '2017-01-23 23:05:28', '2017-01-23 16:05:28', 1, 12, 1, 1),
(8, '2017-01-23 23:57:06', '2017-01-23 16:57:06', 1, 11, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `job_log_status`
--

CREATE TABLE `job_log_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `job_log_status`
--

INSERT INTO `job_log_status` (`id`, `created`, `modified`, `owner`, `name`, `description`, `boolean`) VALUES
(1, '2017-01-15 11:39:55', '2017-01-15 04:39:55', 1, 'HIRE', 'รับหน้าที่', 1),
(2, '2017-01-15 11:40:40', '2017-01-15 04:40:40', 1, 'FIRE', 'ไล่ออก', 0),
(3, '2017-01-15 11:40:49', '2017-01-15 04:43:00', 1, 'RESIGN', 'ลาออก', 0),
(4, '2017-01-15 11:41:24', '2017-01-15 04:41:24', 1, 'DETENTION', 'พักงาน', 0);

-- --------------------------------------------------------

--
-- Table structure for table `loginattempts`
--

CREATE TABLE `loginattempts` (
  `IP` varchar(20) CHARACTER SET utf8 NOT NULL,
  `Attempts` int(11) NOT NULL,
  `LastLogin` datetime NOT NULL,
  `Username` varchar(65) CHARACTER SET utf8 DEFAULT NULL,
  `ID` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `loginattempts`
--

INSERT INTO `loginattempts` (`IP`, `Attempts`, `LastLogin`, `Username`, `ID`) VALUES
('::1', 1, '2017-01-19 22:03:02', 'seasiri', 1),
('171.96.210.86', 1, '2017-01-21 13:50:21', 'seasiri', 2),
('110.171.92.101', 1, '2017-01-24 02:53:51', 'aumpa', 3),
('161.200.188.207', 1, '2017-01-20 05:27:12', 'seasiri', 4),
('161.200.188.74', 1, '2017-01-20 08:10:39', 'seasiri', 5),
('110.171.92.101', 1, '2017-01-20 08:33:20', 'มนญพัชญ์', 6),
('110.171.92.101', 2, '2017-01-20 09:07:24', '', 7),
('223.24.81.81', 1, '2017-01-21 18:48:22', 'seasiri', 8),
('171.96.210.86', 3, '2017-01-22 10:37:22', ' seasiri', 9),
('223.24.111.26', 2, '2017-01-23 15:52:13', 'kittiwut', 10),
('27.55.15.171', 1, '2017-01-24 05:21:37', 'seasiri', 11),
('161.200.188.226', 1, '2017-01-24 06:21:13', 'seasiri', 12);

-- --------------------------------------------------------

--
-- Table structure for table `note`
--

CREATE TABLE `note` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `title` text COLLATE utf8_unicode_ci NOT NULL,
  `body` text COLLATE utf8_unicode_ci NOT NULL,
  `from` int(4) NOT NULL,
  `to` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `note_type`
--

CREATE TABLE `note_type` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `note_type_parent_id` int(4) NOT NULL DEFAULT '1',
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_detail`
--

CREATE TABLE `order_detail` (
  `id` int(11) UNSIGNED ZEROFILL NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `order_list_id` int(8) NOT NULL,
  `order_detail_status_id` int(8) NOT NULL,
  `product_id` int(8) NOT NULL,
  `quantity` int(8) UNSIGNED NOT NULL,
  `price` decimal(13,2) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `order_detail`
--

INSERT INTO `order_detail` (`id`, `created`, `modified`, `owner`, `order_list_id`, `order_detail_status_id`, `product_id`, `quantity`, `price`) VALUES
(00000000001, '2017-01-19 01:54:34', '2017-01-18 18:54:34', 1, 1, 1, 1, 12, '30.00');

-- --------------------------------------------------------

--
-- Table structure for table `order_detail_status`
--

CREATE TABLE `order_detail_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `order_detail_status`
--

INSERT INTO `order_detail_status` (`id`, `created`, `modified`, `owner`, `name`, `description`, `boolean`) VALUES
(1, '2017-01-19 01:02:40', '2017-01-18 18:02:40', 1, 'ADD', 'ADD', 1);

-- --------------------------------------------------------

--
-- Table structure for table `order_list`
--

CREATE TABLE `order_list` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `agent_id` int(8) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT 'po_number'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `order_list`
--

INSERT INTO `order_list` (`id`, `created`, `modified`, `owner`, `agent_id`, `name`) VALUES
(1, '2017-01-19 01:32:42', '2017-01-18 18:32:42', 1, 1, '24242'),
(2, '2017-01-19 01:48:08', '2017-01-18 18:48:08', 1, 1, '1241'),
(3, '2017-01-19 01:50:16', '2017-01-18 18:50:16', 1, 1, '2424'),
(4, '2017-01-19 03:11:41', '2017-01-18 20:11:41', 1, 1, '2');

-- --------------------------------------------------------

--
-- Table structure for table `order_log`
--

CREATE TABLE `order_log` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `order_list_id` int(8) NOT NULL,
  `order_process_status_id` int(8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_process_status`
--

CREATE TABLE `order_process_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `product_catagories_id` int(4) NOT NULL,
  `product_status_id` int(4) NOT NULL,
  `supplier_id` int(4) NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `short_description` text COLLATE utf8_unicode_ci NOT NULL,
  `long_description` text COLLATE utf8_unicode_ci NOT NULL,
  `barcode` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `created`, `modified`, `owner`, `product_catagories_id`, `product_status_id`, `supplier_id`, `name`, `name_english`, `short_description`, `long_description`, `barcode`) VALUES
(1, '2017-01-19 01:01:58', '2017-01-26 19:26:27', 1, 1, 1, 15, 'B-4654', 'TALAS', 'ทาลัส', 'ใช้น้ำ 3/4.5ลิตร ฝาUF', '8859199111057'),
(2, '2017-01-25 16:33:51', '2017-01-26 08:07:11', 2, 1, 1, 15, 'B-4654A', 'TALAS', 'ทาลัส', 'พร้อมฝารองนั่งอัตโนมัติ', '8859199111606'),
(3, '2017-01-26 15:04:39', '2017-01-26 08:06:57', 2, 1, 1, 15, 'B-4681', 'New Pronto', 'นิวปรอนโต้', 'ใช้น้ำ3/4.5ลิตร ฝาUF', '8859199111675'),
(4, '2017-01-26 15:06:10', '2017-01-26 08:06:41', 2, 1, 1, 15, 'B-4613', 'DANAS', 'ดานัส', 'ใช้น้ำ 3/4.5ลิตร ฝาUF', '8859199110999'),
(5, '2017-01-26 15:07:56', '2017-01-26 08:08:26', 2, 1, 1, 15, 'B-4620', 'SPEEDY', 'สปีดี้', 'ใช้น้ำ 3/4.5ลิตร ฝาPP', '8859199111040'),
(6, '2017-01-26 15:09:18', '2017-01-26 11:44:05', 2, 15, 1, 15, 'B-1619', 'VICTORY', 'วิคทอรี่', 'ใช้น้ำ 3/6 ลิตร ฝาSlide Click', '8859199110050'),
(7, '2017-01-26 15:10:06', '2017-01-26 11:44:07', 2, 19, 1, 15, 'B-1673', 'WIN', 'วิน', 'ใช้น้ำ 3/6 ลิตร ฝาSlide Click Long Curve', '8859199110111'),
(8, '2017-01-26 15:11:16', '2017-01-26 11:44:09', 2, 15, 1, 18, 'B-4024', 'THE BEST', 'เดอะเบสท์', 'ใช้น้ำ 2.5/4 ลิตร ฝาSlow Downธรรมดา', '8859199110067'),
(9, '2017-01-26 15:16:35', '2017-01-26 11:44:12', 2, 31, 1, 18, 'B-4023', 'BOOM', 'บูม', 'ใช้น้ำ 2.5/4ลิตร ฝาSlow Down', '8859199110104'),
(10, '2017-01-26 15:17:27', '2017-01-26 11:44:18', 2, 31, 1, 18, 'B-4078', 'SUPER SAVE', 'ซุปเปอร์เซฟ', 'ใช้น้ำ 3/6ลิตร ฝาSlow Down', '8859199110142'),
(11, '2017-01-26 15:18:19', '2017-01-26 11:44:14', 2, 31, 1, 15, 'B-1674', 'SUPER JET', 'ซุปเปอร์เจ็ท', 'ใช้น้ำ 3/6ลิตร ฝาSlide Click', '8859199111651'),
(12, '2017-01-26 15:18:50', '2017-01-26 11:44:20', 2, 31, 1, 15, 'B-4026', 'FIN', 'ฟิน', 'ใช้น้ำ 3/6ลิตร ฝาSlow Down', '8859199111644'),
(13, '2017-01-26 15:19:45', '2017-01-26 11:44:23', 2, 31, 1, 15, 'B-2144', 'PREMA', 'พรีม่า', 'ใช้น้ำ 3/6ลิตร ฝาSlow Down', '8859199111637'),
(14, '2017-01-26 15:21:58', '2017-01-26 11:44:24', 2, 31, 1, 30, 'B-2145', 'ORCA', 'ออก้า', 'ใช้น้ำ 3/6ลิตร ฝาEasy Click , UF', '8859199111699'),
(15, '2017-01-26 15:23:21', '2017-01-26 11:44:26', 2, 11, 1, 15, 'ฺB-1607', 'BEBE', 'เบบี้', 'ใช้น้ำ 3/6ลิตร ', '8859199111422'),
(16, '2017-01-26 15:40:04', '2017-01-26 11:44:29', 1, 31, 1, 15, 'B-4607', 'SPIRAL', 'สไปรัล', 'ใช้น้ำ 3/4.5ลิตร ฝาSlow Down ', '8859199111019'),
(17, '2017-01-26 15:40:50', '2017-01-26 08:40:50', 2, 2, 1, 18, 'B-008', 'SUPER BIG', 'ซุปเปอร์บิ๊ก', 'ใช้น้ำ 3/6ลิตร Slow Down', '8859199110203'),
(18, '2017-01-26 15:41:21', '2017-01-26 08:41:21', 2, 2, 1, 18, 'B-2024', 'LOVELY', 'เลิฟลี่', 'ใช้น้ำ 3/6 ลิตร ฝาSlow Down', '8859199110234'),
(19, '2017-01-26 15:41:55', '2017-01-26 08:41:55', 2, 2, 1, 18, 'B-2025', 'LUCKY', 'ลัคกี้', 'ใชน้ำ 3/6ลิตร ฝาSlow Down', '8859199110241'),
(20, '2017-01-26 15:44:27', '2017-01-26 08:44:27', 2, 9, 1, 29, 'B-7280', 'JUMBO', 'จัมโบ้', '37x50x41cm.', '8859199110265'),
(21, '2017-01-26 15:45:34', '2017-01-26 08:45:34', 2, 9, 1, 16, 'B-111 W', 'COMFORT WHITE', 'สบาย สีขาว', '38x46x38cm.', '8859199110302'),
(22, '2017-01-26 15:46:28', '2017-01-26 08:46:28', 2, 9, 1, 16, 'B-111 B', 'COMFORT BLUE', 'สบาย สีฟ้า', '38x46x38cm.', '8859199110272'),
(23, '2017-01-26 15:47:16', '2017-01-26 08:47:16', 2, 9, 1, 16, 'B-111 P', 'COMFORT PINK', 'สบาย สีชมพู', '38x46x38cm.', '8859199110289'),
(24, '2017-01-26 15:47:53', '2017-01-26 08:47:53', 2, 9, 1, 16, 'B-111 G', 'COMFORT GREEN', 'สบาย สีเขียวอ่อน', '38x46x38cm.', '8859199110296'),
(25, '2017-01-26 15:49:08', '2017-01-26 08:49:08', 2, 2, 1, 28, 'B-2138', 'IMPERIAL', 'อิมพีเรียล', 'ใช้น้ำ 6ลิตร ฝาSlow Down', '8859199111736'),
(26, '2017-01-26 15:51:18', '2017-01-26 08:51:29', 2, 2, 1, 28, 'B-2188', 'MODULAR', 'โมดูลล่า', 'ใช้น้ำ 3/6ลิตร ฝาSlow Down', '8859199111910'),
(27, '2017-01-26 16:02:47', '2017-01-26 11:44:31', 2, 11, 1, 29, 'B-4201', 'TRIUMP', 'ไทรอัมพ์', 'ใช้น้ำ 3/6ลิตร ฝาEasy Click with BIDET', '8859199111743'),
(28, '2017-01-26 16:03:50', '2017-01-26 09:03:50', 2, 1, 1, 15, 'B-4610', 'MAXIMUM', 'แม็กซิมั่ม', 'ใช้น้ำ 3/6ลิตร ฝาPP Easy Click', '8859199131420'),
(29, '2017-01-26 16:20:08', '2017-01-26 11:44:33', 2, 31, 1, 18, 'B-1672', 'NATURA', 'นาทูร่า', '', '8859199110036'),
(30, '2017-01-26 16:23:06', '2017-01-26 11:44:35', 2, 31, 1, 15, 'B-1674 G', 'SUPER JET GOLD', 'ซุปเปอร์เจ็ท ขอบทอง', 'ใช้น้ำ 3/6ลิตร ฝาSlide Click', ''),
(31, '2017-01-26 16:23:55', '2017-01-26 11:44:37', 2, 11, 1, 15, 'B-1674 S', 'SUPER JET SILVER', 'ซุปเปอร์เจ็ท ขอบเงิน', 'ใช้น้ำ 3/6ลิตร ฝาSlide Click', '');

-- --------------------------------------------------------

--
-- Table structure for table `product_attribute`
--

CREATE TABLE `product_attribute` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `product_attribute_parent_id` int(4) NOT NULL DEFAULT '1',
  `product_catagories_id` int(32) NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `unit_thai` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `unit_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product_attribute`
--

INSERT INTO `product_attribute` (`id`, `created`, `modified`, `owner`, `product_attribute_parent_id`, `product_catagories_id`, `name`, `name_english`, `description`, `unit_thai`, `unit_english`) VALUES
(1, '2017-01-23 20:18:00', '2017-01-26 11:59:57', 1, 1, 11, 'root', 'root', 'root', '', ''),
(2, '2017-01-23 21:02:26', '2017-01-23 14:03:27', 1, 1, 5, 'ระบบนํ้า', 'ระบบนํ้า', 'ระบบนํ้า', '', ''),
(3, '2017-01-23 21:38:19', '2017-01-23 14:38:19', 1, 1, 5, 'ประเภท', 'ประเภท', 'ประเภท', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `product_attribute_option`
--

CREATE TABLE `product_attribute_option` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `product_attribute_id` int(4) NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product_attribute_option`
--

INSERT INTO `product_attribute_option` (`id`, `created`, `modified`, `owner`, `product_attribute_id`, `name`, `name_english`) VALUES
(1, '2017-01-23 20:59:09', '2017-01-23 14:38:29', 1, 3, 'วันพีช', 'One Piece'),
(2, '2017-01-23 21:00:03', '2017-01-23 14:38:35', 1, 3, 'ทูพีช', 'Two Pieces'),
(3, '2017-01-23 21:00:06', '2017-01-23 14:03:49', 1, 2, 'ทอเนโด', 'Tornado');

-- --------------------------------------------------------

--
-- Table structure for table `product_attribute_value`
--

CREATE TABLE `product_attribute_value` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `product_id` int(4) NOT NULL,
  `product_attribute_id` int(4) NOT NULL,
  `product_attribute_option_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_catagories`
--

CREATE TABLE `product_catagories` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `product_catagories_parent_id` int(4) NOT NULL DEFAULT '1',
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product_catagories`
--

INSERT INTO `product_catagories` (`id`, `created`, `modified`, `owner`, `product_catagories_parent_id`, `name`, `name_english`, `description`) VALUES
(1, '2017-01-23 19:46:16', '2017-01-26 12:04:26', 1, 2, 'ห้องนํ้า', 'Bathroom', 'root'),
(2, '2017-01-23 19:47:42', '2017-01-26 12:05:53', 1, 5, 'ชักโครก', 'Toilet', ''),
(3, '2017-01-25 16:12:54', '2017-01-26 12:07:19', 2, 3, 'กล่องสุขภัณฑ์', 'Sanitary Ware BOX', ''),
(4, '2017-01-25 16:12:23', '2017-01-26 12:07:22', 2, 4, 'หลังคา', 'Roof', ''),
(5, '2017-01-23 19:50:14', '2017-01-26 11:34:19', 1, 2, 'สุขภัณฑ์', 'Sanitary Ware', ''),
(6, '2017-01-23 19:51:36', '2017-01-25 08:53:25', 2, 5, 'อ่างล้างหน้า', 'Wash Basin', ''),
(7, '2017-01-23 19:51:56', '2017-01-25 08:53:54', 2, 5, 'ขาตั้งเคลือบ', 'Pedestal Wash Basin', ''),
(8, '2017-01-23 20:00:50', '2017-01-25 08:54:18', 2, 5, 'โถปัสสาวะชาย', 'Urinal', ''),
(9, '2017-01-23 20:03:22', '2017-01-25 08:54:59', 2, 5, 'นั่งราบราดน้ำ', 'Hang flush Toilet', ''),
(10, '2017-01-23 20:04:00', '2017-01-25 08:56:10', 2, 10, 'เคาน์เตอร์อ่างล้างหน้า', 'Ceramic or Glass Wash Basin', ''),
(11, '2017-01-25 15:57:53', '2017-01-25 08:58:12', 2, 11, 'กระจกเงา', 'Mirror', ''),
(12, '2017-01-25 15:58:42', '2017-01-25 08:58:55', 2, 12, 'ตู้อาบน้ำ', 'Shower Room', ''),
(13, '2017-01-25 15:59:15', '2017-01-25 08:59:25', 2, 13, 'ฉากกั้นอาบน้ำ', 'Shower Door', ''),
(14, '2017-01-25 15:59:54', '2017-01-25 09:00:19', 2, 14, 'ประตู', 'BATH WOOD Doors', ''),
(15, '2017-01-25 16:00:41', '2017-01-25 09:02:51', 2, 15, 'กระเบื้อง', 'Tiles', ''),
(16, '2017-01-25 16:00:59', '2017-01-25 09:02:42', 2, 16, 'แกรนิต', 'Polished Tiles', ''),
(17, '2017-01-25 16:01:18', '2017-01-25 09:02:33', 2, 17, 'กรุยเชิง', 'Border Tiles', ''),
(18, '2017-01-25 16:02:10', '2017-01-25 09:02:25', 2, 18, 'ชุดแต่งแกรนิต', 'Carpet Tiles', ''),
(19, '2017-01-25 16:03:23', '2017-01-25 09:03:36', 2, 19, 'กระเบื้องอาร์ทสโตน', 'Artstone Tiles', ''),
(20, '2017-01-25 16:06:00', '2017-01-25 09:06:11', 2, 20, 'Accessories', ' Accessories', ''),
(21, '2017-01-25 16:06:51', '2017-01-25 09:07:35', 2, 21, 'อ่างอาบน้ำแมซซาจ', 'Massage Bathtub', ''),
(22, '2017-01-25 16:07:10', '2017-01-25 09:07:48', 2, 22, 'เตาแก๊ส', 'Cooking Range', ''),
(23, '2017-01-25 16:07:10', '2017-01-25 09:08:19', 2, 23, 'อะไหล่', 'Spare Part', ''),
(24, '2017-01-25 16:08:52', '2017-01-25 09:25:17', 2, 24, 'บล็อกแก้ว', 'Glass Block', ''),
(25, '2017-01-25 16:11:43', '2017-01-25 09:25:33', 2, 25, 'น้ำยาเคมี', 'Chemical Cleaning', ''),
(28, '2017-01-25 16:20:04', '2017-01-25 09:26:10', 2, 28, 'ไม้บัวพีวีซี', 'Wooden Cornice PVC', ''),
(29, '2017-01-25 16:20:28', '2017-01-25 09:26:35', 2, 29, 'โมเสค', 'Mosaic', ''),
(30, '2017-01-25 16:20:44', '2017-01-25 09:26:54', 2, 30, 'อิฐมวลเย็น', 'Block', ''),
(31, '2017-01-25 16:21:02', '2017-01-25 09:27:22', 2, 31, 'กระดาษฟอร์ม', 'Form Paper', ''),
(32, '2017-01-25 16:21:21', '2017-01-25 09:27:34', 2, 32, 'เสื้อพนักงาน', 'BATH LINE Uniform', ''),
(33, '2017-01-25 16:21:35', '2017-01-25 09:27:47', 2, 33, 'สินค้าตัวอย่าง', 'Sample Product', ''),
(36, '2017-01-25 16:23:13', '2017-01-26 11:50:25', 2, 36, 'ขาตั้งอ่าง', 'Pedestal Wash Basin', ''),
(37, '2017-01-25 16:23:32', '2017-01-25 09:28:32', 2, 37, 'แท่นโชว์', 'Booth Show Product', ''),
(38, '2017-01-25 16:24:36', '2017-01-26 11:49:08', 2, 38, 'ปูนกาว', 'Glue Cement', '');

-- --------------------------------------------------------

--
-- Table structure for table `product_status`
--

CREATE TABLE `product_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product_status`
--

INSERT INTO `product_status` (`id`, `created`, `modified`, `owner`, `name`, `description`, `boolean`) VALUES
(1, '2017-01-19 01:01:32', '2017-01-18 18:01:32', 1, 'ACTIVE', 'ACTIVE', 1),
(2, '2017-01-20 03:58:15', '2017-01-19 20:58:15', 1, 'DISCONTINUE', 'DISCONTINUE', 0),
(3, '2017-01-20 03:58:42', '2017-01-19 20:58:52', 1, 'OUT OF STOCK', 'OUT OF STOCK', 0);

-- --------------------------------------------------------

--
-- Table structure for table `province`
--

CREATE TABLE `province` (
  `id` int(5) UNSIGNED NOT NULL,
  `code` varchar(2) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `name_english` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `geo_id` int(5) UNSIGNED NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `province`
--

INSERT INTO `province` (`id`, `code`, `name`, `name_english`, `geo_id`) VALUES
(1, '10', 'กรุงเทพมหานคร   ', 'Bangkok', 2),
(2, '11', 'สมุทรปราการ   ', 'Samut Prakan', 2),
(3, '12', 'นนทบุรี   ', 'Nonthaburi', 2),
(4, '13', 'ปทุมธานี   ', 'Pathum Thani', 2),
(5, '14', 'พระนครศรีอยุธยา   ', 'Phra Nakhon Si Ayutthaya', 2),
(6, '15', 'อ่างทอง   ', 'Ang Thong', 2),
(7, '16', 'ลพบุรี   ', 'Lop buri', 2),
(8, '17', 'สิงห์บุรี   ', 'Sing Buri', 2),
(9, '18', 'ชัยนาท   ', 'Chai Nat', 2),
(10, '19', 'สระบุรี', 'Saraburi', 2),
(11, '20', 'ชลบุรี   ', 'Chon Buri', 5),
(12, '21', 'ระยอง   ', 'Rayong', 5),
(13, '22', 'จันทบุรี   ', 'Chanthaburi', 5),
(14, '23', 'ตราด   ', 'Trat', 5),
(15, '24', 'ฉะเชิงเทรา   ', 'Chachoengsao', 5),
(16, '25', 'ปราจีนบุรี   ', 'Prachin Buri', 5),
(17, '26', 'นครนายก   ', 'Nakhon Nayok', 2),
(18, '27', 'สระแก้ว   ', 'Sa Kaeo', 5),
(19, '30', 'นครราชสีมา   ', 'Nakhon Ratchasima', 3),
(20, '31', 'บุรีรัมย์   ', 'Buri Ram', 3),
(21, '32', 'สุรินทร์   ', 'Surin', 3),
(22, '33', 'ศรีสะเกษ   ', 'Si Sa Ket', 3),
(23, '34', 'อุบลราชธานี   ', 'Ubon Ratchathani', 3),
(24, '35', 'ยโสธร   ', 'Yasothon', 3),
(25, '36', 'ชัยภูมิ   ', 'Chaiyaphum', 3),
(26, '37', 'อำนาจเจริญ   ', 'Amnat Charoen', 3),
(27, '39', 'หนองบัวลำภู   ', 'Nong Bua Lam Phu', 3),
(28, '40', 'ขอนแก่น   ', 'Khon Kaen', 3),
(29, '41', 'อุดรธานี   ', 'Udon Thani', 3),
(30, '42', 'เลย   ', 'Loei', 3),
(31, '43', 'หนองคาย   ', 'Nong Khai', 3),
(32, '44', 'มหาสารคาม   ', 'Maha Sarakham', 3),
(33, '45', 'ร้อยเอ็ด   ', 'Roi Et', 3),
(34, '46', 'กาฬสินธุ์   ', 'Kalasin', 3),
(35, '47', 'สกลนคร   ', 'Sakon Nakhon', 3),
(36, '48', 'นครพนม   ', 'Nakhon Phanom', 3),
(37, '49', 'มุกดาหาร   ', 'Mukdahan', 3),
(38, '50', 'เชียงใหม่   ', 'Chiang Mai', 1),
(39, '51', 'ลำพูน   ', 'Lamphun', 1),
(40, '52', 'ลำปาง   ', 'Lampang', 1),
(41, '53', 'อุตรดิตถ์   ', 'Uttaradit', 1),
(42, '54', 'แพร่   ', 'Phrae', 1),
(43, '55', 'น่าน   ', 'Nan', 1),
(44, '56', 'พะเยา   ', 'Phayao', 1),
(45, '57', 'เชียงราย   ', 'Chiang Rai', 1),
(46, '58', 'แม่ฮ่องสอน   ', 'Mae Hong Son', 1),
(47, '60', 'นครสวรรค์   ', 'Nakhon Sawan', 2),
(48, '61', 'อุทัยธานี   ', 'Uthai Thani', 2),
(49, '62', 'กำแพงเพชร   ', 'Kamphaeng Phet', 2),
(50, '63', 'ตาก   ', 'Tak', 4),
(51, '64', 'สุโขทัย   ', 'Sukhothai', 2),
(52, '65', 'พิษณุโลก   ', 'Phitsanulok', 2),
(53, '66', 'พิจิตร   ', 'Phichit', 2),
(54, '67', 'เพชรบูรณ์   ', 'Phetchabun', 2),
(55, '70', 'ราชบุรี   ', 'Ratchaburi', 4),
(56, '71', 'กาญจนบุรี   ', 'Kanchanaburi', 4),
(57, '72', 'สุพรรณบุรี   ', 'Suphan Buri', 2),
(58, '73', 'นครปฐม   ', 'Nakhon Pathom', 2),
(59, '74', 'สมุทรสาคร   ', 'Samut Sakhon', 2),
(60, '75', 'สมุทรสงคราม   ', 'Samut Songkhram', 2),
(61, '76', 'เพชรบุรี   ', 'Phetchaburi', 4),
(62, '77', 'ประจวบคีรีขันธ์   ', 'Prachuap Khiri Khan', 4),
(63, '80', 'นครศรีธรรมราช   ', 'Nakhon Si Thammarat', 6),
(64, '81', 'กระบี่   ', 'Krabi', 6),
(65, '82', 'พังงา   ', 'Phangnga', 6),
(66, '83', 'ภูเก็ต   ', 'Phuket', 6),
(67, '84', 'สุราษฎร์ธานี   ', 'Surat Thani', 6),
(68, '85', 'ระนอง   ', 'Ranong', 6),
(69, '86', 'ชุมพร   ', 'Chumphon', 6),
(70, '90', 'สงขลา   ', 'Songkhla', 6),
(71, '91', 'สตูล   ', 'Satun', 6),
(72, '92', 'ตรัง   ', 'Trang', 6),
(73, '93', 'พัทลุง   ', 'Phatthalung', 6),
(74, '94', 'ปัตตานี   ', 'Pattani', 6),
(75, '95', 'ยะลา   ', 'Yala', 6),
(76, '96', 'นราธิวาส   ', 'Narathiwat', 6),
(77, '97', 'บึงกาฬ', 'buogkan', 3);

-- --------------------------------------------------------

--
-- Table structure for table `region`
--

CREATE TABLE `region` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `region_parent_id` int(4) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `region`
--

INSERT INTO `region` (`id`, `created`, `modified`, `owner`, `name`, `description`, `region_parent_id`) VALUES
(1, '2017-01-19 00:57:37', '2017-01-23 16:47:53', 1, 'root', 'root', 1),
(2, '2017-01-23 23:47:59', '2017-01-23 16:47:59', 1, 'ภาคตะวันออกเฉียงเหนือ', 'ภาคตะวันออกเฉียงเหนือ', 1),
(3, '2017-01-23 23:48:11', '2017-01-23 16:48:11', 1, 'ภาคเหนือ', 'ภาคเหนือ', 1),
(4, '2017-01-23 23:48:16', '2017-01-23 16:48:16', 1, 'ภาคกลาง', 'ภาคกลาง', 1),
(5, '2017-01-23 23:48:31', '2017-01-23 16:48:31', 1, 'ภาคตะวันออก', 'ภาคตะวันออก', 1),
(6, '2017-01-23 23:48:37', '2017-01-23 16:48:37', 1, 'ภาคใต้', 'ภาคใต้', 1),
(7, '2017-01-23 23:48:46', '2017-01-23 16:51:13', 1, 'พระราชาณาจักรกัมพูชา', 'พระราชาณาจักรกัมพูชา', 1),
(8, '2017-01-23 23:48:59', '2017-01-23 16:48:59', 1, 'ภาคตะวันตก', 'ภาคตะวันตก', 1),
(9, '2017-01-23 23:51:45', '2017-01-23 16:51:45', 1, 'สาธารณรัฐแห่งสหภาพพม่า', 'สาธารณรัฐแห่งสหภาพพม่า', 1),
(10, '2017-01-23 23:51:57', '2017-01-23 16:51:57', 1, 'สาธารณรัฐประชาธิปไตยประชาชนลาว', 'สาธารณรัฐประชาธิปไตยประชาชนลาว', 1);

-- --------------------------------------------------------

--
-- Table structure for table `retail_pc`
--

CREATE TABLE `retail_pc` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `employee_id` int(4) NOT NULL,
  `agent_id` int(8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `retail_pc`
--

INSERT INTO `retail_pc` (`id`, `created`, `modified`, `owner`, `name`, `employee_id`, `agent_id`) VALUES
(1, '2017-01-24 00:02:47', '2017-01-25 16:41:08', 1, '', 2, 1),
(2, '2017-01-24 00:16:50', '2017-01-23 17:29:05', 1, '', 1, 2);

-- --------------------------------------------------------

--
-- Table structure for table `retail_stock_report`
--

CREATE TABLE `retail_stock_report` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `agent_id` int(8) NOT NULL,
  `product_id` int(8) NOT NULL,
  `quantity_remain` int(16) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `supplier`
--

CREATE TABLE `supplier` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` text COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `city` text COLLATE utf8_unicode_ci NOT NULL,
  `province` text COLLATE utf8_unicode_ci NOT NULL,
  `country` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `post_code` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `phone` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account_2` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `tax_identification` varchar(64) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `supplier`
--

INSERT INTO `supplier` (`id`, `created`, `modified`, `owner`, `name`, `description`, `city`, `province`, `country`, `post_code`, `email`, `phone`, `bank_account`, `bank_account_2`, `tax_identification`) VALUES
(1, '2017-01-20 15:08:51', '2017-01-23 20:12:16', 1, 'GUANGDONG SITONG GROUP CO.,LTD', 'SITONG=BBRIAN', 'B11-41 SOUTH AREA CHAO ZHOU RAILWAY', 'STATION DEVELOPING AREA GUANGDONG', 'CHINA', '', '', '0086-1382-7341-981', '', '', ''),
(2, '2017-01-24 10:38:22', '2017-01-23 20:39:39', 1, 'SHENZHEN JIAYUHE IMP.& EXP. CO.,LTD', 'FENNY', 'RM709 WENJINDU EXPORT CUSTOMS', 'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN', 'CHINA', '', '', '0086-768-6933518', '', '', ''),
(3, '2017-01-24 10:43:36', '2017-01-23 20:43:36', 2, 'SHUNDE ELITE IMPORT AND EXPORT CO.,LTD.', 'ANDY', 'NO.5047 ROAD', 'SHENNAN DONG SHENZHEN', 'CHINA', '', '', '0086-13760918639', '', '', ''),
(4, '2017-01-24 10:49:42', '2017-01-23 20:52:15', 2, 'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.', 'ALEX', '18F GREEN CITY TRADING SQUARE', 'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU', 'CHINA', '', 'alex@chinashowerroom.com', '0086-571-22877912', '', '', ''),
(5, '2017-01-24 10:50:29', '2017-01-23 20:50:29', 2, 'HANGZHOU SUNLIGHT TRADE CO.,LTD.', 'ALLAN', '503/4# KAIYUANMINGDU XIAOSHAN', 'HANGZHOU ZHEJIANG', 'CHINA', '', '', '0086-138-68002641', '', '', ''),
(6, '2017-01-24 11:00:05', '2017-01-24 21:55:48', 1, 'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.', 'SUNLIGHT=AARON', 'INDUSTRY AREA DANGSHAN HANGZHOU', 'ZHEJIANG', 'CHINA', '311245', 'master@zjsunlight.com, sales@zjsunlight.com', '0086-571-82531666', '', '', ''),
(7, '2017-01-24 11:24:18', '2017-01-23 21:24:18', 2, 'GLOBAL WELSUN CO.,LTD.', 'SHOWER DOOR MASSAGE BATHUB=FLOSSY', 'ROOM 951 9/F GUANGFA BLDG', 'DONGMEN SHOUTH ROAD, SHENZHEN', 'CHINA ', '', 'dandan-18@qq.com', '0086-133-92229204', '', '', ''),
(8, '2017-01-24 15:50:04', '2017-01-24 08:50:04', 2, 'HANGZHOU HUASHEN MIRROR INDUSTRY CO.,LTD.', 'MIRROR PROJECT : HELLER', 'NO.64 DANGKE ROAD DANGSHAN TOWN', 'XIAOSHAN DISTRICT HANGZHOU', 'CHINA', '', '', '0086-571-82523381', '', '', ''),
(9, '2017-01-24 16:08:10', '2017-01-24 09:08:10', 2, 'GUANGDONG XIONGFENG INDUSTRIES CO.,LTD.', 'SEAT COVER 1619 1673 1674', 'HUA AN SECOR ANJIE ROAD FENGTANG TOWN', 'CHAOZHOU CITY GUANGDONG', 'CHINA', '', 'www.xiongfeng.com', '0086-768-6850111', '', '', ''),
(10, '2017-01-24 16:09:40', '2017-01-24 09:09:40', 2, 'ANSON INDUSTRIAL (CHAOZHOU) CO.,LIMITED', 'SANITARY WARE ANBI', 'GUXIANG INDUSTRIAL ZHONE', 'CHAOZHOU GUANGDONG PROVINCE', 'CHINA', '', '', '0086-768-2890601', '', '', ''),
(11, '2017-01-24 16:11:02', '2017-01-24 09:12:06', 2, 'PRIME-VINH PHUC JOINT STOCK COMPANY', 'TILES VIETNAM : TAMNT', '', '', 'VIETNAM', '', '', '0084-2113888987', '', '', ''),
(12, '2017-01-24 16:12:46', '2017-01-24 09:12:46', 2, 'PRIME-DAI VIET JOINT STOCK COMPANY', 'TILES VIETNAM : TAMNT', '', '', 'VIETNAM', '', '', '0084-2113888987', '', '', ''),
(13, '2017-01-24 16:17:50', '2017-01-24 09:17:50', 2, 'VIGLACERA HANOI JOINT STOCK COMPANY', 'TILES LOW COST', '', '', 'VIETNAM', '', '', '', '', '', ''),
(14, '2017-01-24 16:20:23', '2017-01-24 09:20:23', 2, 'ONDULINE.S.A. (MALAYSIA)', 'ONDULINE : CHAOVALIT', '35 RUE BAUDIN', 'LEVALLOIS-PERRET', 'FRANCE', '', '', '081-8221848', '', 'สั่งฝรั่งเศส แต่ผลิตจากมาเลเซีย', ''),
(15, '2017-01-24 16:23:00', '2017-01-24 09:23:00', 2, 'CHAOAN HUIQUAN CERAMIC CO.,LTD.', 'SANITARY WARE EMON1-2', '', '', 'CHINA', '', '', '0086-768-6933518', '', '', ''),
(16, '2017-01-24 16:23:43', '2017-01-24 09:23:43', 2, 'CHAOZHOU MEITAO CERAMICS CO.,LTD.', 'MEITAO SANITARYWARE', '', '', 'CHINA', '', '', '0086-013-433788155', '', '', ''),
(17, '2017-01-24 16:29:22', '2017-01-24 09:29:22', 2, 'GUANGZHOU WEISHIBAO DOORS CO.,LTD.', 'FACTORY BATHWOOD', '', '', 'CHINA', '', '', '0086-138-26157838', '', '', ''),
(18, '2017-01-24 16:30:29', '2017-01-24 09:30:29', 2, 'CHAOAN GUXIANG MANJIE CERAMICS FACTORY', 'FACTORY LETOP', '', '', 'CHINA', '', '', '0086-768-6837092', '', '', ''),
(19, '2017-01-24 16:31:14', '2017-01-24 21:55:54', 1, 'GAOMING BIJIE SANITARY WARE CO.,LTD.', 'FACTORY TIANYA', '', '', 'CHINA', '', '', '0086-136-30146193', '', '', ''),
(20, '2017-01-24 16:31:43', '2017-01-24 09:31:43', 2, 'JIALONG SANITARY WARE CO.,LTD.', 'FACTORY JIALONG', '', '', 'CHINA', '', '', '0086-768-6926158', '', '', ''),
(21, '2017-01-25 13:31:08', '2017-01-25 06:31:08', 2, 'GUANGDONG WINNERWAY HOLDINGS CORP.', 'FACTORY CLASSIC WASH BASIN', '', '', 'CHINA', '', '', '', '', '', ''),
(22, '2017-01-25 13:32:00', '2017-01-25 06:32:00', 2, 'CHAOZHOU BOMEI CERAMICS CO.,LTD.', 'TWO PIECE LOW COST', '', '', 'CHINA', '', '', '', '', '', ''),
(23, '2017-01-25 15:08:35', '2017-01-25 08:08:35', 2, 'FOSHAN CITY JINHUALI HOUSEHOLD ELECTRICAL APPLIANCE CO.,LTD.', 'COOKING RANGE : ANGELA', '6 JIANGYI RD JIANG YI INDUSTRIAL PARK', 'LE LIU TOWN SHUNDE FOSHAN GUANGDONG', 'CHINA', '', '', '0086-0757-25523788', '', '', ''),
(24, '2017-01-25 15:15:14', '2017-01-25 08:15:14', 2, 'MEITU INTERNATIONAL TRADING LIMITED', 'MEITU SPART PART SANITARY WARE', '', '', 'CHINA', '', '', '', '', '', ''),
(25, '2017-01-25 15:28:28', '2017-01-25 08:28:28', 2, 'FOSHAN YANGGUANG CERAMICS CO.,LTD.', 'POLISHED TILES ', 'BAINI TOWN, BAIJIN ROAD, SANSHUI DISTRICT, FOSHAN CITY', 'GUANGDONG PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(26, '2017-01-25 15:30:07', '2017-01-25 08:30:07', 2, 'JIANGMEN XINHUI XINGWEI CERAMICS CO.,LTD.', 'RUSTIC TILES', 'FENJIANG ROAD, HUICHENG TOWN, XINHUI DISTRICT, JIANGMEN CITY', 'GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(27, '2017-01-25 15:31:18', '2017-01-25 08:31:18', 2, 'FOSHAN XIANGYU CERAMICS CO.,LTD.', 'POLISHED TILES ', 'HEFENG INDUSTRIAL DEVELOPMENT ZONE NANZHUANG TOWN', 'CHANCHENG DISTRICT, FOSHAN CITY GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(28, '2017-01-25 15:32:27', '2017-01-25 08:32:27', 2, 'CHAOAN MINGJIE CERAMICS CO.,LTD.', 'DAVID', 'XIAZAOQI XIHE VILLAGE FENGTANG TOWN CHAOAN COUNTY', 'CHAOZHOU CITY GUANGDONG PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(29, '2017-01-25 15:35:41', '2017-01-25 08:35:41', 2, 'GUANGDONG HENGSHENGJIA CERAMICS CO.,LTD.', 'DAVID', 'SOUTH WUZHIQU FENGTANG TOWN CHAOAN COUNTY', 'GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(30, '2017-01-25 15:37:48', '2017-01-25 08:37:48', 2, 'GUANGDONG XIANGHUA DONGLONG PORCELAIN INDUSTRIAL CO.,LTD.', 'DAVID', 'DACHE WEIPIAN DONGLONG VILLAGE FENGTANG TOWN CHAOAN COUNTY', 'CHAOZHOU CITY GUANGDONG PEOPLE S REPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', ''),
(31, '2017-01-25 15:40:46', '2017-01-25 08:40:46', 2, 'CHAOAN JIESHA CERAMIC INDUSTRY CO.,LTD.', 'DAVID', 'SHAKUPIAN PANYANG VILLAGE FENGTANG TOWN CHAOAN COUNTY', 'CHAOZHOU CITY GUANGDONG PROVINCE PEOPLE S RPUBLIC OF CHINA', 'CHINA', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `supplier_link_trader`
--

CREATE TABLE `supplier_link_trader` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `supplier_id` int(4) NOT NULL,
  `trader_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `supplier_link_trader`
--

INSERT INTO `supplier_link_trader` (`id`, `created`, `modified`, `owner`, `supplier_id`, `trader_id`) VALUES
(1, '2017-01-24 16:14:17', '2017-01-24 09:14:17', 2, 11, 13),
(2, '2017-01-24 16:16:57', '2017-01-24 09:16:57', 2, 12, 13),
(3, '2017-01-24 16:18:58', '2017-01-24 09:18:58', 2, 13, 14),
(4, '2017-01-25 15:11:17', '2017-01-25 08:11:17', 2, 15, 1),
(5, '2017-01-25 15:12:00', '2017-01-25 08:12:00', 2, 16, 2),
(6, '2017-01-25 15:12:27', '2017-01-25 08:12:27', 2, 17, 4),
(7, '2017-01-25 15:12:44', '2017-01-25 08:12:44', 2, 18, 6),
(8, '2017-01-25 15:12:59', '2017-01-25 08:12:59', 2, 19, 7),
(9, '2017-01-25 15:13:14', '2017-01-25 08:13:14', 2, 20, 8),
(10, '2017-01-25 15:13:30', '2017-01-25 08:13:30', 2, 21, 9),
(11, '2017-01-25 15:13:42', '2017-01-25 08:13:42', 2, 22, 10),
(12, '2017-01-25 15:13:56', '2017-01-25 08:13:56', 2, 23, 11),
(13, '2017-01-25 15:15:25', '2017-01-25 08:15:25', 2, 24, 12),
(14, '2017-01-25 15:41:47', '2017-01-25 08:41:47', 2, 25, 3),
(15, '2017-01-25 15:42:01', '2017-01-25 08:42:01', 2, 26, 5),
(16, '2017-01-25 15:42:15', '2017-01-25 08:42:15', 2, 27, 5),
(17, '2017-01-25 15:42:24', '2017-01-25 08:42:24', 2, 28, 3),
(18, '2017-01-25 15:42:33', '2017-01-25 08:42:33', 2, 29, 3),
(19, '2017-01-25 15:42:41', '2017-01-25 08:42:41', 2, 30, 3),
(20, '2017-01-25 15:42:51', '2017-01-25 08:42:51', 2, 31, 3);

-- --------------------------------------------------------

--
-- Table structure for table `task`
--

CREATE TABLE `task` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `task_parent_id` int(4) NOT NULL,
  `task_action_type_id` int(4) NOT NULL,
  `task_status_id` int(4) NOT NULL,
  `job_id` int(4) NOT NULL,
  `amphur_id` int(4) UNSIGNED NOT NULL,
  `province_id` int(4) UNSIGNED NOT NULL,
  `country` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `task_open` date NOT NULL,
  `task_close` date NOT NULL,
  `error_msg_thai` varchar(120) COLLATE utf8_unicode_ci NOT NULL,
  `error_msg_english` varchar(120) COLLATE utf8_unicode_ci NOT NULL,
  `success_msg_thai` varchar(120) COLLATE utf8_unicode_ci NOT NULL,
  `success_msg_english` varchar(120) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task`
--

INSERT INTO `task` (`id`, `created`, `modified`, `owner`, `task_parent_id`, `task_action_type_id`, `task_status_id`, `job_id`, `amphur_id`, `province_id`, `country`, `name`, `description`, `task_open`, `task_close`, `error_msg_thai`, `error_msg_english`, `success_msg_thai`, `success_msg_english`) VALUES
(1, '2017-01-15 11:18:20', '2017-01-15 06:02:14', 1, 1, 1, 1, 1, 843, 7, 'ไทย', 'root', 'root', '2017-01-15', '2018-01-15', '', '', '', ''),
(2, '2017-01-15 11:18:20', '2017-01-15 07:00:08', 1, 1, 1, 1, 2, 843, 7, 'ไทย', 'บันทึกใบ PO', 'ิบันทึกใบPO ผ่านทางระบบ bathline uno ', '2017-01-15', '2018-01-15', '', '', '', ''),
(3, '2017-01-15 13:11:41', '2017-01-15 07:11:49', 7777, 6, 3, 1, 8, 843, 7, 'ไทย', 'ยื่นขออนุมัติวงเงิน ใบสั่งซื้อ', 'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ', '2017-01-15', '2018-01-15', '', '', '', ''),
(4, '2017-01-15 13:17:01', '2017-01-15 07:05:21', 7777, 6, 4, 1, 8, 843, 7, 'ไทย', 'อนุมัติวงเงิน ใบสั่งซื้อแบบ อัตโนมัติ', 'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน', '2017-01-15', '2018-01-15', '', '', '', ''),
(5, '2017-01-15 13:55:22', '2017-01-15 06:55:55', 7777, 3, 4, 1, 10, 843, 7, 'ไทย', 'อนุมัติวงเงิน ใบสั่งซื้อ', 'อนุมัติวงเงิน เมื่อมีความสมเหตุสมผล', '2017-01-15', '2018-01-15', '', '', '', ''),
(6, '2017-01-15 14:02:48', '2017-01-15 07:02:48', 7777, 2, 4, 1, 2, 843, 7, 'ไทย', 'ตรวจสอบความถูกต้อง ใบสั่งซื้อ', 'ตรวจสอบความถูกต้อง ใบสั่งซื้อ', '2017-01-15', '2018-01-15', '', '', '', ''),
(7, '2017-01-15 14:03:41', '2017-01-15 07:03:41', 7777, 6, 2, 1, 2, 843, 7, 'ไทย', 'แก้ไขใบสั่งซื้อ', 'แก้ไขใบสั่งซื้อ', '2017-01-15', '2018-01-15', '', '', '', ''),
(8, '2017-01-15 14:42:26', '2017-01-15 07:42:26', 7777, 4, 2, 1, 2, 843, 7, 'ไทย', 'แบ่งส่ง', 'แบ่งส่ง', '2017-01-15', '2018-01-15', '', '', '', ''),
(9, '2017-01-15 14:48:43', '2017-01-15 07:48:43', 7777, 8, 4, 1, 4, 843, 7, 'ไทย', 'เช็คสินค้า กับ ใบสั่งซื้อ', 'เช็คสินค้า กับ ใบสั่งซื้อ', '2017-01-15', '2018-01-15', '', '', '', ''),
(10, '2017-01-15 14:59:50', '2017-01-15 07:59:50', 7777, 9, 1, 1, 7, 843, 7, 'ไทย', 'เริ่มการส่งสินค้า', 'เริ่มการส่งสินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(11, '2017-01-15 15:00:40', '2017-01-15 08:00:40', 7777, 9, 3, 1, 7, 843, 7, 'ไทย', 'ส่งเสร็จสิ้น', 'ส่งเสร็จสิ้น', '2017-01-15', '2018-01-15', '', '', '', ''),
(12, '2017-01-15 15:02:24', '2017-01-15 08:02:24', 7777, 11, 4, 1, 4, 843, 7, 'ไทย', 'ตรวจสอบสินค้าชำรุด', 'ตรวจสอบสินค้าชำรุด', '2017-01-15', '2018-01-15', '', '', '', ''),
(13, '2017-01-15 15:04:11', '2017-01-15 08:04:11', 7777, 12, 1, 1, 8, 843, 7, 'ไทย', 'บันทึกเงินเข้า', 'บันทึกเงินเข้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(14, '2017-01-15 15:05:00', '2017-01-15 08:05:00', 7777, 12, 1, 1, 8, 843, 7, 'ไทย', 'ลงรายละเอียดสินค้าชำรุด', 'ลงรายละเอียดสินค้าชำรุด', '2017-01-15', '2018-01-15', '', '', '', ''),
(15, '2017-01-19 01:52:08', '2017-01-18 18:52:08', 1, 2, 1, 1, 2, 843, 7, 'ไทย', 'บันทึกรายละเอียดสินค้า', 'บันทึกรายละเอียดสินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(16, '2017-01-19 19:35:32', '2017-01-19 12:39:15', 1, 1, 1, 1, 6, 843, 7, 'ไทย', 'เพิ่ม บุคลากร ', 'เพิ่มบุคลากร', '2017-01-15', '2018-01-15', '', '', '', ''),
(17, '2017-01-19 19:35:56', '2017-01-19 12:59:06', 1, 1, 2, 1, 6, 843, 7, 'ไทย', 'แก้ไข บุคลากร', 'แก้ไข บุคลากร', '2017-01-15', '2018-01-15', '', '', '', ''),
(18, '2017-01-19 19:36:22', '2017-01-24 04:59:19', 1, 1, 1, 1, 8, 843, 7, 'ไทย', 'เพิ่ม ลูกค้า', 'เพิ่ม ลูกค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(19, '2017-01-19 19:36:31', '2017-01-24 04:59:27', 1, 1, 2, 1, 8, 843, 7, 'ไทย', 'แก้ไข ลูกค้า', 'แก้ไข ลูกค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(20, '2017-01-19 19:37:18', '2017-01-19 20:06:35', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม โรงงานผลิต', 'เพิ่ม โรงงานผลิต', '2017-01-15', '2018-01-15', '', '', '', ''),
(21, '2017-01-19 19:37:25', '2017-01-19 20:06:43', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข โรงงานผลิต', 'แก้ไข โรงงานผลิต', '2017-01-15', '2018-01-15', '', '', '', ''),
(22, '2017-01-19 19:37:58', '2017-01-19 12:37:58', 1, 1, 2, 1, 6, 843, 7, 'ไทย', 'แก้ไข ยานพาหนะ', 'แก้ไข ยานพาหนะ', '2017-01-15', '2018-01-15', '', '', '', ''),
(23, '2017-01-19 19:38:09', '2017-01-19 12:59:44', 1, 1, 1, 1, 6, 843, 7, 'ไทย', 'เพิ่ม ยานพาหนะ', 'เพิ่ม ยานพาหนะ', '2017-01-15', '2018-01-15', '', '', '', ''),
(24, '2017-01-20 02:35:23', '2017-01-19 19:35:23', 1, 1, 1, 1, 6, 843, 7, 'ไทย', 'เพิ่ม ตำแหน่งงาน', 'เพิ่ม ตำแหน่งงาน', '2017-01-15', '2018-01-15', '', '', '', ''),
(25, '2017-01-20 02:35:33', '2017-01-19 19:35:33', 1, 1, 2, 1, 6, 843, 7, 'ไทย', 'แก้ไข ตำแหน่งงาน', 'เพิ่ม ตำแหน่งงาน', '2017-01-15', '2018-01-15', '', '', '', ''),
(26, '2017-01-20 03:55:13', '2017-01-19 20:55:13', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม สินค้า', 'เพิ่ม สินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(27, '2017-01-20 03:55:18', '2017-01-24 03:43:10', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข สินค้า', 'เพิ่ม สินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(28, '2017-01-20 04:03:29', '2017-01-19 21:03:29', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม หมวดหมู่สินค้า', 'เพิ่ม หมวดหมู่สินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(29, '2017-01-20 04:03:39', '2017-01-19 21:03:39', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข หมวดหมู่สินค้า', 'แก้ไข หมวดหมู่สินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(30, '2017-01-23 19:43:08', '2017-01-25 20:00:59', 1, 1, 5, 1, 11, 1, 1, 'ไทย', 'ลงบันทึก สต็อค สินค้าคงเหลือ ประจำวัน', 'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน', '2017-01-15', '2018-01-15', '', '', '', ''),
(31, '2017-01-23 22:39:46', '2017-01-23 16:04:15', 1, 1, 1, 1, 12, 1, 1, 'ไทย', 'ระบุ ร้านค้า กับ พนักงาน PC', 'ระบุร้านค้า กับ พนักงาน PC', '2017-01-15', '2018-01-15', '', '', '', ''),
(32, '2017-01-23 23:03:46', '2017-01-23 16:03:46', 1, 1, 2, 1, 12, 843, 7, 'ไทย', 'แก้ไข ร้านค้า กับ พนักงาน PC', 'แก้ไข ร้านค้า กับ พนักงาน PC', '2017-01-15', '2018-01-15', '', '', '', ''),
(33, '2017-01-24 11:27:22', '2017-01-24 04:58:59', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม ผู้ประกอบการค้า', 'เพิ่ม ผู้ประกอบการค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(34, '2017-01-24 11:27:31', '2017-01-24 04:27:31', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข ผู้ประกอบการค้า', 'เพิ่ม ผู้ประกอบการค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(35, '2017-01-24 11:28:25', '2017-01-24 04:28:25', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เชื่อม ผู้ประกอบการค้า กับ โรงงาน', 'เชื่อม ผู้ประกอบการค้า กับ โรงงาน', '2017-01-15', '2018-01-15', '', '', '', ''),
(36, '2017-01-24 11:28:33', '2017-01-24 04:28:33', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข ผู้ประกอบการค้า กับ โรงงาน', 'เชื่อม ผู้ประกอบการค้า กับ โรงงาน', '2017-01-15', '2018-01-15', '', '', '', ''),
(37, '2017-01-26 03:04:48', '2017-01-25 20:07:27', 1, 1, 6, 1, 11, 843, 7, 'ไทย', 'ประวัติ การบันทึก ย้อนหลัง 7 วัน', 'ประวัติ การบันทึก ย้อนหลัง 7 วัน', '2017-01-15', '2018-01-15', '', '', '', ''),
(38, '2017-01-27 01:50:58', '2017-01-26 18:53:00', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม หมวดหมู่ ลักษณะ ', 'เพิ่ม หมวดหมู่ ลักษณะ ', '2017-01-15', '2018-01-15', '', '', '', ''),
(39, '2017-01-27 01:51:13', '2017-01-26 18:53:13', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข หมวดหมู่ ลักษณะ ', 'แก้ไข หมวดหมู่ ลักษณะ ', '2017-01-15', '2018-01-15', '', '', '', ''),
(40, '2017-01-27 01:51:35', '2017-01-26 18:51:35', 1, 1, 1, 1, 3, 843, 7, 'ไทย', 'เพิ่ม ลักษณะ ตัวเลือก', 'เพิ่ม ลักษณะ ตัวเลือก', '2017-01-15', '2018-01-15', '', '', '', ''),
(41, '2017-01-27 01:51:44', '2017-01-26 18:51:44', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข ลักษณะ ตัวเลือก', 'แก้ไข ลักษณะ ตัวเลือก', '2017-01-15', '2018-01-15', '', '', '', ''),
(42, '2017-01-27 01:52:33', '2017-01-26 18:57:39', 1, 1, 5, 1, 3, 843, 7, 'ไทย', 'เพิ่ม ลักษณะ สินค้า', 'เพิ่ม ลักษณะ สินค้า', '2017-01-15', '2018-01-15', '', '', '', ''),
(43, '2017-01-27 01:52:42', '2017-01-26 18:52:42', 1, 1, 2, 1, 3, 843, 7, 'ไทย', 'แก้ไข ลักษณะ สินค้า', 'แก้ไข ลักษณะ สินค้า', '2017-01-15', '2018-01-15', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `task_action_type`
--

CREATE TABLE `task_action_type` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task_action_type`
--

INSERT INTO `task_action_type` (`id`, `created`, `modified`, `owner`, `name`, `description`) VALUES
(1, '2017-01-15 11:12:21', '2017-01-15 04:12:21', 1, 'INSERT', 'ป้อนข้อมูล'),
(2, '2017-01-15 12:45:47', '2017-01-15 05:45:47', 1, 'EDIT', 'แก้ไขข้อมูล'),
(3, '2017-01-15 13:12:23', '2017-01-15 06:12:50', 7777, 'PENDING_APPROVAL', 'ยื่นอนุมัติ'),
(4, '2017-01-15 13:12:38', '2017-01-15 06:12:38', 7777, 'APPROVAL', 'อนุมัติ'),
(5, '2017-01-24 00:05:07', '2017-01-25 15:43:19', 1, 'INSERT_MULTIPLE', 'INSERT_MULTIPLE'),
(6, '2017-01-26 03:07:19', '2017-01-25 20:07:19', 1, 'EDIT_CREDENTIAL_TIME', '');

-- --------------------------------------------------------

--
-- Table structure for table `task_db_log`
--

CREATE TABLE `task_db_log` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `task_id` int(4) NOT NULL,
  `db_reference_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task_db_log`
--

INSERT INTO `task_db_log` (`id`, `created`, `modified`, `owner`, `task_id`, `db_reference_id`) VALUES
(1, '2017-01-17 14:28:27', '2017-01-18 19:39:43', 1, 6, 4),
(5, '2017-01-17 16:20:34', '2017-01-17 09:20:34', 1, 12, 4),
(6, '2017-01-19 01:52:25', '2017-01-18 18:52:25', 1, 15, 2),
(7, '2017-01-19 01:56:20', '2017-01-18 19:39:56', 1, 2, 4),
(8, '2017-01-19 02:09:58', '2017-01-18 19:48:22', 1, 7, 4),
(9, '2017-01-19 02:42:20', '2017-01-18 19:42:20', 1, 13, 1),
(10, '2017-01-19 19:38:48', '2017-01-19 12:38:48', 1, 18, 1),
(11, '2017-01-19 20:11:49', '2017-01-19 13:11:49', 1, 16, 7),
(12, '2017-01-19 20:11:53', '2017-01-19 13:11:53', 1, 17, 7),
(13, '2017-01-19 20:11:58', '2017-01-19 13:11:58', 1, 19, 1),
(14, '2017-01-19 20:12:38', '2017-01-19 13:12:38', 1, 20, 10),
(15, '2017-01-19 20:12:42', '2017-01-19 13:12:42', 1, 21, 10),
(16, '2017-01-19 20:12:47', '2017-01-19 13:12:47', 1, 23, 6),
(17, '2017-01-19 20:12:52', '2017-01-19 13:12:52', 1, 22, 6),
(18, '2017-01-20 02:35:46', '2017-01-19 19:35:46', 1, 24, 9),
(19, '2017-01-20 02:35:49', '2017-01-19 19:35:49', 1, 25, 9),
(20, '2017-01-20 03:56:52', '2017-01-19 20:56:52', 1, 26, 11),
(21, '2017-01-20 03:56:55', '2017-01-19 20:56:55', 1, 27, 11),
(22, '2017-01-20 04:05:01', '2017-01-23 15:58:45', 1, 28, 13),
(23, '2017-01-20 04:05:05', '2017-01-23 15:58:50', 1, 29, 13),
(24, '2017-01-23 22:59:32', '2017-01-23 15:59:32', 1, 31, 12),
(25, '2017-01-23 23:02:31', '2017-01-23 16:02:31', 1, 30, 14),
(26, '2017-01-23 23:05:13', '2017-01-23 16:05:13', 1, 32, 12),
(27, '2017-01-24 11:31:24', '2017-01-24 04:31:24', 1, 33, 16),
(28, '2017-01-24 11:31:28', '2017-01-24 04:31:28', 1, 34, 16),
(29, '2017-01-24 11:31:34', '2017-01-24 04:31:34', 1, 35, 15),
(30, '2017-01-24 11:31:38', '2017-01-24 04:31:38', 1, 36, 15),
(31, '2017-01-26 03:19:24', '2017-01-25 20:19:24', 1, 37, 14),
(32, '2017-01-27 01:55:43', '2017-01-26 18:55:43', 1, 38, 17),
(33, '2017-01-27 01:55:47', '2017-01-26 18:55:47', 1, 39, 17),
(34, '2017-01-27 01:55:53', '2017-01-26 18:55:53', 1, 40, 18),
(35, '2017-01-27 01:55:57', '2017-01-26 18:55:57', 1, 41, 18),
(36, '2017-01-27 01:56:02', '2017-01-26 18:56:02', 1, 42, 19),
(37, '2017-01-27 01:56:06', '2017-01-26 18:56:06', 1, 43, 19);

-- --------------------------------------------------------

--
-- Table structure for table `task_log`
--

CREATE TABLE `task_log` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `record_name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `record_document` int(8) NOT NULL,
  `task_id` int(8) NOT NULL,
  `task_action_type` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `query` text COLLATE utf8_unicode_ci NOT NULL,
  `task_log_status_id` int(4) NOT NULL,
  `task_msg` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task_log`
--

INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(1, '2017-01-15 11:03:49', '2017-01-15 04:03:49', 7777, 'view_permission_type', 2, 1, 'INSERT', 'INSERT INTO view_permission_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'INSERT\',\'ป้อนข้อมูล\')', 1, 'successfully'),
(2, '2017-01-15 11:04:07', '2017-01-15 04:04:07', 7777, 'view_permission_type', 3, 1, 'INSERT', 'INSERT INTO view_permission_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'EDIT\',\'แก้ไขข้อมูล\')', 1, 'successfully'),
(3, '2017-01-15 11:12:21', '2017-01-15 04:12:21', 7777, 'task_action_type', 2, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'INSERT\',\'ป้อนข้อมูล\')', 1, 'successfully'),
(4, '2017-01-15 11:13:34', '2017-01-15 04:13:34', 7777, 'task_status', 2, 1, 'INSERT', 'INSERT INTO task_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ACTIVE\',\'สถานะเปิด\')', 1, 'successfully'),
(5, '2017-01-15 11:14:55', '2017-01-15 04:14:55', 7777, 'task_status', 3, 1, 'INSERT', 'INSERT INTO task_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'DEACTIVATE\',\'สถานะปิด\')', 1, 'successfully'),
(6, '2017-01-15 11:15:08', '2017-01-15 04:15:08', 7777, 'task_status', 1, 1, 'UPDATE', 'UPDATE task_status SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ACTIVATE\',description=\'สถานะเปิด\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ACTIVATE\' OR description != \'สถานะเปิด\' )', 1, 'successfully'),
(7, '2017-01-15 11:18:20', '2017-01-15 04:18:20', 7777, 'task', 2, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,843,7,\'ไทย\',\'เพิ่มใบPO\',\'เพิ่มใบPO\',\'2017-01-15\',\'2017-02-15\',\'ไม่สามารถเพิ่มได้\',\'the data type is invalid\',\'เพิ่มสำเร็จ\',\'insert PO Order sucessfully\')', 1, 'successfully'),
(8, '2017-01-15 11:22:33', '2017-01-15 04:22:33', 7777, 'task', 1, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ใบPO\',description=\'ใบPO\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ใบPO\' OR description != \'ใบPO\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(9, '2017-01-15 11:26:29', '2017-01-15 04:26:29', 7777, 'action_permission', 2, 1, 'INSERT', 'INSERT INTO action_permission (id,created,modified,owner,action_permission_type_id,action_permission_parent_id,task_id,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,\'เพิ่ม\',\'เพิ่มใบPO \')', 1, 'successfully'),
(10, '2017-01-15 11:35:32', '2017-01-15 04:35:32', 7777, 'job', 2, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,task_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,\'แผนกขาย\',\'Sales Department\',\'ขายของตั้งแต่การรับอ้อเด้อลูกค้าจนไปถึงการดูแลลูกให้มีความพึงพอใจกับการบริการให้มากที่สุด\')', 1, 'successfully'),
(11, '2017-01-15 11:39:55', '2017-01-15 04:39:55', 7777, 'job_log_status', 2, 1, 'INSERT', 'INSERT INTO job_log_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'HIRE\',\'รับหน้าที่\')', 1, 'successfully'),
(12, '2017-01-15 11:40:40', '2017-01-15 04:40:40', 7777, 'job_log_status', 3, 1, 'INSERT', 'INSERT INTO job_log_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'FIRE\',\'ไล่ออก\')', 1, 'successfully'),
(13, '2017-01-15 11:40:49', '2017-01-15 04:40:49', 7777, 'job_log_status', 4, 1, 'INSERT', 'INSERT INTO job_log_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ลาออก\',\'ลาออก\')', 1, 'successfully'),
(14, '2017-01-15 11:41:24', '2017-01-15 04:41:24', 7777, 'job_log_status', 5, 1, 'INSERT', 'INSERT INTO job_log_status (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'DETENTION\',\'พักงาน\')', 1, 'successfully'),
(15, '2017-01-15 11:43:00', '2017-01-15 04:43:00', 7777, 'job_log_status', 3, 1, 'UPDATE', 'UPDATE job_log_status SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'RESIGN\',description=\'ลาออก\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'RESIGN\' OR description != \'ลาออก\' )', 1, 'successfully'),
(16, '2017-01-15 11:46:49', '2017-01-15 04:46:49', 7777, 'employee', 2, 1, 'INSERT', 'INSERT INTO employee (id,created,modified,owner,firstname_thai,lastname_thai,firstname_english,lastname_english,phone,email,salary,address,amphur_id,province_id,advance_task,advance_view,start_date,join_date,national_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'สิรภพ\',\'ศิริศิลป์\',\'Siraphop\',\'Sirisilp\',\'0802689444\',\'seawaykung@gmail.com\',10000,\'52 ปรางค์สามยอด\',843,7,\'\',\'\',\'2017-01-15\',\'2017-01-15\',\'1101402029290\')', 1, 'successfully'),
(17, '2017-01-15 12:41:20', '2017-01-15 05:41:20', 7777, 'task', 1, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=1,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ใบPO\',description=\'ใบPO\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 1 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ใบPO\' OR description != \'ใบPO\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(18, '2017-01-15 12:45:47', '2017-01-15 05:45:47', 7777, 'task_action_type', 3, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'EDIT\',\'แก้ไขข้อมูล\')', 1, 'successfully'),
(19, '2017-01-15 13:02:14', '2017-01-15 06:02:14', 7777, 'task', 1, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=1,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'root\',description=\'root\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 1 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'root\' OR description != \'root\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(20, '2017-01-15 13:11:41', '2017-01-15 06:11:41', 7777, 'task', 4, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,2,1,1,2,843,7,\'ไทย\',\'อนุมัติวงเงิน\',\'อนุมัติวงเงิน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(21, '2017-01-15 13:12:23', '2017-01-15 06:12:23', 7777, 'task_action_type', 4, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,\'PENDING_APPROVAL\',\'ิอนุมัติ\')', 1, 'successfully'),
(22, '2017-01-15 13:12:38', '2017-01-15 06:12:38', 7777, 'task_action_type', 5, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,\'APPROVAL\',\'อนุมัติ\')', 1, 'successfully'),
(23, '2017-01-15 13:12:50', '2017-01-15 06:12:50', 7777, 'task_action_type', 3, 1, 'UPDATE', 'UPDATE task_action_type SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,name=\'PENDING_APPROVAL\',description=\'ยื่นอนุมัติ\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR name != \'PENDING_APPROVAL\' OR description != \'ยื่นอนุมัติ\' )', 1, 'successfully'),
(24, '2017-01-15 13:14:35', '2017-01-15 06:14:35', 7777, 'task', 3, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=2,task_action_type_id=3,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ยื่นอนุมัติวงเงิน\',description=\'ยื่นอนุมัติวงเงิน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 2 OR task_action_type_id != 3 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ยื่นอนุมัติวงเงิน\' OR description != \'ยื่นอนุมัติวงเงิน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(25, '2017-01-15 13:17:01', '2017-01-15 06:17:01', 7777, 'task', 5, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,2,4,1,2,843,7,\'ไทย\',\'อนุมัติวงเงิน อัตโนมัติ\',\'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(26, '2017-01-15 13:20:37', '2017-01-15 06:20:37', 7777, 'job', 4, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกจัดซื้อ\',\' Purchasing Department\',\'สามารถสั่งซื้อสินค้ามาได้ตรงตามเวลา และมีประสิทธิภาพในการควบคุมสินค้า ที่สั่งซื้อมา\')', 1, 'successfully'),
(27, '2017-01-15 13:21:04', '2017-01-15 06:21:04', 7777, 'job', 2, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=1,name=\'แผนกขาย\',name_english=\'Sales Department\',description=\'ดูแลตั้งแต่การรับอ้อเด้อลูกค้าจนไปถึงการดูแลลูกใ...\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 1 OR name != \'แผนกขาย\' OR name_english != \'Sales Department\' OR description != \'ดูแลตั้งแต่การรับอ้อเด้อลูกค้าจนไปถึงการดูแลลูกใ...\' )', 1, 'successfully'),
(28, '2017-01-15 13:24:30', '2017-01-15 06:24:30', 7777, 'job', 5, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกคลังสินค้า\',\'Warehouse Department\',\'ดูแล รักษาสภาพโกดังเก็บของ และสินค้านั้นๆ มีการดูแลตรวจสภาพสินค้า และจำนวนสินค้า สามารถบ่งชี้ปัญหาของขาดและเกินสต็อค มีความรักและห่วงใยในการทำงาน\')', 1, 'successfully'),
(29, '2017-01-15 13:29:36', '2017-01-15 06:29:36', 7777, 'job', 6, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกการตลาด\',\'Marketing Department\',\'ออกสำรวจตลาด เพื่อ เพิ่มช่องทาง ในการขาย ขยายภาพลักษณ์ของบริษัท เข้าใจและรับรู้วสิ่งที่ผู้บริโภคนั้นต้องการ  ใส่ใจทุกรายละเอียดของลูกค้าในเชิงความรู้สึก\')', 1, 'successfully'),
(30, '2017-01-15 13:35:17', '2017-01-15 06:35:17', 7777, 'job', 7, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกบุคคล\',\'็Human Resource Manager\',\'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\')', 1, 'successfully'),
(31, '2017-01-15 13:37:38', '2017-01-15 06:37:38', 7777, 'job', 8, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกจัดส่ง\',\'Shipping Department\',\'ส่งปลอดภัย ตรงเวลา และ แน่วแน่ หมั่นดูแลเอาใจใส่ยานพาหนะ และ พักผ่อนอย่างเพียงพอ\')', 1, 'successfully'),
(32, '2017-01-15 13:41:12', '2017-01-15 06:41:12', 7777, 'job', 9, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'แผนกบัญชีการเงิน\',\' Financial Accountant\',\'ตรวจสอบความเป็นมาของเงิน และบันทึก ได้อย่างมีประสิทธิภาพ สามารถทำรายงาน วิเคราะห์ เชิงลึก เพื่อเป็นแนวทางและข้อมูลให้แก่ผู้บริหารได้ รับผิดชอบและซื่อสัตย์\')', 1, 'successfully'),
(33, '2017-01-15 13:43:30', '2017-01-15 06:43:30', 7777, 'task', 3, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=2,task_action_type_id=3,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ยื่นอนุมัติวงเงิน\',description=\'ยื่นอนุมัติวงเงิน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 2 OR task_action_type_id != 3 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ยื่นอนุมัติวงเงิน\' OR description != \'ยื่นอนุมัติวงเงิน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(34, '2017-01-15 13:43:42', '2017-01-15 06:43:42', 7777, 'task', 4, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=2,task_action_type_id=4,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'อนุมัติวงเงิน อัตโนมัติ\',description=\'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 2 OR task_action_type_id != 4 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'อนุมัติวงเงิน อัตโนมัติ\' OR description != \'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(35, '2017-01-15 13:44:01', '2017-01-15 06:44:01', 7777, 'task', 2, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ใบPO\',description=\'ใบPO\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ใบPO\' OR description != \'ใบPO\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(36, '2017-01-15 13:46:35', '2017-01-15 06:46:35', 7777, 'job', 10, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,1,\'ประธานกรรมการบริหาร \',\'Chief Executive Officer\',\'\')', 1, 'successfully'),
(37, '2017-01-15 13:49:46', '2017-01-15 06:49:46', 7777, 'job', 11, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,9,\' ประธานเจ้าหน้าที่บริหาร\',\'Chief Executive Officer\',\'\')', 1, 'successfully'),
(38, '2017-01-15 13:50:10', '2017-01-15 06:50:10', 7777, 'job', 6, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=10,name=\'แผนกบุคคล\',name_english=\'็Human Resource Manager\',description=\'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 10 OR name != \'แผนกบุคคล\' OR name_english != \'็Human Resource Manager\' OR description != \'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' )', 1, 'successfully'),
(39, '2017-01-15 13:50:20', '2017-01-15 06:50:20', 7777, 'job', 3, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=6,name=\'แผนกจัดซื้อ\',name_english=\' Purchasing Department\',description=\'สามารถสั่งซื้อสินค้ามาได้ตรงตามเวลา และมีประสิทธิภาพในการควบคุมสินค้า ที่สั่งซื้อมา\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 6 OR name != \'แผนกจัดซื้อ\' OR name_english != \' Purchasing Department\' OR description != \'สามารถสั่งซื้อสินค้ามาได้ตรงตามเวลา และมีประสิทธิภาพในการควบคุมสินค้า ที่สั่งซื้อมา\' )', 1, 'successfully'),
(40, '2017-01-15 13:50:33', '2017-01-15 06:50:33', 7777, 'job', 2, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=6,name=\'แผนกขาย\',name_english=\'Sales Department\',description=\'เพิ่มยอดขาย สร้างรายได้ให้แก่บริษัท เอาใจใส่ลูกค้า และบริการ ในยามคับขัน \' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 6 OR name != \'แผนกขาย\' OR name_english != \'Sales Department\' OR description != \'เพิ่มยอดขาย สร้างรายได้ให้แก่บริษัท เอาใจใส่ลูกค้า และบริการ ในยามคับขัน \' )', 1, 'successfully'),
(41, '2017-01-15 13:50:44', '2017-01-15 06:50:44', 7777, 'job', 4, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=6,name=\'แผนกคลังสินค้า\',name_english=\'Warehouse Department\',description=\'ดูแล รักษาสภาพโกดังเก็บของ และสินค้านั้นๆ มีการดูแลตรวจสภาพสินค้า และจำนวนสินค้า สามารถบ่งชี้ปัญหาของขาดและเกินสต็อค มีความรักและห่วงใยในการทำงาน\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 6 OR name != \'แผนกคลังสินค้า\' OR name_english != \'Warehouse Department\' OR description != \'ดูแล รักษาสภาพโกดังเก็บของ และสินค้านั้นๆ มีการดูแลตรวจสภาพสินค้า และจำนวนสินค้า สามารถบ่งชี้ปัญหาของขาดและเกินสต็อค มีความรักและห่วงใยในการทำงาน\' )', 1, 'successfully'),
(42, '2017-01-15 13:50:53', '2017-01-15 06:50:53', 7777, 'job', 5, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=6,name=\'แผนกการตลาด\',name_english=\'Marketing Department\',description=\'ออกสำรวจตลาด เพื่อ เพิ่มช่องทาง ในการขาย ขยายภาพลักษณ์ของบริษัท เข้าใจและรับรู้วสิ่งที่ผู้บริโภคนั้นต้องการ  ใส่ใจทุกรายละเอียดของลูกค้าในเชิงความรู้สึก\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 6 OR name != \'แผนกการตลาด\' OR name_english != \'Marketing Department\' OR description != \'ออกสำรวจตลาด เพื่อ เพิ่มช่องทาง ในการขาย ขยายภาพลักษณ์ของบริษัท เข้าใจและรับรู้วสิ่งที่ผู้บริโภคนั้นต้องการ  ใส่ใจทุกรายละเอียดของลูกค้าในเชิงความรู้สึก\' )', 1, 'successfully'),
(43, '2017-01-15 13:51:08', '2017-01-15 06:51:08', 7777, 'job', 7, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=6,name=\'แผนกจัดส่ง\',name_english=\'Shipping Department\',description=\'ส่งปลอดภัย ตรงเวลา และ แน่วแน่ หมั่นดูแลเอาใจใส่ยานพาหนะ และ พักผ่อนอย่างเพียงพอ\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 6 OR name != \'แผนกจัดส่ง\' OR name_english != \'Shipping Department\' OR description != \'ส่งปลอดภัย ตรงเวลา และ แน่วแน่ หมั่นดูแลเอาใจใส่ยานพาหนะ และ พักผ่อนอย่างเพียงพอ\' )', 1, 'successfully'),
(44, '2017-01-15 13:51:20', '2017-01-15 06:51:20', 7777, 'job', 8, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,job_parent_id=6,name=\'แผนกบัญชีการเงิน\',name_english=\' Financial Accountant\',description=\'ตรวจสอบความเป็นมาของเงิน และบันทึก ได้อย่างมีประสิทธิภาพ สามารถทำรายงาน วิเคราะห์ เชิงลึก เพื่อเป็นแนวทางและข้อมูลให้แก่ผู้บริหารได้ รับผิดชอบและซื่อสัตย์\' WHERE id =8 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR job_parent_id != 6 OR name != \'แผนกบัญชีการเงิน\' OR name_english != \' Financial Accountant\' OR description != \'ตรวจสอบความเป็นมาของเงิน และบันทึก ได้อย่างมีประสิทธิภาพ สามารถทำรายงาน วิเคราะห์ เชิงลึก เพื่อเป็นแนวทางและข้อมูลให้แก่ผู้บริหารได้ รับผิดชอบและซื่อสัตย์\' )', 1, 'successfully'),
(45, '2017-01-15 13:55:22', '2017-01-15 06:55:22', 7777, 'task', 6, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,3,4,1,10,843,7,\'ไทย\',\'ยื่นอนุมัติวงเงิน\',\'อนุมัติวงเงิน เมื่อมีความสมเหตุสมผล\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(46, '2017-01-15 13:55:55', '2017-01-15 06:55:55', 7777, 'task', 5, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=3,task_action_type_id=4,task_status_id=1,job_id=10,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'อนุมัติวงเงิน ใบสั่งซื้อ\',description=\'อนุมัติวงเงิน เมื่อมีความสมเหตุสมผล\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 3 OR task_action_type_id != 4 OR task_status_id != 1 OR job_id != 10 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'อนุมัติวงเงิน ใบสั่งซื้อ\' OR description != \'อนุมัติวงเงิน เมื่อมีความสมเหตุสมผล\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(47, '2017-01-15 13:56:12', '2017-01-15 06:56:12', 7777, 'task', 4, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=2,task_action_type_id=4,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'อนุมัติวงเงิน ใบสั่งซื้อแบบ อัตโนมัติ\',description=\'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 2 OR task_action_type_id != 4 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'อนุมัติวงเงิน ใบสั่งซื้อแบบ อัตโนมัติ\' OR description != \'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(48, '2017-01-15 13:56:48', '2017-01-15 06:56:48', 7777, 'task', 3, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=2,task_action_type_id=3,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\',description=\'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 2 OR task_action_type_id != 3 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\' OR description != \'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(49, '2017-01-15 13:59:36', '2017-01-15 06:59:36', 7777, 'task', 2, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ิบันทึกใบPO\',description=\'ิบันทึกใบPO ผ่านทางระบบ bathline uno \',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ิบันทึกใบPO\' OR description != \'ิบันทึกใบPO ผ่านทางระบบ bathline uno \' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(50, '2017-01-15 14:00:08', '2017-01-15 07:00:08', 7777, 'task', 2, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'บันทึกใบ PO\',description=\'ิบันทึกใบPO ผ่านทางระบบ bathline uno \',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'บันทึกใบ PO\' OR description != \'ิบันทึกใบPO ผ่านทางระบบ bathline uno \' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(51, '2017-01-15 14:02:48', '2017-01-15 07:02:48', 7777, 'task', 7, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,2,4,1,2,843,7,\'ไทย\',\'ตรวจสอบความถูกต้อง ใบสั่งซื้อ\',\'ตรวจสอบความถูกต้อง ใบสั่งซื้อ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(52, '2017-01-15 14:03:41', '2017-01-15 07:03:41', 7777, 'task', 8, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,6,2,1,2,843,7,\'ไทย\',\'แก้ไขใบสั่งซื้อ\',\'แก้ไขใบสั่งซื้อ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(53, '2017-01-15 14:05:04', '2017-01-15 07:05:04', 7777, 'task', 3, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=6,task_action_type_id=3,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\',description=\'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 6 OR task_action_type_id != 3 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\' OR description != \'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(54, '2017-01-15 14:05:21', '2017-01-15 07:05:21', 7777, 'task', 4, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=6,task_action_type_id=4,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'อนุมัติวงเงิน ใบสั่งซื้อแบบ อัตโนมัติ\',description=\'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 6 OR task_action_type_id != 4 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'อนุมัติวงเงิน ใบสั่งซื้อแบบ อัตโนมัติ\' OR description != \'อนุมัติวงเงิน อัตโนมัติโดยมีระบบคอยควบคุมไม่ให้เกินวงเงิน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(55, '2017-01-15 14:11:49', '2017-01-15 07:11:49', 7777, 'task', 3, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=7777,task_parent_id=6,task_action_type_id=3,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'ยื่นขออนุมัติวงเงิน ใบสั่งซื้อ\',description=\'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 7777 OR task_parent_id != 6 OR task_action_type_id != 3 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'ยื่นขออนุมัติวงเงิน ใบสั่งซื้อ\' OR description != \'ยื่นอนุมัติวงเงิน ใบสั่งซื้อ\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(56, '2017-01-15 14:42:26', '2017-01-15 07:42:26', 7777, 'task', 9, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,4,2,1,2,843,7,\'ไทย\',\'แบ่งส่ง\',\'แบ่งส่ง\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(57, '2017-01-15 14:48:43', '2017-01-15 07:48:43', 7777, 'task', 10, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,8,4,1,4,843,7,\'ไทย\',\'เช็คสินค้า กับ ใบสั่งซื้อ\',\'เช็คสินค้า กับ ใบสั่งซื้อ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(58, '2017-01-15 14:59:50', '2017-01-15 07:59:50', 7777, 'task', 11, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,9,1,1,7,843,7,\'ไทย\',\'เริ่มการส่งสินค้า\',\'เริ่มการส่งสินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(59, '2017-01-15 15:00:40', '2017-01-15 08:00:40', 7777, 'task', 12, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,9,3,1,7,843,7,\'ไทย\',\'ส่งเสร็จสิ้น\',\'ส่งเสร็จสิ้น\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(60, '2017-01-15 15:02:24', '2017-01-15 08:02:24', 7777, 'task', 13, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,11,4,1,4,843,7,\'ไทย\',\'ตรวจสอบสินค้าชำรุด\',\'ตรวจสอบสินค้าชำรุด\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(61, '2017-01-15 15:04:11', '2017-01-15 08:04:11', 7777, 'task', 14, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,12,1,1,8,843,7,\'ไทย\',\'บันทึกเงินเข้า\',\'บันทึกเงินเข้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(62, '2017-01-15 15:05:00', '2017-01-15 08:05:00', 7777, 'task', 15, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,12,1,1,8,843,7,\'ไทย\',\'ลงรายละเอียดสินค้าชำรุด\',\'ลงรายละเอียดสินค้าชำรุด\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(63, '2017-01-15 15:16:02', '2017-01-15 08:16:02', 7777, 'job_log', 2, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,7777,2,1,1)', 1, 'successfully'),
(64, '2017-01-16 00:20:47', '2017-01-15 17:20:47', 1, 'job_log', 5, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,7,1,1)', 1, 'successfully'),
(65, '2017-01-17 14:21:46', '2017-01-17 07:21:46', 1, 'db_reference', 2, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'agent\',\'agent\')', 1, 'successfully'),
(66, '2017-01-17 14:23:17', '2017-01-17 07:23:17', 1, 'db_reference', 3, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'order detail\',\'order_detail\')', 1, 'successfully'),
(67, '2017-01-17 14:23:33', '2017-01-17 07:23:33', 1, 'db_reference', 4, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'order detail status\',\'order_detail_status\')', 1, 'successfully'),
(68, '2017-01-17 14:24:16', '2017-01-17 07:24:16', 1, 'db_reference', 5, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'order list\',\'order_list\')', 1, 'successfully'),
(69, '2017-01-17 14:24:31', '2017-01-17 07:24:31', 1, 'db_reference', 6, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'order process status\',\'order_process_status\')', 1, 'successfully'),
(70, '2017-01-17 14:28:27', '2017-01-17 07:28:27', 1, 'task_db_logg', 2, 1, 'INSERT', 'INSERT INTO task_db_logg (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2)', 1, 'successfully'),
(71, '2017-01-17 14:29:36', '2017-01-17 07:29:36', 1, 'task_db_logg', 3, 1, 'INSERT', 'INSERT INTO task_db_logg (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,3)', 1, 'successfully'),
(72, '2017-01-17 14:30:07', '2017-01-17 07:30:07', 1, 'task_db_logg', 4, 1, 'INSERT', 'INSERT INTO task_db_logg (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,4)', 1, 'successfully'),
(73, '2017-01-17 14:30:09', '2017-01-17 07:30:09', 1, 'task_db_logg', 5, 1, 'INSERT', 'INSERT INTO task_db_logg (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,5)', 1, 'successfully'),
(74, '2017-01-17 16:20:34', '2017-01-17 09:20:34', 1, 'task_db_log', 6, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,12,4)', 1, 'successfully'),
(75, '2017-01-19 00:57:37', '2017-01-18 17:57:37', 1, 'region', 2, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'central\',\'central\',1)', 1, 'successfully'),
(76, '2017-01-19 00:57:56', '2017-01-18 17:57:56', 1, 'agent', 2, 1, 'INSERT', 'INSERT INTO agent (id,created,modified,owner,name,phone,description,region_id,bank_account_1,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'woodandceramic\',\'\',\'\',1,\'\',\'\',\'\')', 1, 'successfully'),
(77, '2017-01-19 00:59:57', '2017-01-18 17:59:57', 1, 'supplier', 2, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'Flossy\',\'\',\'\',\'\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(78, '2017-01-19 01:00:35', '2017-01-18 18:00:35', 1, 'product_catagories', 2, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'root\',\'root\')', 1, 'successfully'),
(79, '2017-01-19 01:01:32', '2017-01-18 18:01:32', 1, 'product_status', 2, 1, 'INSERT', 'INSERT INTO product_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ACTIVE\',\'ACTIVE\',1)', 1, 'successfully'),
(80, '2017-01-19 01:01:58', '2017-01-18 18:01:58', 1, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,supplier_id,product_catagories_id,product_status_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,\'B4023\',\'B4023\',\'\',\'\',\'\')', 1, 'successfully'),
(81, '2017-01-19 01:02:40', '2017-01-18 18:02:40', 1, 'order_detail_status', 2, 1, 'INSERT', 'INSERT INTO order_detail_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ACTIVE\',\'ACTIVE\',1)', 1, 'successfully'),
(82, '2017-01-19 01:32:42', '2017-01-18 18:32:42', 1, 'order_list', 2, 1, 'INSERT', 'INSERT INTO order_list (id,created,modified,owner,agent_id,name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'24242\')', 1, 'successfully'),
(83, '2017-01-19 01:48:08', '2017-01-18 18:48:08', 1, 'order_list', 3, 1, 'INSERT', 'INSERT INTO order_list (id,created,modified,owner,agent_id,name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'1241\')', 1, 'successfully'),
(84, '2017-01-19 01:50:16', '2017-01-18 18:50:16', 1, 'attachment', 2, 1, 'INSERT', 'INSERT INTO attachment (id,created,modified,owner,record_name,record_document,attachment_type,file_dir,file_extension) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,\'1\',\'order_list\',3,1,\'C:/wamp64/www/public/upload/attachment/1701180650-630859375.jpg\',\'jpg\')', 1, 'successfully'),
(85, '2017-01-19 01:50:16', '2017-01-18 18:50:16', 1, 'order_list', 4, 1, 'INSERT', 'INSERT INTO order_list (id,created,modified,owner,agent_id,name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'2424\')', 1, 'successfully'),
(86, '2017-01-19 01:52:08', '2017-01-18 18:52:08', 1, 'task', 16, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,1,2,843,7,\'ไทย\',\'บันทึกรายละเอียดสินค้า\',\'บันทึกรายละเอียดสินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(87, '2017-01-19 01:52:25', '2017-01-18 18:52:25', 1, 'task_db_log', 7, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,15,2)', 1, 'successfully'),
(88, '2017-01-19 01:54:34', '2017-01-18 18:54:34', 1, 'order_detail', 2, 1, 'INSERT', 'INSERT INTO order_detail (id,created,modified,owner,order_list_id,product_id,quantity,price,order_detail_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,12,30,1)', 1, 'successfully'),
(89, '2017-01-19 01:56:20', '2017-01-18 18:56:20', 1, 'task_db_log', 8, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,6,2)', 1, 'successfully'),
(90, '2017-01-19 02:09:58', '2017-01-18 19:09:58', 1, 'task_db_log', 9, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,7,2)', 1, 'successfully'),
(91, '2017-01-19 02:31:36', '2017-01-18 19:31:36', 1, 'task_db_log', 7, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=6,db_reference_id=4 WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 6 OR db_reference_id != 4 )', 1, 'successfully'),
(92, '2017-01-19 02:39:43', '2017-01-18 19:39:43', 1, 'task_db_log', 1, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=6,db_reference_id=4 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 6 OR db_reference_id != 4 )', 1, 'successfully'),
(93, '2017-01-19 02:39:56', '2017-01-18 19:39:56', 1, 'task_db_log', 7, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=2,db_reference_id=4 WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 2 OR db_reference_id != 4 )', 1, 'successfully'),
(94, '2017-01-19 02:42:20', '2017-01-18 19:42:20', 1, 'task_db_log', 10, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,13,1)', 1, 'successfully'),
(95, '2017-01-19 02:48:22', '2017-01-18 19:48:22', 1, 'task_db_log', 8, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=7,db_reference_id=4 WHERE id =8 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 7 OR db_reference_id != 4 )', 1, 'successfully'),
(96, '2017-01-19 03:11:41', '2017-01-18 20:11:41', 1, 'order_list', 5, 1, 'INSERT', 'INSERT INTO order_list (id,created,modified,owner,agent_id,name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'2\')', 1, 'successfully'),
(97, '2017-01-19 19:35:32', '2017-01-19 12:35:32', 1, 'task', 17, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'เพิ่มบุคลากร\',\'เพิ่มบุคลากร\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(98, '2017-01-19 19:35:56', '2017-01-19 12:35:56', 1, 'task', 18, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'แก้ไข บุคลากร\',\'แก้ไข บุคลากร\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(99, '2017-01-19 19:36:22', '2017-01-19 12:36:22', 1, 'task', 19, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'เพิ่ม ลูกค้า\',\'เพิ่ม ลูกค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(100, '2017-01-19 19:36:31', '2017-01-19 12:36:31', 1, 'task', 20, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'แก้ไข ลูกค้า\',\'แก้ไข ลูกค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(101, '2017-01-19 19:37:18', '2017-01-19 12:37:18', 1, 'task', 21, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'เพิ่ม โรงงานผลิต\',\'เพิ่ม โรงงานผลิต\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(102, '2017-01-19 19:37:25', '2017-01-19 12:37:25', 1, 'task', 22, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,6,843,7,\'ไทย\',\'แก้ไข โรงงานผลิต\',\'แก้ไข โรงงานผลิต\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(103, '2017-01-19 19:37:58', '2017-01-19 12:37:58', 1, 'task', 23, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,6,843,7,\'ไทย\',\'แก้ไข ยานพาหนะ\',\'แก้ไข ยานพาหนะ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(104, '2017-01-19 19:38:09', '2017-01-19 12:38:09', 1, 'task', 24, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,6,843,7,\'ไทย\',\'เพิ่ม ยานพาหนะ\',\'เพิ่ม ยานพาหนะ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(105, '2017-01-19 19:38:48', '2017-01-19 12:38:48', 1, 'task_db_log', 11, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,18,1)', 1, 'successfully'),
(106, '2017-01-19 19:39:15', '2017-01-19 12:39:15', 1, 'task', 16, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม บุคลากร \',description=\'เพิ่มบุคลากร\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =16 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม บุคลากร \' OR description != \'เพิ่มบุคลากร\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(107, '2017-01-19 19:57:54', '2017-01-19 12:57:54', 1, 'db_reference', 7, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'vehicle\',\'vehicle\')', 1, 'successfully'),
(108, '2017-01-19 19:58:00', '2017-01-19 12:58:00', 1, 'db_reference', 8, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'employee\',\'employee\')', 1, 'successfully'),
(109, '2017-01-19 19:58:27', '2017-01-19 12:58:27', 1, 'db_reference', 9, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'task\',\'task\')', 1, 'successfully'),
(110, '2017-01-19 19:58:37', '2017-01-19 12:58:37', 1, 'db_reference', 10, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'job\',\'job\')', 1, 'successfully'),
(111, '2017-01-19 19:59:06', '2017-01-19 12:59:06', 1, 'task', 17, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข บุคลากร\',description=\'แก้ไข บุคลากร\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =17 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข บุคลากร\' OR description != \'แก้ไข บุคลากร\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(112, '2017-01-19 19:59:21', '2017-01-19 12:59:21', 1, 'task', 19, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข ลูกค้า\',description=\'แก้ไข ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข ลูกค้า\' OR description != \'แก้ไข ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(113, '2017-01-19 19:59:44', '2017-01-19 12:59:44', 1, 'task', 23, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ยานพาหนะ\',description=\'เพิ่ม ยานพาหนะ\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =23 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ยานพาหนะ\' OR description != \'เพิ่ม ยานพาหนะ\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(114, '2017-01-19 20:11:49', '2017-01-19 13:11:49', 1, 'task_db_log', 12, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,16,7)', 1, 'successfully'),
(115, '2017-01-19 20:11:53', '2017-01-19 13:11:53', 1, 'task_db_log', 13, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,17,7)', 1, 'successfully'),
(116, '2017-01-19 20:11:58', '2017-01-19 13:11:58', 1, 'task_db_log', 14, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,19,1)', 1, 'successfully'),
(117, '2017-01-19 20:12:17', '2017-01-19 13:12:17', 1, 'db_reference', 11, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'supplier\',\'supplier\')', 1, 'successfully'),
(118, '2017-01-19 20:12:38', '2017-01-19 13:12:38', 1, 'task_db_log', 15, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,20,10)', 1, 'successfully'),
(119, '2017-01-19 20:12:42', '2017-01-19 13:12:42', 1, 'task_db_log', 16, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,21,10)', 1, 'successfully'),
(120, '2017-01-19 20:12:47', '2017-01-19 13:12:47', 1, 'task_db_log', 17, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,23,6)', 1, 'successfully'),
(121, '2017-01-19 20:12:52', '2017-01-19 13:12:52', 1, 'task_db_log', 18, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,22,6)', 1, 'successfully'),
(122, '2017-01-19 20:14:02', '2017-01-19 13:14:02', 1, 'job_log', 9, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,6,1,1)', 1, 'successfully'),
(123, '2017-01-19 21:24:15', '2017-01-19 14:24:15', 1, 'vehicle_brand', 2, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'KIA\',\'KIA\')', 1, 'successfully'),
(124, '2017-01-19 21:24:19', '2017-01-19 14:24:19', 1, 'vehicle_brand', 3, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'FORD\',\'FORD\')', 1, 'successfully'),
(125, '2017-01-19 21:24:23', '2017-01-19 14:24:23', 1, 'vehicle_brand', 4, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'HONDA\',\'HONDA\')', 1, 'successfully'),
(126, '2017-01-19 21:24:30', '2017-01-19 14:24:30', 1, 'vehicle_brand', 5, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'TOYOTA\',\'TOYOTA\')', 1, 'successfully'),
(127, '2017-01-19 21:24:36', '2017-01-19 14:24:36', 1, 'vehicle_brand', 6, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'SUZUKI\',\'SUZUKI\')', 1, 'successfully'),
(128, '2017-01-19 21:24:47', '2017-01-19 14:24:47', 1, 'vehicle_brand', 7, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'HYUNDAI\',\'HYUNDAI\')', 1, 'successfully'),
(129, '2017-01-19 21:25:42', '2017-01-19 14:25:42', 1, 'vehicle_brand', 8, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ISUZU\',\'ISUZU\')', 1, 'successfully'),
(130, '2017-01-19 21:25:56', '2017-01-19 14:25:56', 1, 'vehicle_brand', 9, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'CHEVROLET\',\'CHEVROLET\')', 1, 'successfully'),
(131, '2017-01-19 21:26:06', '2017-01-19 14:26:06', 1, 'vehicle_brand', 10, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'MAZDA\',\'MAZDA\')', 1, 'successfully'),
(132, '2017-01-19 21:26:14', '2017-01-19 14:26:14', 1, 'vehicle_brand', 11, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'TATA\',\'TATA\')', 1, 'successfully'),
(133, '2017-01-19 21:26:25', '2017-01-19 14:26:25', 1, 'vehicle_brand', 12, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'THAIRUNG\',\'THAIRUNG\')', 1, 'successfully'),
(134, '2017-01-19 21:26:40', '2017-01-19 14:26:40', 1, 'vehicle_brand', 13, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'SSANGYONG\',\'SSANGYONG\')', 1, 'successfully'),
(135, '2017-01-19 21:27:07', '2017-01-19 14:27:07', 1, 'vehicle_brand', 14, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'MITSUBISHI\',\'MITSUBISHI\')', 1, 'successfully'),
(136, '2017-01-19 21:27:17', '2017-01-19 14:27:17', 1, 'vehicle_brand', 15, 1, 'INSERT', 'INSERT INTO vehicle_brand (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'SUBURU\',\'SUBURU\')', 1, 'successfully'),
(137, '2017-01-19 21:28:26', '2017-01-19 14:28:26', 1, 'vehicle_catagory', 2, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'root\',\'root\',1)', 1, 'successfully'),
(138, '2017-01-19 21:29:30', '2017-01-19 14:29:30', 1, 'vehicle_catagory', 3, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'SEDAN\',\'SEDAN\',1)', 1, 'successfully'),
(139, '2017-01-19 21:30:01', '2017-01-19 14:30:01', 1, 'vehicle_catagory', 4, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'PICKUP TRUCK\',\'PICKUP TRUCK\',1)', 1, 'successfully'),
(140, '2017-01-19 21:30:06', '2017-01-19 14:30:06', 1, 'vehicle_catagory', 5, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'TRUCK\',\'TRUCK\',1)', 1, 'successfully'),
(141, '2017-01-19 21:31:49', '2017-01-19 14:31:49', 1, 'vehicle_catagory', 1, 1, 'UPDATE', 'UPDATE vehicle_catagory SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'TRAILER\',description=\'TRAILER\',vehicle_catagory_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'TRAILER\' OR description != \'TRAILER\' OR vehicle_catagory_parent_id != 1 )', 1, 'successfully'),
(142, '2017-01-19 21:31:57', '2017-01-19 14:31:57', 1, 'vehicle_catagory', 1, 1, 'UPDATE', 'UPDATE vehicle_catagory SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'TRAILER HEAD\',description=\'TRAILER HEAD\',vehicle_catagory_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'TRAILER HEAD\' OR description != \'TRAILER HEAD\' OR vehicle_catagory_parent_id != 1 )', 1, 'successfully'),
(143, '2017-01-19 21:32:25', '2017-01-19 14:32:25', 1, 'vehicle_catagory', 6, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'TRAILER\',\'TRAILER\',1)', 1, 'successfully'),
(144, '2017-01-19 21:32:33', '2017-01-19 14:32:33', 1, 'vehicle_catagory', 1, 1, 'UPDATE', 'UPDATE vehicle_catagory SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'root\',description=\'root\',vehicle_catagory_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'root\' OR description != \'root\' OR vehicle_catagory_parent_id != 1 )', 1, 'successfully'),
(145, '2017-01-19 21:32:56', '2017-01-19 14:32:56', 1, 'vehicle_catagory', 7, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'TRAILER HEAD\',\'TRAILER HEAD\',1)', 1, 'successfully'),
(146, '2017-01-19 21:33:43', '2017-01-19 14:33:43', 1, 'vehicle_catagory', 8, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'MUV\',\'MUV\',1)', 1, 'successfully'),
(147, '2017-01-19 21:33:54', '2017-01-19 14:33:54', 1, 'vehicle_catagory', 9, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'MOTOCYCLE\',\'MOTOCYCLE\',1)', 1, 'successfully'),
(148, '2017-01-19 21:34:02', '2017-01-19 14:34:02', 1, 'vehicle_catagory', 10, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'BICYCLE\',\'BICYCLE\',1)', 1, 'successfully'),
(149, '2017-01-19 21:34:26', '2017-01-19 14:34:26', 1, 'vehicle_catagory', 11, 1, 'INSERT', 'INSERT INTO vehicle_catagory (id,created,modified,owner,name,description,vehicle_catagory_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'VAN\',\'VAN\',1)', 1, 'successfully'),
(150, '2017-01-19 21:47:59', '2017-01-19 14:47:59', 1, 'vehicle_status', 2, 1, 'INSERT', 'INSERT INTO vehicle_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'s\',\'s\',1)', 1, 'successfully'),
(151, '2017-01-19 21:48:16', '2017-01-19 14:48:16', 1, 'vehicle_status', 1, 1, 'UPDATE', 'UPDATE vehicle_status SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ACTIVE\',description=\'ACTIVE\',boolean=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ACTIVE\' OR description != \'ACTIVE\' OR boolean != 1 )', 1, 'successfully'),
(152, '2017-01-19 21:48:28', '2017-01-19 14:48:28', 1, 'vehicle_status', 3, 1, 'INSERT', 'INSERT INTO vehicle_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ACCIDENT\',\'ACCIDENT\',0)', 1, 'successfully'),
(153, '2017-01-19 21:48:54', '2017-01-19 14:48:54', 1, 'vehicle_status', 4, 1, 'INSERT', 'INSERT INTO vehicle_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'REPAIRING\',\'REPAIRING\',0)', 1, 'successfully'),
(154, '2017-01-19 21:49:11', '2017-01-19 14:49:11', 1, 'vehicle_status', 5, 1, 'INSERT', 'INSERT INTO vehicle_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'DISABLE\',\'DISABLE\',0)', 1, 'successfully'),
(155, '2017-01-19 21:49:39', '2017-01-19 14:49:39', 1, 'vehicle_status', 6, 1, 'INSERT', 'INSERT INTO vehicle_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'MAINTAINING\',\'MAINTAINING\',0)', 1, 'successfully'),
(156, '2017-01-20 00:32:46', '2017-01-19 17:32:46', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพs\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพs\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(157, '2017-01-20 00:32:58', '2017-01-19 17:32:58', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(158, '2017-01-20 00:34:52', '2017-01-19 17:34:52', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพs\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพs\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(159, '2017-01-20 00:34:57', '2017-01-19 17:34:57', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(160, '2017-01-20 01:30:24', '2017-01-19 18:30:24', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ"Echo"\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ"Echo"\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(161, '2017-01-20 01:30:41', '2017-01-19 18:30:41', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(162, '2017-01-20 01:31:01', '2017-01-19 18:31:01', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพvar_dump($_SESSION);\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพvar_dump($_SESSION);\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(163, '2017-01-20 01:31:11', '2017-01-19 18:31:11', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(164, '2017-01-20 01:31:19', '2017-01-19 18:31:19', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพecho 1;\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพecho 1;\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' )', 1, 'successfully'),
(165, '2017-01-20 01:32:47', '2017-01-19 18:32:47', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != 1 )', 1, 'successfully'),
(166, '2017-01-20 01:32:52', '2017-01-19 18:32:52', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ"\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ"\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != 1 )', 1, 'successfully'),
(167, '2017-01-20 01:32:56', '2017-01-19 18:32:56', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != 1 )', 1, 'successfully'),
(168, '2017-01-20 01:38:59', '2017-01-19 18:38:59', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=22 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != 22 )', 1, 'successfully'),
(169, '2017-01-20 01:46:34', '2017-01-19 18:46:34', 1, 'vehicle', 2, 1, 'INSERT', 'INSERT INTO vehicle (id,created,modified,owner,name,vehicle_brand_id,vehicle_catagory_id,purchased_year,license_number) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'\',2,2,\'2017-01-17\',\'2112\')', 1, 'successfully'),
(170, '2017-01-20 02:25:06', '2017-01-19 19:25:06', 1, 'vehicle', 3, 1, 'INSERT', 'INSERT INTO vehicle (id,created,modified,owner,name,vehicle_brand_id,vehicle_catagory_id,purchased_year,license_number) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'\',2,3,\'1970-01-01\',\'2\')', 1, 'successfully'),
(171, '2017-01-20 02:35:23', '2017-01-19 19:35:23', 1, 'task', 25, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,6,843,7,\'ไทย\',\'เพิ่ม ตำแหน่งงาน\',\'เพิ่ม ตำแหน่งงาน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(172, '2017-01-20 02:35:33', '2017-01-19 19:35:33', 1, 'task', 26, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,6,843,7,\'ไทย\',\'แก้ไข ตำแหน่งงาน\',\'เพิ่ม ตำแหน่งงาน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(173, '2017-01-20 02:35:46', '2017-01-19 19:35:46', 1, 'task_db_log', 19, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,24,9)', 1, 'successfully'),
(174, '2017-01-20 02:35:49', '2017-01-19 19:35:49', 1, 'task_db_log', 20, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,25,9)', 1, 'successfully'),
(175, '2017-01-20 02:36:04', '2017-01-19 19:36:04', 1, 'job_log', 2, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,6,1,1)', 1, 'successfully'),
(176, '2017-01-20 02:36:39', '2017-01-19 19:36:39', 1, 'job', 6, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=10,name=\'แผนกบุคคล\',name_english=\'็Human Resource Manage\',description=\'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 10 OR name != \'แผนกบุคคล\' OR name_english != \'็Human Resource Manage\' OR description != \'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' )', 1, 'successfully'),
(177, '2017-01-20 02:36:46', '2017-01-19 19:36:46', 1, 'job', 6, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=10,name=\'แผนกบุคคล\',name_english=\'็Human Resource Manager\',description=\'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 10 OR name != \'แผนกบุคคล\' OR name_english != \'็Human Resource Manager\' OR description != \'สามารถเป็นตัวเชื่อมให้กับ บุคคลากรของบริษัททุกท่านด้วยใจเป็นกลาง ผ่านความชัดเจน และ ร่มเย็น ตรวจสอบและดูแลข้อเท็จจริงของบุคคลากร สามารถหาบุคคลากรใหม่ เมื่อขาดแคลยนโดยคำนึงถึงประสิทธิภาพใน สายงาน และ ผลงาน\' )', 1, 'successfully'),
(178, '2017-01-20 02:38:54', '2017-01-19 19:38:54', 1, 'attachment', 3, 1, 'INSERT', 'INSERT INTO attachment (id,created,modified,owner,record_name,record_document,attachment_type,file_dir,file_extension) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,\'1\',\'job\',11,1,\'C:/wamp64/www/public/upload/attachment/1701190738-975802612.jpg\',\'jpg\')', 1, 'successfully'),
(179, '2017-01-20 02:52:52', '2017-01-19 19:52:52', 1, 'region', 1, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'root\',description=\'root\',region_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'root\' OR description != \'root\' OR region_parent_id != 1 )', 1, 'successfully'),
(180, '2017-01-20 03:05:00', '2017-01-19 20:05:00', 1, 'task', 18, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=2,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ลูกค้า\',description=\'เพิ่ม ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =18 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 2 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ลูกค้า\' OR description != \'เพิ่ม ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(181, '2017-01-20 03:05:13', '2017-01-19 20:05:13', 1, 'task', 19, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=2,job_id=6,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข ลูกค้า\',description=\'แก้ไข ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 2 OR job_id != 6 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข ลูกค้า\' OR description != \'แก้ไข ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(182, '2017-01-20 03:05:36', '2017-01-19 20:05:36', 1, 'task', 19, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข ลูกค้า\',description=\'แก้ไข ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข ลูกค้า\' OR description != \'แก้ไข ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(183, '2017-01-20 03:05:48', '2017-01-19 20:05:48', 1, 'task', 18, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=2,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ลูกค้า\',description=\'เพิ่ม ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =18 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 2 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ลูกค้า\' OR description != \'เพิ่ม ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(184, '2017-01-20 03:06:35', '2017-01-19 20:06:35', 1, 'task', 20, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม โรงงานผลิต\',description=\'เพิ่ม โรงงานผลิต\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =20 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม โรงงานผลิต\' OR description != \'เพิ่ม โรงงานผลิต\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(185, '2017-01-20 03:06:43', '2017-01-19 20:06:43', 1, 'task', 21, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข โรงงานผลิต\',description=\'แก้ไข โรงงานผลิต\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =21 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข โรงงานผลิต\' OR description != \'แก้ไข โรงงานผลิต\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(186, '2017-01-20 03:52:06', '2017-01-19 20:52:06', 1, 'attachment', 4, 1, 'INSERT', 'INSERT INTO attachment (id,created,modified,owner,record_name,record_document,attachment_type,file_dir,file_extension) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,\'1\',\'task\',26,1,\'C:/wamp64/www/public/upload/attachment/1701190852-284844970.jpg\',\'jpg\')', 1, 'successfully'),
(187, '2017-01-20 03:52:21', '2017-01-19 20:52:21', 1, 'attachment', 5, 1, 'INSERT', 'INSERT INTO attachment (id,created,modified,owner,record_name,record_document,attachment_type,file_dir,file_extension) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,\'1\',\'employee\',2,1,\'C:/wamp64/www/public/upload/attachment/1701190852-871542358.jpg\',\'jpg\')', 1, 'successfully'),
(188, '2017-01-20 03:55:13', '2017-01-19 20:55:13', 1, 'task', 27, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่ม สินค้า\',\'เพิ่ม สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(189, '2017-01-20 03:55:18', '2017-01-19 20:55:18', 1, 'task', 28, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'แก้ไข สินค้า\',\'เพิ่ม สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(190, '2017-01-20 03:55:45', '2017-01-19 20:55:45', 1, 'job_log', 3, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,1)', 1, 'successfully'),
(191, '2017-01-20 03:55:49', '2017-01-19 20:55:49', 1, 'job_log', 4, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,1)', 1, 'successfully'),
(192, '2017-01-20 03:56:39', '2017-01-19 20:56:39', 1, 'db_reference', 12, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product\',\'product\')', 1, 'successfully'),
(193, '2017-01-20 03:56:52', '2017-01-19 20:56:52', 1, 'task_db_log', 21, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,26,11)', 1, 'successfully'),
(194, '2017-01-20 03:56:55', '2017-01-19 20:56:55', 1, 'task_db_log', 22, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,27,11)', 1, 'successfully'),
(195, '2017-01-20 03:58:15', '2017-01-19 20:58:15', 1, 'product_status', 3, 1, 'INSERT', 'INSERT INTO product_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'DISCONTINUE\',\'DISCONTINUE\',0)', 1, 'successfully'),
(196, '2017-01-20 03:58:42', '2017-01-19 20:58:42', 1, 'product_status', 4, 1, 'INSERT', 'INSERT INTO product_status (id,created,modified,owner,name,description,boolean) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'OUT_OF_STOCK\',\'OUT_OF_STOCK\',0)', 1, 'successfully'),
(197, '2017-01-20 03:58:52', '2017-01-19 20:58:52', 1, 'product_status', 3, 1, 'UPDATE', 'UPDATE product_status SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'OUT OF STOCK\',description=\'OUT OF STOCK\',boolean=0 WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'OUT OF STOCK\' OR description != \'OUT OF STOCK\' OR boolean != 0 )', 1, 'successfully'),
(198, '2017-01-20 04:00:33', '2017-01-19 21:00:33', 1, 'db_reference', 13, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product_catagories\',\'product_catagories\')', 1, 'successfully'),
(199, '2017-01-20 04:03:29', '2017-01-19 21:03:29', 1, 'task', 29, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่ม หมวดหมู่สินค้า\',\'เพิ่ม หมวดหมู่สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(200, '2017-01-20 04:03:39', '2017-01-19 21:03:39', 1, 'task', 30, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข หมวดหมู่สินค้า\',\'แก้ไข หมวดหมู่สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(201, '2017-01-20 04:05:01', '2017-01-19 21:05:01', 1, 'task_db_log', 23, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,28,12)', 1, 'successfully'),
(202, '2017-01-20 04:05:05', '2017-01-19 21:05:05', 1, 'task_db_log', 24, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,29,12)', 1, 'successfully'),
(203, '2017-01-20 12:28:21', '2017-01-20 05:28:21', 1, 'employee', 3, 1, 'INSERT', 'INSERT INTO employee (id,created,modified,owner,name,firstname_thai,lastname_thai,firstname_english,lastname_english,phone,email,address,amphur_id,province_id,start_date,join_date,national_id,bank_account) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'อำ\',\'อำภา\',\'ตรีพืช\',\'Aumpa\',\'\',\'\',\'\',\'\',843,7,\'1970-01-01\',\'1970-01-01\',\'\',\'\')', 1, 'successfully'),
(204, '2017-01-20 12:28:46', '2017-01-20 05:28:46', 1, 'job_log', 5, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,1)', 1, 'successfully'),
(205, '2017-01-20 15:08:51', '2017-01-20 08:08:51', 2, 'supplier', 2, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHANTOU JIXIANG TRADING CO.,LTD.\',\'EMON\',\'ROOM 201 NO\',\'\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(206, '2017-01-20 15:08:51', '2017-01-20 08:08:51', 2, 'supplier', 3, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHANTOU JIXIANG TRADING CO.,LTD.\',\'EMON\',\'ROOM 201 NO\',\'\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(207, '2017-01-20 15:17:04', '2017-01-20 08:17:04', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'wood\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'wood\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(208, '2017-01-20 15:17:04', '2017-01-20 08:17:04', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'wood\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'wood\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(209, '2017-01-20 15:17:12', '2017-01-20 08:17:12', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(210, '2017-01-20 15:17:12', '2017-01-20 08:17:12', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(211, '2017-01-20 15:18:35', '2017-01-20 08:18:35', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Ghangzhou\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Ghangzhou\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(212, '2017-01-20 15:18:35', '2017-01-20 08:18:35', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Ghangzhou\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Ghangzhou\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(213, '2017-01-20 15:18:42', '2017-01-20 08:18:42', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(214, '2017-01-20 15:18:42', '2017-01-20 08:18:42', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(215, '2017-01-20 15:19:19', '2017-01-20 08:19:19', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Ghangzhou\',country=\'China\',email=\'asdasd@asd.com\',phone=\'123124\',bank_account=\'asjdk\',bank_account_2=\'asdkj\',tax_identification=\'asd\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Ghangzhou\' OR country != \'China\' OR email != \'asdasd@asd.com\' OR phone != \'123124\' OR bank_account != \'asjdk\' OR bank_account_2 != \'asdkj\' OR tax_identification != \'asd\' )', 1, 'successfully'),
(216, '2017-01-20 15:19:19', '2017-01-20 08:19:19', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Ghangzhou\',country=\'China\',email=\'asdasd@asd.com\',phone=\'123124\',bank_account=\'asjdk\',bank_account_2=\'asdkj\',tax_identification=\'asd\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Ghangzhou\' OR country != \'China\' OR email != \'asdasd@asd.com\' OR phone != \'123124\' OR bank_account != \'asjdk\' OR bank_account_2 != \'asdkj\' OR tax_identification != \'asd\' )', 1, 'successfully'),
(217, '2017-01-20 15:22:04', '2017-01-20 08:22:04', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(218, '2017-01-20 15:22:04', '2017-01-20 08:22:04', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(219, '2017-01-20 15:27:25', '2017-01-20 08:27:25', 1, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Changping\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Changping\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(220, '2017-01-20 15:27:25', '2017-01-20 08:27:25', 1, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Changping\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Changping\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(221, '2017-01-20 15:27:47', '2017-01-20 08:27:47', 1, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(222, '2017-01-20 15:27:47', '2017-01-20 08:27:47', 1, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(223, '2017-01-20 15:29:24', '2017-01-20 08:29:24', 2, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Chang\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Chang\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(224, '2017-01-20 15:29:24', '2017-01-20 08:29:24', 2, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Chang\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Chang\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(225, '2017-01-20 15:31:45', '2017-01-20 08:31:45', 1, 'employee', 4, 1, 'INSERT', 'INSERT INTO employee (id,created,modified,owner,name,firstname_thai,lastname_thai,firstname_english,lastname_english,phone,email,address,amphur_id,province_id,start_date,join_date,national_id,bank_account) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'เพชร\',\'ชื่อต้น\',\'นามสกุล\',\'\',\'\',\'\',\'\',\'\',843,7,\'1970-01-01\',\'1970-01-01\',\'\',\'\')', 1, 'successfully'),
(226, '2017-01-20 15:56:33', '2017-01-20 08:56:33', 2, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Chang\',country=\'\',email=\'\',phone=\'123456\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Chang\' OR country != \'\' OR email != \'\' OR phone != \'123456\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(227, '2017-01-20 15:56:33', '2017-01-20 08:56:33', 2, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'Chang\',country=\'\',email=\'\',phone=\'123456\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'Chang\' OR country != \'\' OR email != \'\' OR phone != \'123456\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(228, '2017-01-20 16:12:15', '2017-01-20 09:12:15', 2, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(229, '2017-01-20 16:12:15', '2017-01-20 09:12:15', 2, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(230, '2017-01-22 01:48:54', '2017-01-21 18:48:54', 1, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'D\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'D\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(231, '2017-01-22 01:48:54', '2017-01-21 18:48:54', 1, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'D\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'D\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(232, '2017-01-22 01:49:13', '2017-01-21 18:49:13', 1, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(233, '2017-01-22 01:49:13', '2017-01-21 18:49:13', 1, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(234, '2017-01-22 14:07:51', '2017-01-22 07:07:51', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONS\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONS\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(235, '2017-01-22 14:07:51', '2017-01-22 07:07:51', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONS\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONS\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(236, '2017-01-22 14:08:15', '2017-01-22 07:08:15', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(237, '2017-01-22 14:08:15', '2017-01-22 07:08:15', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(238, '2017-01-22 15:18:06', '2017-01-22 08:18:06', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(239, '2017-01-22 15:18:06', '2017-01-22 08:18:06', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(240, '2017-01-23 01:26:14', '2017-01-22 18:26:14', 1, 'job', 12, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,\'พนักงานแนะนำสินค้า\',\'Product Consultant\',\'\')', 1, 'successfully'),
(241, '2017-01-23 01:54:14', '2017-01-22 18:54:14', 1, 'job', 9, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=1,name=\'ประธานบริษัทฯ\',name_english=\'Presidentt\',description=\'\' WHERE id =9 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 1 OR name != \'ประธานบริษัทฯ\' OR name_english != \'Presidentt\' OR description != \'\' )', 1, 'successfully'),
(242, '2017-01-23 01:54:18', '2017-01-22 18:54:18', 1, 'job', 9, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=1,name=\'ประธานบริษัทฯ\',name_english=\'President\',description=\'\' WHERE id =9 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 1 OR name != \'ประธานบริษัทฯ\' OR name_english != \'President\' OR description != \'\' )', 1, 'successfully'),
(243, '2017-01-23 01:54:33', '2017-01-22 18:54:33', 1, 'job', 10, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=9,name=\'ประธานกรรมการบริหาร\',name_english=\'Chief Executive Officer\',description=\'\' WHERE id =10 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 9 OR name != \'ประธานกรรมการบริหาร\' OR name_english != \'Chief Executive Officer\' OR description != \'\' )', 1, 'successfully'),
(244, '2017-01-23 01:55:31', '2017-01-22 18:55:31', 1, 'job', 1, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=1,name=\'บาธไลน์\',name_english=\'Bathline\',description=\'Bathline\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 1 OR name != \'บาธไลน์\' OR name_english != \'Bathline\' OR description != \'Bathline\' )', 1, 'successfully'),
(245, '2017-01-23 19:43:08', '2017-01-23 12:43:08', 1, 'task', 31, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,11,1,1,\'ไทย\',\'รายงานความเคลื่อนไหว ร้านค้า\',\'รายงานความเคลื่อนไหว ร้านค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(246, '2017-01-23 19:46:16', '2017-01-23 12:46:16', 1, 'product_catagories', 3, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'Bathline Products\',\'Bathline Products\',\'root\')', 1, 'successfully'),
(247, '2017-01-23 19:47:42', '2017-01-23 12:47:42', 1, 'product_catagories', 4, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,\'ห้องนํ้า\',\'ห้องนํ้า\',\'ห้องนํ้า\')', 1, 'successfully'),
(248, '2017-01-23 19:48:06', '2017-01-23 12:48:06', 1, 'product_catagories', 3, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=2,name=\'ห้องนํ้า\',name_english=\'Bathroom\',description=\'ห้องนํ้า\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 2 OR name != \'ห้องนํ้า\' OR name_english != \'Bathroom\' OR description != \'ห้องนํ้า\' )', 1, 'successfully'),
(249, '2017-01-23 19:48:22', '2017-01-23 12:48:22', 1, 'product_catagories', 2, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=1,name=\'สินค้าบาธไลน์\',name_english=\'Bathline Products\',description=\'root\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 1 OR name != \'สินค้าบาธไลน์\' OR name_english != \'Bathline Products\' OR description != \'root\' )', 1, 'successfully'),
(250, '2017-01-23 19:48:50', '2017-01-23 12:48:50', 1, 'product_catagories', 5, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,\'สุขภัณฑ์\',\'Ceramic\',\'สุขภัณฑ์\')', 1, 'successfully'),
(251, '2017-01-23 19:50:14', '2017-01-23 12:50:14', 1, 'product_catagories', 6, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,4,\'โถส้วม\',\'Toilet\',\'โถส้วม\')', 1, 'successfully'),
(252, '2017-01-23 19:51:36', '2017-01-23 12:51:36', 1, 'product_catagories', 7, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,\'วันพีช\',\'One Piece\',\'โถส้วม วันพีช\')', 1, 'successfully'),
(253, '2017-01-23 19:51:56', '2017-01-23 12:51:56', 1, 'product_catagories', 8, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,\'ทูพีช\',\'Two Piece\',\'โถส้วม ทูพีช\')', 1, 'successfully'),
(254, '2017-01-23 19:54:15', '2017-01-23 12:54:15', 1, 'product_catagories', 6, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=4,name=\'วันพีช\',name_english=\'One Piece\',description=\'โถส้วม วันพีช\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 4 OR name != \'วันพีช\' OR name_english != \'One Piece\' OR description != \'โถส้วม วันพีช\' )', 1, 'successfully'),
(255, '2017-01-23 19:57:13', '2017-01-23 12:57:13', 1, 'product_catagories', 6, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=4,name=\'โถปัสสาวะ\',name_english=\'Urinals\',description=\'โถปัสสาวะ\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 4 OR name != \'โถปัสสาวะ\' OR name_english != \'Urinals\' OR description != \'โถปัสสาวะ\' )', 1, 'successfully'),
(256, '2017-01-23 19:58:43', '2017-01-23 12:58:43', 1, 'product_catagories', 7, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'อ่างล้างหน้า\',name_english=\'Sink\',description=\'อ่างล้างหน้า\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'อ่างล้างหน้า\' OR name_english != \'Sink\' OR description != \'อ่างล้างหน้า\' )', 1, 'successfully'),
(257, '2017-01-23 19:58:54', '2017-01-23 12:58:54', 1, 'product_catagories', 7, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'อ่างล้างมือ\',name_english=\'Sink\',description=\'อ่างล้างมือ\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'อ่างล้างมือ\' OR name_english != \'Sink\' OR description != \'อ่างล้างมือ\' )', 1, 'successfully'),
(258, '2017-01-23 19:59:25', '2017-01-23 12:59:25', 1, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'โถส้วม\',name_english=\'Toilet\',description=\'โถส้วม\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'โถส้วม\' OR name_english != \'Toilet\' OR description != \'โถส้วม\' )', 1, 'successfully'),
(259, '2017-01-23 19:59:44', '2017-01-23 12:59:44', 1, 'product_catagories', 6, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'โถปัสสาวะ\',name_english=\'Urinals\',description=\'โถปัสสาวะ\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'โถปัสสาวะ\' OR name_english != \'Urinals\' OR description != \'โถปัสสาวะ\' )', 1, 'successfully'),
(260, '2017-01-23 20:00:31', '2017-01-23 13:00:31', 1, 'product_catagories', 4, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'ก็อกนํ้า\',name_english=\'Faucet\',description=\'ก็อกนํ้า\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'ก็อกนํ้า\' OR name_english != \'Faucet\' OR description != \'ก็อกนํ้า\' )', 1, 'successfully'),
(261, '2017-01-23 20:00:50', '2017-01-23 13:00:50', 1, 'product_catagories', 9, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,\'กระจก\',\'Mirror\',\'กระจก\')', 1, 'successfully'),
(262, '2017-01-23 20:03:22', '2017-01-23 13:03:22', 1, 'product_catagories', 10, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,\'ตู้อาบนํ้า\',\'Shower\',\'ตู้อาบนํ้า\')', 1, 'successfully'),
(263, '2017-01-23 20:04:00', '2017-01-23 13:04:00', 1, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,\'อ่างอาบนํ้า\',\'Bathtub\',\'อ่างอาบนํ้าอ่างอาบนํ้า\')', 1, 'successfully'),
(264, '2017-01-23 20:05:21', '2017-01-23 13:05:21', 1, 'product_catagories', 7, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=3,name=\'อ่างล้างมือ\',name_english=\'ฺBasin\',description=\'อ่างล้างมือ\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 3 OR name != \'อ่างล้างมือ\' OR name_english != \'ฺBasin\' OR description != \'อ่างล้างมือ\' )', 1, 'successfully'),
(265, '2017-01-23 20:08:02', '2017-01-23 13:08:02', 1, 'job_log', 6, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,6,3,1)', 1, 'successfully'),
(266, '2017-01-23 20:11:03', '2017-01-23 13:11:03', 1, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,supplier_id=1,product_catagories_id=5,product_status_id=1,name=\'B4023\',name_english=\'B4023\',short_description=\'\',long_description=\'\',barcode=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR supplier_id != 1 OR product_catagories_id != 5 OR product_status_id != 1 OR name != \'B4023\' OR name_english != \'B4023\' OR short_description != \'\' OR long_description != \'\' OR barcode != \'\' )', 1, 'successfully'),
(267, '2017-01-23 20:18:00', '2017-01-23 13:18:00', 1, 'product_attribute', 2, 1, 'INSERT', 'INSERT INTO product_attribute (id,created,modified,owner,name,name_english,description,product_catagories_id,unit_thai,unit_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'วันพีช\',\'One Piece\',\'ชิ้นเดี่ยว\',5,\'ประเภท\',\'ประเภท\')', 1, 'successfully'),
(268, '2017-01-23 20:32:24', '2017-01-23 13:32:24', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'รายงานความเคลื่อนไหว สต็อค\',description=\'รายงานความเคลื่อนไหว ร้านค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'รายงานความเคลื่อนไหว สต็อค\' OR description != \'รายงานความเคลื่อนไหว ร้านค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(269, '2017-01-23 20:32:30', '2017-01-23 13:32:30', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'รายงานความเคลื่อนไหว สต็อคสินค้า\',description=\'รายงานความเคลื่อนไหว ร้านค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'รายงานความเคลื่อนไหว สต็อคสินค้า\' OR description != \'รายงานความเคลื่อนไหว ร้านค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(270, '2017-01-23 20:33:47', '2017-01-23 13:33:47', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ลักษณะ\',name_english=\'Shape\',description=\'Shape\',product_catagories_id=5,unit_thai=\'ประเภท\',unit_english=\'ประเภท\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ลักษณะ\' OR name_english != \'Shape\' OR description != \'Shape\' OR product_catagories_id != 5 OR unit_thai != \'ประเภท\' OR unit_english != \'ประเภท\' )', 1, 'successfully'),
(271, '2017-01-23 20:48:55', '2017-01-23 13:48:55', 1, 'product_attribute_value', 2, 1, 'INSERT', 'INSERT INTO product_attribute_value (id,created,modified,owner,name,name_english,description,product_attribute_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'\',\'\',\'\',1)', 1, 'successfully'),
(272, '2017-01-23 20:50:18', '2017-01-23 13:50:18', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ลักษณะห\',name_english=\'Shape\',description=\'Shape\',product_catagories_id=5,unit_thai=\'ประเภท\',unit_english=\'ประเภท\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ลักษณะห\' OR name_english != \'Shape\' OR description != \'Shape\' OR product_catagories_id != 5 OR unit_thai != \'ประเภท\' OR unit_english != \'ประเภท\' )', 1, 'successfully'),
(273, '2017-01-23 20:50:23', '2017-01-23 13:50:23', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ลักษณะ\',name_english=\'Shape\',description=\'Shape\',product_catagories_id=5,unit_thai=\'ประเภท\',unit_english=\'ประเภท\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ลักษณะ\' OR name_english != \'Shape\' OR description != \'Shape\' OR product_catagories_id != 5 OR unit_thai != \'ประเภท\' OR unit_english != \'ประเภท\' )', 1, 'successfully'),
(274, '2017-01-23 20:59:09', '2017-01-23 13:59:09', 1, 'product_attribute_option', 2, 1, 'INSERT', 'INSERT INTO product_attribute_option (id,created,modified,owner,name_thai,name_english,product_attribute_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'วันพีช\',\'One Piece\',1)', 1, 'successfully'),
(275, '2017-01-23 21:00:03', '2017-01-23 14:00:03', 1, 'product_attribute_option', 3, 1, 'INSERT', 'INSERT INTO product_attribute_option (id,created,modified,owner,name_thai,name_english,product_attribute_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ทูพีช\',\'Two Piece\',1)', 1, 'successfully'),
(276, '2017-01-23 21:00:06', '2017-01-23 14:00:06', 1, 'product_attribute_option', 4, 1, 'INSERT', 'INSERT INTO product_attribute_option (id,created,modified,owner,name_thai,name_english,product_attribute_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ทูพีช\',\'Two Pieces\',1)', 1, 'successfully'),
(277, '2017-01-23 21:00:12', '2017-01-23 14:00:12', 1, 'product_attribute_option', 2, 1, 'UPDATE', 'UPDATE product_attribute_option SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name_thai=\'ทูพีช\',name_english=\'Two Pieces\',product_attribute_id=1 WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name_thai != \'ทูพีช\' OR name_english != \'Two Pieces\' OR product_attribute_id != 1 )', 1, 'successfully'),
(278, '2017-01-23 21:01:59', '2017-01-23 14:01:59', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ประเภท\',name_english=\'ประเภท\',description=\'ประเภท\',product_catagories_id=5,unit_thai=\'แบบ\',unit_english=\'แบบ\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ประเภท\' OR name_english != \'ประเภท\' OR description != \'ประเภท\' OR product_catagories_id != 5 OR unit_thai != \'แบบ\' OR unit_english != \'แบบ\' )', 1, 'successfully'),
(279, '2017-01-23 21:02:26', '2017-01-23 14:02:26', 1, 'product_attribute', 3, 1, 'INSERT', 'INSERT INTO product_attribute (id,created,modified,owner,name,name_english,description,product_catagories_id,unit_thai,unit_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ระบบนํ้า\',\'ระบบนํ้า\',\'ระบบนํ้า\',5,\'แบบ\',\'แบบ\')', 1, 'successfully'),
(280, '2017-01-23 21:03:22', '2017-01-23 14:03:22', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ประเภท\',name_english=\'ประเภท\',description=\'ประเภท\',product_catagories_id=5,unit_thai=\'\',unit_english=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ประเภท\' OR name_english != \'ประเภท\' OR description != \'ประเภท\' OR product_catagories_id != 5 OR unit_thai != \'\' OR unit_english != \'\' )', 1, 'successfully'),
(281, '2017-01-23 21:03:27', '2017-01-23 14:03:27', 1, 'product_attribute', 2, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ระบบนํ้า\',name_english=\'ระบบนํ้า\',description=\'ระบบนํ้า\',product_catagories_id=5,unit_thai=\'\',unit_english=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ระบบนํ้า\' OR name_english != \'ระบบนํ้า\' OR description != \'ระบบนํ้า\' OR product_catagories_id != 5 OR unit_thai != \'\' OR unit_english != \'\' )', 1, 'successfully'),
(282, '2017-01-23 21:03:49', '2017-01-23 14:03:49', 1, 'product_attribute_option', 3, 1, 'UPDATE', 'UPDATE product_attribute_option SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name_thai=\'ทอเนโด\',name_english=\'Tornado\',product_attribute_id=2 WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name_thai != \'ทอเนโด\' OR name_english != \'Tornado\' OR product_attribute_id != 2 )', 1, 'successfully'),
(283, '2017-01-23 21:29:29', '2017-01-23 14:29:29', 1, 'product_attribute_value', 2, 1, 'INSERT', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1)', 1, 'successfully'),
(284, '2017-01-23 21:37:46', '2017-01-23 14:37:46', 1, 'product_attribute', 1, 1, 'UPDATE', 'UPDATE product_attribute SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_attribute_parent_id=1,name=\'root\',name_english=\'root\',description=\'root\',product_catagories_id=1,unit_thai=\'\',unit_english=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_attribute_parent_id != 1 OR name != \'root\' OR name_english != \'root\' OR description != \'root\' OR product_catagories_id != 1 OR unit_thai != \'\' OR unit_english != \'\' )', 1, 'successfully'),
(285, '2017-01-23 21:38:19', '2017-01-23 14:38:19', 1, 'product_attribute', 4, 1, 'INSERT', 'INSERT INTO product_attribute (id,created,modified,owner,product_attribute_parent_id,name,name_english,description,product_catagories_id,unit_thai,unit_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,\'ประเภท\',\'ประเภท\',\'ประเภท\',5,\'\',\'\')', 1, 'successfully'),
(286, '2017-01-23 21:38:29', '2017-01-23 14:38:29', 1, 'product_attribute_option', 1, 1, 'UPDATE', 'UPDATE product_attribute_option SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'วันพีช\',name_english=\'One Piece\',product_attribute_id=3 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'วันพีช\' OR name_english != \'One Piece\' OR product_attribute_id != 3 )', 1, 'successfully'),
(287, '2017-01-23 21:38:35', '2017-01-23 14:38:35', 1, 'product_attribute_option', 2, 1, 'UPDATE', 'UPDATE product_attribute_option SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ทูพีช\',name_english=\'Two Pieces\',product_attribute_id=3 WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ทูพีช\' OR name_english != \'Two Pieces\' OR product_attribute_id != 3 )', 1, 'successfully'),
(288, '2017-01-23 22:24:04', '2017-01-23 15:24:04', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'รายงาน Stock สินค้าคงเหลือ ประจำวัน\',description=\'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'รายงาน Stock สินค้าคงเหลือ ประจำวัน\' OR description != \'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(289, '2017-01-23 22:39:46', '2017-01-23 15:39:46', 1, 'task', 32, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,2,1,1,\'ไทย\',\'ระบุร้านค้า กับ พนักงาน PC\',\'ระบุร้านค้า กับ พนักงาน PC\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(290, '2017-01-23 22:49:19', '2017-01-23 15:49:19', 1, 'job', 13, 1, 'INSERT', 'INSERT INTO job (id,created,modified,owner,job_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,\'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\',\'\',\'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\')', 1, 'successfully'),
(291, '2017-01-23 22:49:50', '2017-01-23 15:49:50', 1, 'db_reference', 12, 1, 'UPDATE', 'UPDATE db_reference SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'retail_pc\',db_name=\'retail_pc\' WHERE id =12 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'retail_pc\' OR db_name != \'retail_pc\' )', 1, 'successfully'),
(292, '2017-01-23 22:51:34', '2017-01-23 15:51:34', 1, 'job', 12, 1, 'UPDATE', 'UPDATE job SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,job_parent_id=2,name=\'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\',name_english=\'Director of Distributor Development\',description=\'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\' WHERE id =12 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR job_parent_id != 2 OR name != \'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\' OR name_english != \'Director of Distributor Development\' OR description != \'ผู้อำนวยการฝ่ายพัฒนาช่องทางการจัดจำหน่าย\' )', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(293, '2017-01-23 22:52:38', '2017-01-23 15:52:38', 1, 'task', 31, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=12,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'ระบุร้านค้า กับ พนักงาน PC\',description=\'ระบุร้านค้า กับ พนักงาน PC\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =31 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 12 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'ระบุร้านค้า กับ พนักงาน PC\' OR description != \'ระบุร้านค้า กับ พนักงาน PC\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(294, '2017-01-23 22:55:37', '2017-01-23 15:55:37', 1, 'employee', 5, 1, 'INSERT', 'INSERT INTO employee (id,created,modified,owner,name,firstname_thai,lastname_thai,firstname_english,lastname_english,phone,email,address,amphur_id,province_id,start_date,join_date,national_id,bank_account) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'พี่น็อต\',\'กิตติวุฒิ\',\'ศิริศิลป์\',\'Kittiwut\',\'Sirisilp\',\'\',\'\',\'\',843,7,\'2017-01-15\',\'2018-01-15\',\'\',\'\')', 1, 'successfully'),
(295, '2017-01-23 22:56:30', '2017-01-23 15:56:30', 1, 'job_log', 7, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,12,4,1)', 1, 'successfully'),
(296, '2017-01-23 22:56:40', '2017-01-23 15:56:40', 1, 'employee', 4, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'น็อต\',firstname_thai=\'กิตติวุฒิ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Kittiwut\',lastname_english=\'Sirisilp\',phone=\'\',email=\'\',address=\'\',amphur_id=843,province_id=7,start_date=\'2017-01-15\',join_date=\'2018-01-15\',national_id=\'\',bank_account=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'น็อต\' OR firstname_thai != \'กิตติวุฒิ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Kittiwut\' OR lastname_english != \'Sirisilp\' OR phone != \'\' OR email != \'\' OR address != \'\' OR amphur_id != 843 OR province_id != 7 OR start_date != \'2017-01-15\' OR join_date != \'2018-01-15\' OR national_id != \'\' OR bank_account != \'\' )', 1, 'successfully'),
(297, '2017-01-23 22:58:35', '2017-01-23 15:58:35', 1, 'db_reference', 14, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product_catagories\',\'product_catagories\')', 1, 'successfully'),
(298, '2017-01-23 22:58:45', '2017-01-23 15:58:45', 1, 'task_db_log', 22, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=28,db_reference_id=13 WHERE id =22 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 28 OR db_reference_id != 13 )', 1, 'successfully'),
(299, '2017-01-23 22:58:50', '2017-01-23 15:58:50', 1, 'task_db_log', 23, 1, 'UPDATE', 'UPDATE task_db_log SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_id=29,db_reference_id=13 WHERE id =23 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_id != 29 OR db_reference_id != 13 )', 1, 'successfully'),
(300, '2017-01-23 22:59:32', '2017-01-23 15:59:32', 1, 'task_db_log', 25, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,31,12)', 1, 'successfully'),
(301, '2017-01-23 23:02:03', '2017-01-23 16:02:03', 1, 'db_reference', 15, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'retail_stock_report\',\'retail_stock_report\')', 1, 'successfully'),
(302, '2017-01-23 23:02:31', '2017-01-23 16:02:31', 1, 'task_db_log', 26, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,30,14)', 1, 'successfully'),
(303, '2017-01-23 23:03:46', '2017-01-23 16:03:46', 1, 'task', 33, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,12,843,7,\'ไทย\',\'แก้ไข ร้านค้า กับ พนักงาน PC\',\'แก้ไข ร้านค้า กับ พนักงาน PC\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(304, '2017-01-23 23:04:15', '2017-01-23 16:04:15', 1, 'task', 31, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=12,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'ระบุ ร้านค้า กับ พนักงาน PC\',description=\'ระบุร้านค้า กับ พนักงาน PC\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =31 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 12 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'ระบุ ร้านค้า กับ พนักงาน PC\' OR description != \'ระบุร้านค้า กับ พนักงาน PC\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(305, '2017-01-23 23:04:43', '2017-01-23 16:04:43', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'รายงาน สต็อค สินค้าคงเหลือ ประจำวัน\',description=\'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'รายงาน สต็อค สินค้าคงเหลือ ประจำวัน\' OR description != \'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(306, '2017-01-23 23:05:13', '2017-01-23 16:05:13', 1, 'task_db_log', 27, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,32,12)', 1, 'successfully'),
(307, '2017-01-23 23:05:28', '2017-01-23 16:05:28', 1, 'job_log', 8, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,12,1,1)', 1, 'successfully'),
(308, '2017-01-23 23:28:14', '2017-01-23 16:28:14', 1, 'agent_type', 2, 1, 'INSERT', 'INSERT INTO agent_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'Moderntrade\',\'Moderntrade\')', 1, 'successfully'),
(309, '2017-01-23 23:31:49', '2017-01-23 16:31:49', 1, 'agent_type', 3, 1, 'INSERT', 'INSERT INTO agent_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'as\',\'Sad\')', 1, 'successfully'),
(310, '2017-01-23 23:34:02', '2017-01-23 16:34:02', 1, 'agent_type', 2, 1, 'UPDATE', 'UPDATE agent_type SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ร้านค้า\',description=\'ร้านค้า\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ร้านค้า\' OR description != \'ร้านค้า\' )', 1, 'successfully'),
(311, '2017-01-23 23:47:22', '2017-01-23 16:47:22', 1, 'region', 1, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ภาคเหนือ\',description=\'North\',region_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ภาคเหนือ\' OR description != \'North\' OR region_parent_id != 1 )', 1, 'successfully'),
(312, '2017-01-23 23:47:53', '2017-01-23 16:47:53', 1, 'region', 1, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'root\',description=\'root\',region_parent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'root\' OR description != \'root\' OR region_parent_id != 1 )', 1, 'successfully'),
(313, '2017-01-23 23:47:59', '2017-01-23 16:47:59', 1, 'region', 3, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคตะวันออกเฉียงเหนือ\',\'ภาคตะวันออกเฉียงเหนือ\',1)', 1, 'successfully'),
(314, '2017-01-23 23:48:11', '2017-01-23 16:48:11', 1, 'region', 4, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคเหนือ\',\'ภาคเหนือ\',1)', 1, 'successfully'),
(315, '2017-01-23 23:48:16', '2017-01-23 16:48:16', 1, 'region', 5, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคกลาง\',\'ภาคกลาง\',1)', 1, 'successfully'),
(316, '2017-01-23 23:48:31', '2017-01-23 16:48:31', 1, 'region', 6, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคตะวันออก\',\'ภาคตะวันออก\',1)', 1, 'successfully'),
(317, '2017-01-23 23:48:37', '2017-01-23 16:48:37', 1, 'region', 7, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคใต้\',\'ภาคใต้\',1)', 1, 'successfully'),
(318, '2017-01-23 23:48:46', '2017-01-23 16:48:46', 1, 'region', 8, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคตะวันออกเฉียงเหนือ\',\'ภาคตะวันออกเฉียงเหนือ\',1)', 1, 'successfully'),
(319, '2017-01-23 23:48:59', '2017-01-23 16:48:59', 1, 'region', 9, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'ภาคตะวันตก\',\'ภาคตะวันตก\',1)', 1, 'successfully'),
(320, '2017-01-23 23:50:23', '2017-01-23 16:50:23', 1, 'region', 7, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'สาธารณรัฐประชาธิปไตยประชาชนลาว\',description=\'สาธารณรัฐประชาธิปไตยประชาชนลาว\',region_parent_id=1 WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'สาธารณรัฐประชาธิปไตยประชาชนลาว\' OR description != \'สาธารณรัฐประชาธิปไตยประชาชนลาว\' OR region_parent_id != 1 )', 1, 'successfully'),
(321, '2017-01-23 23:50:54', '2017-01-23 16:50:54', 1, 'region', 7, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'สาธารณรัฐแห่งสหภาพพม่า\',description=\'สาธารณรัฐแห่งสหภาพพม่า\',region_parent_id=1 WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'สาธารณรัฐแห่งสหภาพพม่า\' OR description != \'สาธารณรัฐแห่งสหภาพพม่า\' OR region_parent_id != 1 )', 1, 'successfully'),
(322, '2017-01-23 23:51:13', '2017-01-23 16:51:13', 1, 'region', 7, 1, 'UPDATE', 'UPDATE region SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'พระราชาณาจักรกัมพูชา\',description=\'พระราชาณาจักรกัมพูชา\',region_parent_id=1 WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'พระราชาณาจักรกัมพูชา\' OR description != \'พระราชาณาจักรกัมพูชา\' OR region_parent_id != 1 )', 1, 'successfully'),
(323, '2017-01-23 23:51:45', '2017-01-23 16:51:45', 1, 'region', 10, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'สาธารณรัฐแห่งสหภาพพม่า\',\'สาธารณรัฐแห่งสหภาพพม่า\',1)', 1, 'successfully'),
(324, '2017-01-23 23:51:57', '2017-01-23 16:51:57', 1, 'region', 11, 1, 'INSERT', 'INSERT INTO region (id,created,modified,owner,name,description,region_parent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'สาธารณรัฐประชาธิปไตยประชาชนลาว\',\'สาธารณรัฐประชาธิปไตยประชาชนลาว\',1)', 1, 'successfully'),
(325, '2017-01-23 23:57:06', '2017-01-23 16:57:06', 1, 'job_log', 9, 1, 'INSERT', 'INSERT INTO job_log (id,created,modified,owner,job_id,employee_id,job_log_status_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,11,1,1)', 1, 'successfully'),
(326, '2017-01-24 00:01:20', '2017-01-23 17:01:20', 1, 'agent', 2, 1, 'INSERT', 'INSERT INTO agent (id,created,modified,owner,name,phone,description,region_id,agent_type_id,province_id,bank_account_1,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'วู็ดแอนด์เซรามิค\',\'\',\'\',4,2,7,\'\',\'\',\'\')', 1, 'successfully'),
(327, '2017-01-24 00:02:47', '2017-01-23 17:02:47', 1, 'retail_pc', 2, 1, 'INSERT', 'INSERT INTO retail_pc (id,created,modified,owner,employee_id,agent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1)', 1, 'successfully'),
(328, '2017-01-24 00:05:07', '2017-01-23 17:05:07', 1, 'task_action_type', 6, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'INSERT_CREDENTIAL\',\'INSERT_CREDENTIAL\')', 1, 'successfully'),
(329, '2017-01-24 00:05:21', '2017-01-23 17:05:21', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=5,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country_id=\'ไทย\',name=\'รายงาน สต็อค สินค้าคงเหลือ ประจำวัน\',description=\'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 5 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country_id != \'ไทย\' OR name != \'รายงาน สต็อค สินค้าคงเหลือ ประจำวัน\' OR description != \'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(330, '2017-01-24 00:15:51', '2017-01-23 17:15:51', 1, 'retail_pc', 1, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,employee_id=3,agent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR employee_id != 3 OR agent_id != 1 )', 1, 'successfully'),
(331, '2017-01-24 00:16:43', '2017-01-23 17:16:43', 1, 'agent', 3, 1, 'INSERT', 'INSERT INTO agent (id,created,modified,owner,name,phone,description,region_id,agent_type_id,province_id,bank_account_1,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'testt\',\'\',\'\',2,2,2,\'\',\'\',\'\')', 1, 'successfully'),
(332, '2017-01-24 00:16:50', '2017-01-23 17:16:50', 1, 'retail_pc', 3, 1, 'INSERT', 'INSERT INTO retail_pc (id,created,modified,owner,employee_id,agent_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2)', 1, 'successfully'),
(333, '2017-01-24 00:27:58', '2017-01-23 17:27:58', 1, 'retail_pc', 2, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=3,agent_id=2 WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 3 OR agent_id != 2 )', 1, 'successfully'),
(334, '2017-01-24 00:29:05', '2017-01-23 17:29:05', 1, 'retail_pc', 2, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=1,agent_id=2 WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 1 OR agent_id != 2 )', 1, 'successfully'),
(335, '2017-01-24 01:14:19', '2017-01-23 18:14:19', 1, 'retail_pc', 1, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=1,agent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 1 OR agent_id != 1 )', 1, 'successfully'),
(336, '2017-01-24 01:17:49', '2017-01-23 18:17:49', 1, 'retail_stock_report', 2, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,retail_pc_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(337, '2017-01-24 01:25:55', '2017-01-23 18:25:55', 1, 'retail_pc', 1, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=2,agent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 2 OR agent_id != 1 )', 1, 'successfully'),
(338, '2017-01-24 01:30:10', '2017-01-23 18:30:10', 1, 'retail_pc', 1, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=1,agent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 1 OR agent_id != 1 )', 1, 'successfully'),
(339, '2017-01-24 01:30:21', '2017-01-23 18:30:21', 1, 'retail_stock_report', 3, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(340, '2017-01-24 01:30:51', '2017-01-23 18:30:51', 1, 'retail_stock_report', 4, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,20,1,2)', 1, 'successfully'),
(341, '2017-01-24 01:42:37', '2017-01-23 18:42:37', 1, 'retail_stock_report', 5, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(342, '2017-01-24 01:50:53', '2017-01-23 18:50:53', 1, 'retail_stock_report', 6, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(343, '2017-01-24 01:51:37', '2017-01-23 18:51:37', 1, 'retail_stock_report', 7, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(344, '2017-01-24 01:51:50', '2017-01-23 18:51:50', 1, 'retail_stock_report', 8, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(345, '2017-01-24 01:53:46', '2017-01-23 18:53:46', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,2)', 1, 'successfully'),
(346, '2017-01-24 10:07:25', '2017-01-24 03:07:25', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'s\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'s\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(347, '2017-01-24 10:07:25', '2017-01-24 03:07:25', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'s\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'s\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(348, '2017-01-24 10:07:31', '2017-01-24 03:07:31', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(349, '2017-01-24 10:07:31', '2017-01-24 03:07:31', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMONu\',city=\'ROOM 201 NO\',province=\'\',country=\'\',email=\'\',phone=\'\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMONu\' OR city != \'ROOM 201 NO\' OR province != \'\' OR country != \'\' OR email != \'\' OR phone != \'\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(350, '2017-01-24 10:12:16', '2017-01-24 03:12:16', 1, 'province', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GUANGDONG SITONG GROUP CO.,LTD\',description=\'SITONG=BBRIAN\',city=\'B11-41 SOUTH AREA CHAO ZHOU RAILWAY\',province=\'STATION DEVELOPING AREA GUANGDONG\',country=\'CHINA\',email=\'\',phone=\'0086-1382-7341-981\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GUANGDONG SITONG GROUP CO.,LTD\' OR description != \'SITONG=BBRIAN\' OR city != \'B11-41 SOUTH AREA CHAO ZHOU RAILWAY\' OR province != \'STATION DEVELOPING AREA GUANGDONG\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-1382-7341-981\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(351, '2017-01-24 10:12:16', '2017-01-24 03:12:16', 1, 'supplier', 2, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GUANGDONG SITONG GROUP CO.,LTD\',description=\'SITONG=BBRIAN\',city=\'B11-41 SOUTH AREA CHAO ZHOU RAILWAY\',province=\'STATION DEVELOPING AREA GUANGDONG\',country=\'CHINA\',email=\'\',phone=\'0086-1382-7341-981\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GUANGDONG SITONG GROUP CO.,LTD\' OR description != \'SITONG=BBRIAN\' OR city != \'B11-41 SOUTH AREA CHAO ZHOU RAILWAY\' OR province != \'STATION DEVELOPING AREA GUANGDONG\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-1382-7341-981\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(352, '2017-01-24 10:38:22', '2017-01-24 03:38:22', 1, 'supplier', 4, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'SHENZHEN JIAYUHE IMP.&EXP.CO.,LTD\',\'FENNY\',\'RM709 WENJINDU EXPORT CUSTOMS\',\'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\',\'CHINDA\',\'\',\'0086-768-6933518\',\'\',\'\',\'\')', 1, 'successfully'),
(353, '2017-01-24 10:39:23', '2017-01-24 03:39:23', 1, 'province', 3, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHENZHEN JIAYUHE IMP.&EXP.CO.,LTD\',description=\'FENNY\',city=\'RM709 WENJINDU EXPORT CUSTOMS\',province=\'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHENZHEN JIAYUHE IMP.&EXP.CO.,LTD\' OR description != \'FENNY\' OR city != \'RM709 WENJINDU EXPORT CUSTOMS\' OR province != \'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(354, '2017-01-24 10:39:23', '2017-01-24 03:39:23', 1, 'supplier', 3, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHENZHEN JIAYUHE IMP.&EXP.CO.,LTD\',description=\'FENNY\',city=\'RM709 WENJINDU EXPORT CUSTOMS\',province=\'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHENZHEN JIAYUHE IMP.&EXP.CO.,LTD\' OR description != \'FENNY\' OR city != \'RM709 WENJINDU EXPORT CUSTOMS\' OR province != \'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(355, '2017-01-24 10:39:39', '2017-01-24 03:39:39', 1, 'province', 3, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHENZHEN JIAYUHE IMP.& EXP. CO.,LTD\',description=\'FENNY\',city=\'RM709 WENJINDU EXPORT CUSTOMS\',province=\'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHENZHEN JIAYUHE IMP.& EXP. CO.,LTD\' OR description != \'FENNY\' OR city != \'RM709 WENJINDU EXPORT CUSTOMS\' OR province != \'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(356, '2017-01-24 10:39:39', '2017-01-24 03:39:39', 1, 'supplier', 3, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'SHENZHEN JIAYUHE IMP.& EXP. CO.,LTD\',description=\'FENNY\',city=\'RM709 WENJINDU EXPORT CUSTOMS\',province=\'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\',country=\'CHINA\',email=\'\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'SHENZHEN JIAYUHE IMP.& EXP. CO.,LTD\' OR description != \'FENNY\' OR city != \'RM709 WENJINDU EXPORT CUSTOMS\' OR province != \'DECLARATION BUILDING SOUTH YANHE RD SHENZHEN\' OR country != \'CHINA\' OR email != \'\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(357, '2017-01-24 10:41:12', '2017-01-24 03:41:12', 2, 'supplier', 5, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHENZHEN XINYAONGYONGHONG IMP&EXP TRADE LIMITED COMPANY CHINA\',\'FANNY\',\'ROOM 623 ALONG WATERWAY MAN KAM TO EXPORT\',\'DECLARATION BUILDING LUOHU AREA SHENZHEN\',\'CHINA\',\'\',\'0086-013433788155\',\'\',\'\',\'\')', 1, 'successfully'),
(358, '2017-01-24 10:43:10', '2017-01-24 03:43:10', 1, 'task', 27, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข สินค้า\',description=\'เพิ่ม สินค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =27 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข สินค้า\' OR description != \'เพิ่ม สินค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(359, '2017-01-24 10:43:36', '2017-01-24 03:43:36', 2, 'supplier', 6, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHUNDE ELITE IMPORT AND EXPORT CO.,LTD.\',\'ANDY\',\'NO.5047 ROAD\',\'SHENNAN DONG SHENZHEN\',\'CHINA\',\'\',\'0086-13760918639\',\'\',\'\',\'\')', 1, 'successfully'),
(360, '2017-01-24 10:45:30', '2017-01-24 03:45:30', 2, 'supplier', 7, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN ITO IMP. & EXP. CO.,LTD.\',\'DAVID\',\'BLDG.3 HONGYI CERAMICS-CITY\',\'WUGANG RD.FOSHAN GUANGDONG\',\'CHINA\',\'davidlai2000@vip.163.com\',\'0086-757-83300640\',\'\',\'\',\'\')', 1, 'successfully'),
(361, '2017-01-24 10:46:22', '2017-01-24 03:46:22', 2, 'province', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'marketing@huiquan-chaozhou.com.cn, zheng.202@qq.com\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'marketing@huiquan-chaozhou.com.cn, zheng.202@qq.com\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(362, '2017-01-24 10:46:22', '2017-01-24 03:46:22', 2, 'supplier', 1, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHANTOU JIXIANG TRADING CO.,LTD.\',description=\'EMON1=MANGO, EMON2=FENNIE\',city=\'ROOM 201 NO.32\',province=\'CHANGPING ROAD\',country=\'CHINA\',email=\'marketing@huiquan-chaozhou.com.cn, zheng.202@qq.com\',phone=\'0086-768-6933518\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHANTOU JIXIANG TRADING CO.,LTD.\' OR description != \'EMON1=MANGO, EMON2=FENNIE\' OR city != \'ROOM 201 NO.32\' OR province != \'CHANGPING ROAD\' OR country != \'CHINA\' OR email != \'marketing@huiquan-chaozhou.com.cn, zheng.202@qq.com\' OR phone != \'0086-768-6933518\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(363, '2017-01-24 10:49:42', '2017-01-24 03:49:42', 2, 'supplier', 8, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.\',\'ALEX\',\'18F GREEN CITY TRADING SQUARE\',\'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU\',\'CHINA\',\'\',\'0086-571-22877912\',\'\',\'\',\'\')', 1, 'successfully'),
(364, '2017-01-24 10:50:29', '2017-01-24 03:50:29', 2, 'supplier', 9, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'HANGZHOU SUNLIGHT TRADE CO.,LTD.\',\'ALLAN\',\'503/4# KAIYUANMINGDU XIAOSHAN\',\'HANGZHOU ZHEJIANG\',\'CHINA\',\'\',\'0086-138-68002641\',\'\',\'\',\'\')', 1, 'successfully'),
(365, '2017-01-24 10:51:44', '2017-01-24 03:51:44', 2, 'supplier', 10, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN GAOMING HENGRUI EXP.& IMP.CO.,LTD.\',\'BATHWOOD=SUNEE\',\'NO.56 CANGJIANG RD HECHENG GAOMING DISTRICT\',\'FOSHAN CITY GUANGDONG\',\'CHINA\',\'t.zhouqing@hotmail.com \',\'0086-138-26157838\',\'\',\'\',\'\')', 1, 'successfully'),
(366, '2017-01-24 10:52:15', '2017-01-24 03:52:15', 2, 'province', 7, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.\',description=\'ALEX\',city=\'18F GREEN CITY TRADING SQUARE\',province=\'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU\',country=\'CHINA\',email=\'alex@chinashowerroom.com\',phone=\'0086-571-22877912\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.\' OR description != \'ALEX\' OR city != \'18F GREEN CITY TRADING SQUARE\' OR province != \'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU\' OR country != \'CHINA\' OR email != \'alex@chinashowerroom.com\' OR phone != \'0086-571-22877912\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(367, '2017-01-24 10:52:15', '2017-01-24 03:52:15', 2, 'supplier', 7, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.\',description=\'ALEX\',city=\'18F GREEN CITY TRADING SQUARE\',province=\'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU\',country=\'CHINA\',email=\'alex@chinashowerroom.com\',phone=\'0086-571-22877912\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'HANGZHOU KINGSUN IMP.&EXP.CO.,LTD.\' OR description != \'ALEX\' OR city != \'18F GREEN CITY TRADING SQUARE\' OR province != \'NO.819 MIDDLE SHIXIN ROAD XIAOSHAN HANGZHOU\' OR country != \'CHINA\' OR email != \'alex@chinashowerroom.com\' OR phone != \'0086-571-22877912\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(368, '2017-01-24 10:57:01', '2017-01-24 03:57:01', 2, 'supplier', 11, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN SINCERE BUILDING MATERIALS CO.,LTD.\',\'POLISHED TILES=CINDY, MIKI\',\'FOSHAN INTERNATIONAL CERAMICS EXHIBITION CENTER\',\'LOT BO.20-21 BLOCK A3 4TH JIHUA ROAD FOSHAN \',\'CHINA\',\'cindy@sincerechina.net\',\'0086-159-15204091\',\'\',\'\',\'\')', 1, 'successfully'),
(369, '2017-01-24 10:59:14', '2017-01-24 03:59:14', 2, 'supplier', 12, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA\',\'LETOP=SOPHIA\',\'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST\',\'LUOHU SHENZHEN\',\'CHINA\',\'\',\'0086-768-6837092\',\'\',\'\',\'\')', 1, 'successfully'),
(370, '2017-01-24 11:00:05', '2017-01-24 04:00:05', 2, 'supplier', 13, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\',\'SUNLIGHT=AARON\',\'INDUSTRY AREA DANGSHAN HANGZHOU\',\'ZHEJIANG\',\'CHINA 311245\',\'\',\'0086-571-82531666\',\'\',\'\',\'\')', 1, 'successfully'),
(371, '2017-01-24 11:04:40', '2017-01-24 04:04:40', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',post_code=\'\',start_date=\'1970-01-01\',join_date=\'1970-01-01\',national_id=\'1101402029290\',bank_account=\'\',province_id=7,amphur_id=843 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR post_code != \'\' OR start_date != \'1970-01-01\' OR join_date != \'1970-01-01\' OR national_id != \'1101402029290\' OR bank_account != \'\' OR province_id != 7 OR amphur_id != 843 )', 1, 'successfully'),
(372, '2017-01-24 11:05:13', '2017-01-24 04:05:13', 1, 'employee', 1, 1, 'UPDATE', 'UPDATE employee SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'ซี\',firstname_thai=\'สิรภพ\',lastname_thai=\'ศิริศิลป์\',firstname_english=\'Siraphop\',lastname_english=\'Sirisilp\',phone=\'0802689444\',email=\'seawaykung@gmail.com\',address=\'52 ปรางค์สามยอด\',post_code=\'\',start_date=\'2017-01-15\',join_date=\'2017-01-15\',national_id=\'1101402029290\',bank_account=\'\',province_id=7,amphur_id=843 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'ซี\' OR firstname_thai != \'สิรภพ\' OR lastname_thai != \'ศิริศิลป์\' OR firstname_english != \'Siraphop\' OR lastname_english != \'Sirisilp\' OR phone != \'0802689444\' OR email != \'seawaykung@gmail.com\' OR address != \'52 ปรางค์สามยอด\' OR post_code != \'\' OR start_date != \'2017-01-15\' OR join_date != \'2017-01-15\' OR national_id != \'1101402029290\' OR bank_account != \'\' OR province_id != 7 OR amphur_id != 843 )', 1, 'successfully'),
(373, '2017-01-24 11:18:18', '2017-01-24 04:18:18', 2, 'supplier', 14, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN HONGRUI TRADE CORPORATION LTD.\',\'TIANYA=MILDRED\',\'NO.56 CANGJIANG ROAD HECHENG\',\'GAOMING DISTRICT FOSHAN CITY\',\'CHINA\',\'\',\'\',\'0086-136-30146193\',\'\',\'\',\'\')', 1, 'successfully'),
(374, '2017-01-24 11:24:18', '2017-01-24 04:24:18', 2, 'supplier', 15, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GLOBAL WELSUN CO.,LTD.\',\'SHOWER DOOR MASSAGE BATHUB=FLOSSY\',\'ROOM 951 9/F GUANGFA BLDG\',\'DONGMEN SHOUTH ROAD, SHENZHEN\',\'CHINA \',\'\',\'dandan-18@qq.com\',\'0086-133-92229204\',\'\',\'\',\'\')', 1, 'successfully'),
(375, '2017-01-24 11:25:33', '2017-01-24 04:25:33', 2, 'supplier', 16, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHENZHEN LIJIATONGDA TRADE CO.,LTD.\',\'JIALONG=GLADDYS\',\'NO.8 ROAD FENGER INDUSTRIAL AREA\',\'GUXIANG TOWN CHAOAN GUANGDONG\',\'CHINA\',\'\',\'\',\'0086-768-6926158\',\'\',\'\',\'\')', 1, 'successfully'),
(376, '2017-01-24 11:27:22', '2017-01-24 04:27:22', 1, 'task', 34, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่ม ผู้ประกอบการค้า\',\'เพิ่ม ผู้ประกอบการค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(377, '2017-01-24 11:27:31', '2017-01-24 04:27:31', 1, 'task', 35, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข ผู้ประกอบการค้า\',\'เพิ่ม ผู้ประกอบการค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(378, '2017-01-24 11:28:25', '2017-01-24 04:28:25', 1, 'task', 36, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เชื่อม ผู้ประกอบการค้า กับ โรงงาน\',\'เชื่อม ผู้ประกอบการค้า กับ โรงงาน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(379, '2017-01-24 11:28:33', '2017-01-24 04:28:33', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country_id,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข ผู้ประกอบการค้า กับ โรงงาน\',\'เชื่อม ผู้ประกอบการค้า กับ โรงงาน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(380, '2017-01-24 11:30:50', '2017-01-24 04:30:50', 1, 'db_reference', 16, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'supplier_link_trader\',\'supplier_link_trader\')', 1, 'successfully'),
(381, '2017-01-24 11:30:57', '2017-01-24 04:30:57', 1, 'db_reference', 17, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'trader\',\'trader\')', 1, 'successfully'),
(382, '2017-01-24 11:31:24', '2017-01-24 04:31:24', 1, 'task_db_log', 28, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,33,16)', 1, 'successfully'),
(383, '2017-01-24 11:31:28', '2017-01-24 04:31:28', 1, 'task_db_log', 29, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,34,16)', 1, 'successfully'),
(384, '2017-01-24 11:31:34', '2017-01-24 04:31:34', 1, 'task_db_log', 30, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,35,15)', 1, 'successfully'),
(385, '2017-01-24 11:31:38', '2017-01-24 04:31:38', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,36,15)', 1, 'successfully'),
(386, '2017-01-24 11:41:19', '2017-01-24 04:41:19', 2, 'supplier', 17, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'HANGZHOU HUASHEN MIRROR INDUSTRY CO.,LTD.\',\'MIRROR PROJECT : HELLER\',\'NO.64 DANGKE ROAD DANGSHAN TOWN\',\'XIAOSHAN DISTRICT HANGZHOU\',\'CHINA\',\'\',\'\',\'0086-571-82523381\',\'\',\'\',\'\')', 1, 'successfully'),
(387, '2017-01-24 11:42:39', '2017-01-24 04:42:39', 2, 'supplier', 2, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'LAND CAPITAL INTERNATIONAL LIMITED\',\'CLASSIC WASH BASIN : JASSE\',\'1521 15/F INNERWAY BLDG HONGYUAN RD\',\'DONGGUAN CITY GUANGCONG\',\'CHINA\',\'\',\'\',\'0086-769-22412138\',\'\',\'\',\'\')', 1, 'successfully'),
(388, '2017-01-24 11:44:07', '2017-01-24 04:44:07', 2, 'supplier', 2, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHENZHEN YIHAODI IMPORT AND EXPORT CO.,LTD.\',\'BOMEI TWO PIECE LOW COST : ABLE\',\'FUQING NO.1 ROAD\',\'CHAOZHOU\',\'CHINA\',\'\',\'\',\'0768-6874406\',\'\',\'\',\'\')', 1, 'successfully'),
(389, '2017-01-24 11:45:25', '2017-01-24 04:45:25', 2, 'supplier', 2, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN CITY JINHUALI HOUSEHOLD ELECTRICAL APPLIANCE CO.,LTD.\',\'COOKING RANGE :ANGELA\',\'6 JIANGYI RD JIANG YI INDUSTRIAL PARK\',\'LE LIU TOWN SHUNDE FOSHAN GUANGDONG\',\'CHINA\',\'\',\'\',\'0086-0757-25523788\',\'\',\'\',\'\')', 1, 'successfully'),
(390, '2017-01-24 11:54:13', '2017-01-24 04:54:13', 1, 'supplier_link_trader', 2, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,trader_id,supplier_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1)', 1, 'successfully'),
(391, '2017-01-24 11:56:17', '2017-01-24 04:56:17', 1, 'supplier_link_trader', 2, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,trader_id,supplier_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1)', 1, 'successfully'),
(392, '2017-01-24 11:56:22', '2017-01-24 04:56:22', 1, 'supplier_link_trader', 1, 1, 'UPDATE', 'UPDATE supplier_link_trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,trader_id=1,supplier_id=2 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR trader_id != 1 OR supplier_id != 2 )', 1, 'successfully'),
(393, '2017-01-24 11:56:28', '2017-01-24 04:56:28', 1, 'supplier_link_trader', 1, 1, 'UPDATE', 'UPDATE supplier_link_trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,trader_id=1,supplier_id=4 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR trader_id != 1 OR supplier_id != 4 )', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(394, '2017-01-24 11:58:47', '2017-01-24 04:58:47', 1, 'task', 33, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ผู้ประกอบการค้า\',description=\'เพิ่ม ผู้ประกอบการค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =33 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ผู้ประกอบการค้า\' OR description != \'เพิ่ม ผู้ประกอบการค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(395, '2017-01-24 11:58:59', '2017-01-24 04:58:59', 1, 'task', 33, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ผู้ประกอบการค้า\',description=\'เพิ่ม ผู้ประกอบการค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =33 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ผู้ประกอบการค้า\' OR description != \'เพิ่ม ผู้ประกอบการค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(396, '2017-01-24 11:59:19', '2017-01-24 04:59:19', 1, 'task', 18, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'เพิ่ม ลูกค้า\',description=\'เพิ่ม ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =18 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'เพิ่ม ลูกค้า\' OR description != \'เพิ่ม ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(397, '2017-01-24 11:59:27', '2017-01-24 04:59:27', 1, 'task', 19, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=8,amphur_id=843,province_id=7,country_id=\'ไทย\',name=\'แก้ไข ลูกค้า\',description=\'แก้ไข ลูกค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 8 OR amphur_id != 843 OR province_id != 7 OR country_id != \'ไทย\' OR name != \'แก้ไข ลูกค้า\' OR description != \'แก้ไข ลูกค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(398, '2017-01-24 15:50:04', '2017-01-24 08:50:04', 2, 'supplier', 9, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'HANGZHOU HUASHEN MIRROR INDUSTRY CO.,LTD.\',\'MIRROR PROJECT : HELLER\',\'NO.64 DANGKE ROAD DANGSHAN TOWN\',\'XIAOSHAN DISTRICT HANGZHOU\',\'CHINA\',\'\',\'\',\'0086-571-82523381\',\'\',\'\',\'\')', 1, 'successfully'),
(399, '2017-01-24 15:51:48', '2017-01-24 08:51:48', 2, 'trader', 10, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'LAND CAPITAL INTERNATIONAL LIMITED\',\'TILES ARTSTONE:JASSE\',\'1521 15/F WINNERWAY BLDG\',\'HONGYUAN RD DONGGUAN CITY GUANGDONG\',\'CHINA\',\'\',\'\',\'0086-769-22412138\',\'\',\'\',\'\')', 1, 'successfully'),
(400, '2017-01-24 15:53:27', '2017-01-24 08:53:27', 2, 'trader', 11, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'SHENZHEN YIHAODI IMPORT AND EXPORT CO.,LTD.\',\'BOMEI : ABLE (2P LOW COST)\',\'FUQING NO.1 ROAD\',\'CHAOZHOU\',\'CHINA\',\'\',\'\',\'0768-6874406\',\'\',\'\',\'\')', 1, 'successfully'),
(401, '2017-01-24 15:56:24', '2017-01-24 08:56:24', 2, 'trader', 12, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGDONG SHUNDE FOREIGN TRADE DEVELOPMENT CO.,LTD.\',\'COOKING RANGE : ANGELA\',\'12 RONG QI MAIN ROAD, \',\'RONGGUI SHUNDE GUANGDONG \',\'CHINA\',\'\',\'\',\'0086-0757-25523788\',\'\',\'\',\'\')', 1, 'successfully'),
(402, '2017-01-24 15:59:17', '2017-01-24 08:59:17', 2, 'trader', 13, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'ZHOUGSHAN MEITU PLASTIC IND.,CO.,LTD.\',\'MEITU : BILLY\',\'DACHE INDUSTRIAL AREA,\',\'NANLANG,ZHONGSHAN,GUANGDONG\',\'CHINA\',\'\',\'\',\'86-760-85211111\',\'\',\'\',\'\')', 1, 'successfully'),
(403, '2017-01-24 15:59:55', '2017-01-24 08:59:55', 2, 'province', 6, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\',description=\'SUNLIGHT=AARON\',city=\'INDUSTRY AREA DANGSHAN HANGZHOU\',province=\'ZHEJIANG\',country=\'CHINA 311245\',post_code=\'\',email=\'master@zjsunlight.com, sales@zjsunlight.com\',phone=\'0086-571-82531666\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\' OR description != \'SUNLIGHT=AARON\' OR city != \'INDUSTRY AREA DANGSHAN HANGZHOU\' OR province != \'ZHEJIANG\' OR country != \'CHINA 311245\' OR post_code != \'\' OR email != \'master@zjsunlight.com, sales@zjsunlight.com\' OR phone != \'0086-571-82531666\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(404, '2017-01-24 15:59:55', '2017-01-24 08:59:55', 2, 'supplier', 6, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\',description=\'SUNLIGHT=AARON\',city=\'INDUSTRY AREA DANGSHAN HANGZHOU\',province=\'ZHEJIANG\',country=\'CHINA 311245\',post_code=\'\',email=\'master@zjsunlight.com, sales@zjsunlight.com\',phone=\'0086-571-82531666\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\' OR description != \'SUNLIGHT=AARON\' OR city != \'INDUSTRY AREA DANGSHAN HANGZHOU\' OR province != \'ZHEJIANG\' OR country != \'CHINA 311245\' OR post_code != \'\' OR email != \'master@zjsunlight.com, sales@zjsunlight.com\' OR phone != \'0086-571-82531666\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(405, '2017-01-24 16:00:42', '2017-01-24 09:00:42', 2, 'province', 7, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'FOSHAN HONGRUI TRADE CORPORATION LTD.\',description=\'TIANYA=MILDRED\',city=\'NO.56 CANGJIANG ROAD HECHENG\',province=\'GAOMING DISTRICT FOSHAN CITY\',country=\'CHINA\',post_code=\'\',email=\'mildredmak@yahoo.com.cn\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'FOSHAN HONGRUI TRADE CORPORATION LTD.\' OR description != \'TIANYA=MILDRED\' OR city != \'NO.56 CANGJIANG ROAD HECHENG\' OR province != \'GAOMING DISTRICT FOSHAN CITY\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'mildredmak@yahoo.com.cn\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(406, '2017-01-24 16:00:42', '2017-01-24 09:00:42', 2, 'trader', 7, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'FOSHAN HONGRUI TRADE CORPORATION LTD.\',description=\'TIANYA=MILDRED\',city=\'NO.56 CANGJIANG ROAD HECHENG\',province=\'GAOMING DISTRICT FOSHAN CITY\',country=\'CHINA\',post_code=\'\',email=\'mildredmak@yahoo.com.cn\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'FOSHAN HONGRUI TRADE CORPORATION LTD.\' OR description != \'TIANYA=MILDRED\' OR city != \'NO.56 CANGJIANG ROAD HECHENG\' OR province != \'GAOMING DISTRICT FOSHAN CITY\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'mildredmak@yahoo.com.cn\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(407, '2017-01-24 16:01:06', '2017-01-24 09:01:06', 2, 'province', 8, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHENZHEN LIJIATONGDA TRADE CO.,LTD.\',description=\'JIALONG=GLADDYS\',city=\'NO.8 ROAD FENGER INDUSTRIAL AREA\',province=\'GUXIANG TOWN CHAOAN GUANGDONG\',country=\'CHINA\',post_code=\'\',email=\'411747612@qq.com\',phone=\'0086-768-6926158\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =8 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHENZHEN LIJIATONGDA TRADE CO.,LTD.\' OR description != \'JIALONG=GLADDYS\' OR city != \'NO.8 ROAD FENGER INDUSTRIAL AREA\' OR province != \'GUXIANG TOWN CHAOAN GUANGDONG\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'411747612@qq.com\' OR phone != \'0086-768-6926158\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(408, '2017-01-24 16:01:06', '2017-01-24 09:01:06', 2, 'trader', 8, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHENZHEN LIJIATONGDA TRADE CO.,LTD.\',description=\'JIALONG=GLADDYS\',city=\'NO.8 ROAD FENGER INDUSTRIAL AREA\',province=\'GUXIANG TOWN CHAOAN GUANGDONG\',country=\'CHINA\',post_code=\'\',email=\'411747612@qq.com\',phone=\'0086-768-6926158\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =8 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHENZHEN LIJIATONGDA TRADE CO.,LTD.\' OR description != \'JIALONG=GLADDYS\' OR city != \'NO.8 ROAD FENGER INDUSTRIAL AREA\' OR province != \'GUXIANG TOWN CHAOAN GUANGDONG\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'411747612@qq.com\' OR phone != \'0086-768-6926158\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(409, '2017-01-24 16:01:27', '2017-01-24 09:01:27', 2, 'province', 6, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA\',description=\'LETOP=SOPHIA\',city=\'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST\',province=\'LUOHU SHENZHEN\',country=\'CHINA\',post_code=\'\',email=\'sophia@honli.com\',phone=\'0086-768-6837092\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA\' OR description != \'LETOP=SOPHIA\' OR city != \'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST\' OR province != \'LUOHU SHENZHEN\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'sophia@honli.com\' OR phone != \'0086-768-6837092\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(410, '2017-01-24 16:01:27', '2017-01-24 09:01:27', 2, 'trader', 6, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA\',description=\'LETOP=SOPHIA\',city=\'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST\',province=\'LUOHU SHENZHEN\',country=\'CHINA\',post_code=\'\',email=\'sophia@honli.com\',phone=\'0086-768-6837092\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA\' OR description != \'LETOP=SOPHIA\' OR city != \'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST\' OR province != \'LUOHU SHENZHEN\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'sophia@honli.com\' OR phone != \'0086-768-6837092\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(411, '2017-01-24 16:08:10', '2017-01-24 09:08:10', 2, 'supplier', 10, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGDONG XIONGFENG INDUSTRIES CO.,LTD.\',\'SEAT COVER 1619 1673 1674\',\'HUA AN SECOR ANJIE ROAD FENGTANG TOWN\',\'CHAOZHOU CITY GUANGDONG\',\'CHINA\',\'\',\'www.xiongfeng.com\',\'0086-768-6850111\',\'\',\'\',\'\')', 1, 'successfully'),
(412, '2017-01-24 16:09:40', '2017-01-24 09:09:40', 2, 'supplier', 11, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'ANSON INDUSTRIAL (CHAOZHOU) CO.,LIMITED\',\'SANITARY WARE ANBI\',\'GUXIANG INDUSTRIAL ZHONE\',\'CHAOZHOU GUANGDONG PROVINCE\',\'CHINA\',\'\',\'\',\'0086-768-2890601\',\'\',\'\',\'\')', 1, 'successfully'),
(413, '2017-01-24 16:11:02', '2017-01-24 09:11:02', 2, 'supplier', 12, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'PRIME TRADE INC.,\',\'TILES VIETNAM : TAMNT\',\'BINH XUYEN INDUSTRY ZONE BINH XUYEN\',\'DISTRICT VINH PHUC PROVINCE\',\'VIETNAM\',\'\',\'\',\'0084-2113888987\',\'\',\'\',\'\')', 1, 'successfully'),
(414, '2017-01-24 16:12:06', '2017-01-24 09:12:06', 2, 'province', 11, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'PRIME-VINH PHUC JOINT STOCK COMPANY\',description=\'TILES VIETNAM : TAMNT\',city=\'\',province=\'\',country=\'VIETNAM\',post_code=\'\',email=\'\',phone=\'0084-2113888987\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =11 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'PRIME-VINH PHUC JOINT STOCK COMPANY\' OR description != \'TILES VIETNAM : TAMNT\' OR city != \'\' OR province != \'\' OR country != \'VIETNAM\' OR post_code != \'\' OR email != \'\' OR phone != \'0084-2113888987\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(415, '2017-01-24 16:12:06', '2017-01-24 09:12:06', 2, 'supplier', 11, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'PRIME-VINH PHUC JOINT STOCK COMPANY\',description=\'TILES VIETNAM : TAMNT\',city=\'\',province=\'\',country=\'VIETNAM\',post_code=\'\',email=\'\',phone=\'0084-2113888987\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =11 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'PRIME-VINH PHUC JOINT STOCK COMPANY\' OR description != \'TILES VIETNAM : TAMNT\' OR city != \'\' OR province != \'\' OR country != \'VIETNAM\' OR post_code != \'\' OR email != \'\' OR phone != \'0084-2113888987\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(416, '2017-01-24 16:12:46', '2017-01-24 09:12:46', 2, 'supplier', 13, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'PRIME-DAI VIET JOINT STOCK COMPANY\',\'TILES VIETNAM : TAMNT\',\'\',\'\',\'VIETNAM\',\'\',\'\',\'0084-2113888987\',\'\',\'\',\'\')', 1, 'successfully'),
(417, '2017-01-24 16:13:59', '2017-01-24 09:13:59', 2, 'trader', 14, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'PRIME TRADE INC.,\',\'TILES VIETNAM : TAMNT\',\'BINH XUYEN INDUSTRY ZONE, BINH XUYEN\',\'DISTRICT VINH PHUC PROVINCE\',\'VIETNAM\',\'\',\'\',\'0084-2113888987\',\'\',\'\',\'\')', 1, 'successfully'),
(418, '2017-01-24 16:14:17', '2017-01-24 09:14:17', 2, 'supplier_link_trader', 2, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,11,13)', 1, 'successfully'),
(419, '2017-01-24 16:16:57', '2017-01-24 09:16:57', 2, 'supplier_link_trader', 3, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,12,13)', 1, 'successfully'),
(420, '2017-01-24 16:17:50', '2017-01-24 09:17:50', 2, 'supplier', 14, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'VIGLACERA HANOI JOINT STOCK COMPANY\',\'TILES LOW COST\',\'\',\'\',\'VIETNAM\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(421, '2017-01-24 16:18:49', '2017-01-24 09:18:49', 2, 'trader', 15, 1, 'INSERT', 'INSERT INTO trader (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'VIGLACERA CERAMIC TILES TRADING JSC\',\'TILES LOW COST : NGUYEN\',\'2ND FLOOR VIGLACERA TOWER METRI\',\'TU LIEM HANOI\',\'VIETNAM\',\'\',\'\',\'043-5430726\',\'\',\'\',\'\')', 1, 'successfully'),
(422, '2017-01-24 16:18:58', '2017-01-24 09:18:58', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,13,14)', 1, 'successfully'),
(423, '2017-01-24 16:20:23', '2017-01-24 09:20:23', 2, 'supplier', 15, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'ONDULINE.S.A. (MALAYSIA)\',\'ONDULINE : CHAOVALIT\',\'35 RUE BAUDIN\',\'LEVALLOIS-PERRET\',\'FRANCE\',\'\',\'\',\'081-8221848\',\'\',\'สั่งฝรั่งเศส แต่ผลิตจากมาเลเซีย\',\'\')', 1, 'successfully'),
(424, '2017-01-24 16:23:00', '2017-01-24 09:23:00', 2, 'supplier', 16, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOAN HUIQUAN CERAMIC CO.,LTD.\',\'SANITARY WARE EMON1-2\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-768-6933518\',\'\',\'\',\'\')', 1, 'successfully'),
(425, '2017-01-24 16:23:43', '2017-01-24 09:23:43', 2, 'supplier', 17, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOZHOU MEITAO CERAMICS CO.,LTD.\',\'MEITAO SANITARYWARE\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-013-433788155\',\'\',\'\',\'\')', 1, 'successfully'),
(426, '2017-01-24 16:29:22', '2017-01-24 09:29:22', 2, 'supplier', 18, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGZHOU WEISHIBAO DOORS CO.,LTD.\',\'FACTORY BATHWOOD\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-138-26157838\',\'\',\'\',\'\')', 1, 'successfully'),
(427, '2017-01-24 16:30:29', '2017-01-24 09:30:29', 2, 'supplier', 19, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOAN GUXIANG MANJIE CERAMICS FACTORY\',\'FACTORY LETOP\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-768-6837092\',\'\',\'\',\'\')', 1, 'successfully'),
(428, '2017-01-24 16:31:14', '2017-01-24 09:31:14', 2, 'supplier', 20, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GAOMING BIJIE SANITARY WARE CO.,LTD.\',\'FACTORY TIANYA\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-136-30146193\',\'\',\'\',\'\')', 1, 'successfully'),
(429, '2017-01-24 16:31:43', '2017-01-24 09:31:43', 2, 'supplier', 21, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'JIALONG SANITARY WARE CO.,LTD.\',\'FACTORY JIALONG\',\'\',\'\',\'CHINA\',\'\',\'\',\'0086-768-6926158\',\'\',\'\',\'\')', 1, 'successfully'),
(430, '2017-01-25 04:55:37', '2017-01-24 21:55:37', 1, 'province', 19, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GAOMING BIJIE SANITARY WARE CO.,LTD.\',description=\'FACTORY TIANYA\',city=\'\',province=\'\',country=\'CHINAs\',post_code=\'\',email=\'\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GAOMING BIJIE SANITARY WARE CO.,LTD.\' OR description != \'FACTORY TIANYA\' OR city != \'\' OR province != \'\' OR country != \'CHINAs\' OR post_code != \'\' OR email != \'\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(431, '2017-01-25 04:55:37', '2017-01-24 21:55:37', 1, 'supplier', 19, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GAOMING BIJIE SANITARY WARE CO.,LTD.\',description=\'FACTORY TIANYA\',city=\'\',province=\'\',country=\'CHINAs\',post_code=\'\',email=\'\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GAOMING BIJIE SANITARY WARE CO.,LTD.\' OR description != \'FACTORY TIANYA\' OR city != \'\' OR province != \'\' OR country != \'CHINAs\' OR post_code != \'\' OR email != \'\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(432, '2017-01-25 04:55:48', '2017-01-24 21:55:48', 1, 'province', 6, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\',description=\'SUNLIGHT=AARON\',city=\'INDUSTRY AREA DANGSHAN HANGZHOU\',province=\'ZHEJIANG\',country=\'CHINA\',post_code=\'311245\',email=\'master@zjsunlight.com, sales@zjsunlight.com\',phone=\'0086-571-82531666\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\' OR description != \'SUNLIGHT=AARON\' OR city != \'INDUSTRY AREA DANGSHAN HANGZHOU\' OR province != \'ZHEJIANG\' OR country != \'CHINA\' OR post_code != \'311245\' OR email != \'master@zjsunlight.com, sales@zjsunlight.com\' OR phone != \'0086-571-82531666\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(433, '2017-01-25 04:55:48', '2017-01-24 21:55:48', 1, 'supplier', 6, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\',description=\'SUNLIGHT=AARON\',city=\'INDUSTRY AREA DANGSHAN HANGZHOU\',province=\'ZHEJIANG\',country=\'CHINA\',post_code=\'311245\',email=\'master@zjsunlight.com, sales@zjsunlight.com\',phone=\'0086-571-82531666\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'HANGZHOU SUNLIGHT SANITARY WARE CO.,LTD.\' OR description != \'SUNLIGHT=AARON\' OR city != \'INDUSTRY AREA DANGSHAN HANGZHOU\' OR province != \'ZHEJIANG\' OR country != \'CHINA\' OR post_code != \'311245\' OR email != \'master@zjsunlight.com, sales@zjsunlight.com\' OR phone != \'0086-571-82531666\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(434, '2017-01-25 04:55:54', '2017-01-24 21:55:54', 1, 'province', 19, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GAOMING BIJIE SANITARY WARE CO.,LTD.\',description=\'FACTORY TIANYA\',city=\'\',province=\'\',country=\'CHINA\',post_code=\'\',email=\'\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GAOMING BIJIE SANITARY WARE CO.,LTD.\' OR description != \'FACTORY TIANYA\' OR city != \'\' OR province != \'\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(435, '2017-01-25 04:55:54', '2017-01-24 21:55:54', 1, 'supplier', 19, 1, 'UPDATE', 'UPDATE supplier SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'GAOMING BIJIE SANITARY WARE CO.,LTD.\',description=\'FACTORY TIANYA\',city=\'\',province=\'\',country=\'CHINA\',post_code=\'\',email=\'\',phone=\'0086-136-30146193\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'GAOMING BIJIE SANITARY WARE CO.,LTD.\' OR description != \'FACTORY TIANYA\' OR city != \'\' OR province != \'\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'\' OR phone != \'0086-136-30146193\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(436, '2017-01-25 13:31:08', '2017-01-25 06:31:08', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGDONG WINNERWAY HOLDINGS CORP.\',\'FACTORY CLASSIC WASH BASIN\',\'\',\'\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(437, '2017-01-25 13:32:00', '2017-01-25 06:32:00', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOZHOU BOMEI CERAMICS CO.,LTD.\',\'TWO PIECE LOW COST\',\'\',\'\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(438, '2017-01-25 15:08:35', '2017-01-25 08:08:35', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN CITY JINHUALI HOUSEHOLD ELECTRICAL APPLIANCE CO.,LTD.\',\'COOKING RANGE : ANGELA\',\'6 JIANGYI RD JIANG YI INDUSTRIAL PARK\',\'LE LIU TOWN SHUNDE FOSHAN GUANGDONG\',\'CHINA\',\'\',\'\',\'0086-0757-25523788\',\'\',\'\',\'\')', 1, 'successfully'),
(439, '2017-01-25 15:11:17', '2017-01-25 08:11:17', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,15,1)', 1, 'successfully'),
(440, '2017-01-25 15:12:00', '2017-01-25 08:12:00', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,16,2)', 1, 'successfully'),
(441, '2017-01-25 15:12:27', '2017-01-25 08:12:27', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,17,4)', 1, 'successfully'),
(442, '2017-01-25 15:12:44', '2017-01-25 08:12:44', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,18,6)', 1, 'successfully'),
(443, '2017-01-25 15:12:59', '2017-01-25 08:12:59', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,19,7)', 1, 'successfully'),
(444, '2017-01-25 15:13:14', '2017-01-25 08:13:14', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,20,8)', 1, 'successfully'),
(445, '2017-01-25 15:13:30', '2017-01-25 08:13:30', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,21,9)', 1, 'successfully'),
(446, '2017-01-25 15:13:42', '2017-01-25 08:13:42', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,22,10)', 1, 'successfully'),
(447, '2017-01-25 15:13:56', '2017-01-25 08:13:56', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,23,11)', 1, 'successfully'),
(448, '2017-01-25 15:15:14', '2017-01-25 08:15:14', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'MEITU INTERNATIONAL TRADING LIMITED\',\'MEITU SPART PART SANITARY WARE\',\'\',\'\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(449, '2017-01-25 15:15:25', '2017-01-25 08:15:25', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,24,12)', 1, 'successfully'),
(450, '2017-01-25 15:16:19', '2017-01-25 08:16:19', 2, 'province', 12, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'ZHONGSHAN MEITU PLASTIC IND.,CO.,LTD.\',description=\'MEITU : BILLY\',city=\'DACHE INDUSTRIAL AREA,\',province=\'NANLANG,ZHONGSHAN,GUANGDONG\',country=\'CHINA\',post_code=\'\',email=\'\',phone=\'86-760-85211111\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =12 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'ZHONGSHAN MEITU PLASTIC IND.,CO.,LTD.\' OR description != \'MEITU : BILLY\' OR city != \'DACHE INDUSTRIAL AREA,\' OR province != \'NANLANG,ZHONGSHAN,GUANGDONG\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'\' OR phone != \'86-760-85211111\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(451, '2017-01-25 15:16:19', '2017-01-25 08:16:19', 2, 'trader', 12, 1, 'UPDATE', 'UPDATE trader SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,name=\'ZHONGSHAN MEITU PLASTIC IND.,CO.,LTD.\',description=\'MEITU : BILLY\',city=\'DACHE INDUSTRIAL AREA,\',province=\'NANLANG,ZHONGSHAN,GUANGDONG\',country=\'CHINA\',post_code=\'\',email=\'\',phone=\'86-760-85211111\',bank_account=\'\',bank_account_2=\'\',tax_identification=\'\' WHERE id =12 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR name != \'ZHONGSHAN MEITU PLASTIC IND.,CO.,LTD.\' OR description != \'MEITU : BILLY\' OR city != \'DACHE INDUSTRIAL AREA,\' OR province != \'NANLANG,ZHONGSHAN,GUANGDONG\' OR country != \'CHINA\' OR post_code != \'\' OR email != \'\' OR phone != \'86-760-85211111\' OR bank_account != \'\' OR bank_account_2 != \'\' OR tax_identification != \'\' )', 1, 'successfully'),
(452, '2017-01-25 15:28:28', '2017-01-25 08:28:28', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN YANGGUANG CERAMICS CO.,LTD.\',\'POLISHED TILES \',\'BAINI TOWN, BAIJIN ROAD, SANSHUI DISTRICT, FOSHAN CITY\',\'GUANGDONG PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(453, '2017-01-25 15:30:07', '2017-01-25 08:30:07', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'JIANGMEN XINHUI XINGWEI CERAMICS CO.,LTD.\',\'RUSTIC TILES\',\'FENJIANG ROAD, HUICHENG TOWN, XINHUI DISTRICT, JIANGMEN CITY\',\'GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(454, '2017-01-25 15:31:18', '2017-01-25 08:31:18', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'FOSHAN XIANGYU CERAMICS CO.,LTD.\',\'POLISHED TILES \',\'HEFENG INDUSTRIAL DEVELOPMENT ZONE NANZHUANG TOWN\',\'CHANCHENG DISTRICT, FOSHAN CITY GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(455, '2017-01-25 15:32:27', '2017-01-25 08:32:27', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOAN MINGJIE CERAMICS CO.,LTD.\',\'DAVID\',\'XIAZAOQI XIHE VILLAGE FENGTANG TOWN CHAOAN COUNTY\',\'CHAOZHOU CITY GUANGDONG PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(456, '2017-01-25 15:35:41', '2017-01-25 08:35:41', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGDONG HENGSHENGJIA CERAMICS CO.,LTD.\',\'DAVID\',\'SOUTH WUZHIQU FENGTANG TOWN CHAOAN COUNTY\',\'GUANGDONG PROVINCE PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(457, '2017-01-25 15:37:48', '2017-01-25 08:37:48', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'GUANGDONG XIANGHUA DONGLONG PORCELAIN INDUSTRIAL CO.,LTD.\',\'DAVID\',\'DACHE WEIPIAN DONGLONG VILLAGE FENGTANG TOWN CHAOAN COUNTY\',\'CHAOZHOU CITY GUANGDONG PEOPLE S REPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(458, '2017-01-25 15:40:46', '2017-01-25 08:40:46', 2, 'supplier', 22, 1, 'INSERT', 'INSERT INTO supplier (id,created,modified,owner,name,description,city,province,country,post_code,email,phone,bank_account,bank_account_2,tax_identification) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,\'CHAOAN JIESHA CERAMIC INDUSTRY CO.,LTD.\',\'DAVID\',\'SHAKUPIAN PANYANG VILLAGE FENGTANG TOWN CHAOAN COUNTY\',\'CHAOZHOU CITY GUANGDONG PROVINCE PEOPLE S RPUBLIC OF CHINA\',\'CHINA\',\'\',\'\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(459, '2017-01-25 15:41:47', '2017-01-25 08:41:47', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,25,3)', 1, 'successfully'),
(460, '2017-01-25 15:42:01', '2017-01-25 08:42:01', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,26,5)', 1, 'successfully'),
(461, '2017-01-25 15:42:15', '2017-01-25 08:42:15', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,27,5)', 1, 'successfully'),
(462, '2017-01-25 15:42:24', '2017-01-25 08:42:24', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,28,3)', 1, 'successfully'),
(463, '2017-01-25 15:42:33', '2017-01-25 08:42:33', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,3)', 1, 'successfully'),
(464, '2017-01-25 15:42:41', '2017-01-25 08:42:41', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,30,3)', 1, 'successfully'),
(465, '2017-01-25 15:42:51', '2017-01-25 08:42:51', 2, 'supplier_link_trader', 4, 1, 'INSERT', 'INSERT INTO supplier_link_trader (id,created,modified,owner,supplier_id,trader_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,31,3)', 1, 'successfully'),
(466, '2017-01-25 15:45:21', '2017-01-25 08:45:21', 2, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกวันพีช\',name_english=\'One Piece Toilet\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกวันพีช\' OR name_english != \'One Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(467, '2017-01-25 15:46:17', '2017-01-25 08:46:17', 2, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=1,name=\'ชักโครกวันพีช\',name_english=\'One Piece Toilet\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 1 OR name != \'ชักโครกวันพีช\' OR name_english != \'One Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(468, '2017-01-25 15:47:01', '2017-01-25 08:47:01', 2, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกวันพีช\',name_english=\'One Piece Toilet\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกวันพีช\' OR name_english != \'One Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(469, '2017-01-25 15:47:41', '2017-01-25 08:47:41', 2, 'product_catagories', 2, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกวันพีช ทอร์นาโด\',name_english=\'One Piece Tornado Toilet\',description=\'root\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกวันพีช ทอร์นาโด\' OR name_english != \'One Piece Tornado Toilet\' OR description != \'root\' )', 1, 'successfully'),
(470, '2017-01-25 15:48:22', '2017-01-25 08:48:22', 2, 'product_catagories', 3, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกทูพีช \',name_english=\'Two Piece Toilet\',description=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกทูพีช \' OR name_english != \'Two Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(471, '2017-01-25 15:48:58', '2017-01-25 08:48:58', 2, 'product_catagories', 4, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกทูพีช ทอร์นาโด\',name_english=\'Two Piece Tornado Toilet\',description=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกทูพีช ทอร์นาโด\' OR name_english != \'Two Piece Tornado Toilet\' OR description != \'\' )', 1, 'successfully'),
(472, '2017-01-25 15:50:05', '2017-01-25 08:50:05', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=7,name=\'อ่างล้างหน้า\',name_english=\'ิWash Basin\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 7 OR name != \'อ่างล้างหน้า\' OR name_english != \'ิWash Basin\' OR description != \'\' )', 1, 'successfully'),
(473, '2017-01-25 15:50:27', '2017-01-25 08:50:27', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=7,name=\'อ่างล้างหน้า\',name_english=\'Wash Basin\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 7 OR name != \'อ่างล้างหน้า\' OR name_english != \'Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(474, '2017-01-25 15:51:06', '2017-01-25 08:51:06', 2, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'สุขภัณฑ์\',name_english=\'One Piece Toilet\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'สุขภัณฑ์\' OR name_english != \'One Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(475, '2017-01-25 15:51:17', '2017-01-25 08:51:17', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=7,name=\'\',name_english=\'Wash Basin\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 7 OR name != \'\' OR name_english != \'Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(476, '2017-01-25 15:51:54', '2017-01-25 08:51:54', 2, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ชักโครกวันพีช\',name_english=\'One Piece Toilet\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ชักโครกวันพีช\' OR name_english != \'One Piece Toilet\' OR description != \'\' )', 1, 'successfully'),
(477, '2017-01-25 15:52:07', '2017-01-25 08:52:07', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=7,name=\'สุขภัณฑ์\',name_english=\'Wash Basin\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 7 OR name != \'สุขภัณฑ์\' OR name_english != \'Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(478, '2017-01-25 15:52:23', '2017-01-25 08:52:23', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'สุขภัณฑ์\',name_english=\'Wash Basin\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'สุขภัณฑ์\' OR name_english != \'Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(479, '2017-01-25 15:52:38', '2017-01-25 08:52:38', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'สุขภัณฑ์\',name_english=\'\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'สุขภัณฑ์\' OR name_english != \'\' OR description != \'\' )', 1, 'successfully'),
(480, '2017-01-25 15:52:48', '2017-01-25 08:52:48', 2, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'สุขภัณฑ์\',name_english=\'Sanitary Ware\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'สุขภัณฑ์\' OR name_english != \'Sanitary Ware\' OR description != \'\' )', 1, 'successfully'),
(481, '2017-01-25 15:53:25', '2017-01-25 08:53:25', 2, 'product_catagories', 6, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'อ่างล้างหน้า\',name_english=\'Wash Basin\',description=\'\' WHERE id =6 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'อ่างล้างหน้า\' OR name_english != \'Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(482, '2017-01-25 15:53:54', '2017-01-25 08:53:54', 2, 'product_catagories', 7, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'ขาตั้งเคลือบ\',name_english=\'Pedestal Wash Basin\',description=\'\' WHERE id =7 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'ขาตั้งเคลือบ\' OR name_english != \'Pedestal Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(483, '2017-01-25 15:54:18', '2017-01-25 08:54:18', 2, 'product_catagories', 8, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'โถปัสสาวะชาย\',name_english=\'Urinal\',description=\'\' WHERE id =8 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'โถปัสสาวะชาย\' OR name_english != \'Urinal\' OR description != \'\' )', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(484, '2017-01-25 15:54:59', '2017-01-25 08:54:59', 2, 'product_catagories', 9, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=5,name=\'นั่งราบราดน้ำ\',name_english=\'Hang flush Toilet\',description=\'\' WHERE id =9 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 5 OR name != \'นั่งราบราดน้ำ\' OR name_english != \'Hang flush Toilet\' OR description != \'\' )', 1, 'successfully'),
(485, '2017-01-25 15:55:31', '2017-01-25 08:55:31', 2, 'product_catagories', 10, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=3,name=\'เคาน์เตอร์อ่างล้างหน้า\',name_english=\'Basin\',description=\'\' WHERE id =10 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 3 OR name != \'เคาน์เตอร์อ่างล้างหน้า\' OR name_english != \'Basin\' OR description != \'\' )', 1, 'successfully'),
(486, '2017-01-25 15:55:39', '2017-01-25 08:55:39', 2, 'product_catagories', 10, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=10,name=\'เคาน์เตอร์อ่างล้างหน้า\',name_english=\'Basin\',description=\'\' WHERE id =10 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 10 OR name != \'เคาน์เตอร์อ่างล้างหน้า\' OR name_english != \'Basin\' OR description != \'\' )', 1, 'successfully'),
(487, '2017-01-25 15:56:10', '2017-01-25 08:56:10', 2, 'product_catagories', 10, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=10,name=\'เคาน์เตอร์อ่างล้างหน้า\',name_english=\'Ceramic or Glass Wash Basin\',description=\'\' WHERE id =10 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 10 OR name != \'เคาน์เตอร์อ่างล้างหน้า\' OR name_english != \'Ceramic or Glass Wash Basin\' OR description != \'\' )', 1, 'successfully'),
(488, '2017-01-25 15:57:53', '2017-01-25 08:57:53', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,10,\'กระจกเงา\',\'Mirror\',\'\')', 1, 'successfully'),
(489, '2017-01-25 15:58:12', '2017-01-25 08:58:12', 2, 'product_catagories', 11, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=11,name=\'กระจกเงา\',name_english=\'Mirror\',description=\'\' WHERE id =11 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 11 OR name != \'กระจกเงา\' OR name_english != \'Mirror\' OR description != \'\' )', 1, 'successfully'),
(490, '2017-01-25 15:58:42', '2017-01-25 08:58:42', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,11,\'ตู้อาบน้ำ\',\'Shower Room\',\'\')', 1, 'successfully'),
(491, '2017-01-25 15:58:55', '2017-01-25 08:58:55', 2, 'product_catagories', 12, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=12,name=\'ตู้อาบน้ำ\',name_english=\'Shower Room\',description=\'\' WHERE id =12 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 12 OR name != \'ตู้อาบน้ำ\' OR name_english != \'Shower Room\' OR description != \'\' )', 1, 'successfully'),
(492, '2017-01-25 15:59:15', '2017-01-25 08:59:15', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,12,\'ฉากกั้นอาบน้ำ\',\'Shower Door\',\'\')', 1, 'successfully'),
(493, '2017-01-25 15:59:25', '2017-01-25 08:59:25', 2, 'product_catagories', 13, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=13,name=\'ฉากกั้นอาบน้ำ\',name_english=\'Shower Door\',description=\'\' WHERE id =13 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 13 OR name != \'ฉากกั้นอาบน้ำ\' OR name_english != \'Shower Door\' OR description != \'\' )', 1, 'successfully'),
(494, '2017-01-25 15:59:54', '2017-01-25 08:59:54', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,13,\'ประตูดีไซน์\',\'BATH WOOD Doors\',\'\')', 1, 'successfully'),
(495, '2017-01-25 16:00:05', '2017-01-25 09:00:05', 2, 'product_catagories', 14, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=14,name=\'ประตูดีไซน์\',name_english=\'BATH WOOD Doors\',description=\'\' WHERE id =14 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 14 OR name != \'ประตูดีไซน์\' OR name_english != \'BATH WOOD Doors\' OR description != \'\' )', 1, 'successfully'),
(496, '2017-01-25 16:00:19', '2017-01-25 09:00:19', 2, 'product_catagories', 14, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=14,name=\'ประตู\',name_english=\'BATH WOOD Doors\',description=\'\' WHERE id =14 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 14 OR name != \'ประตู\' OR name_english != \'BATH WOOD Doors\' OR description != \'\' )', 1, 'successfully'),
(497, '2017-01-25 16:00:41', '2017-01-25 09:00:41', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,14,\'กระเบื้อง\',\'Tiles\',\'\')', 1, 'successfully'),
(498, '2017-01-25 16:00:59', '2017-01-25 09:00:59', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,15,\'แกรนิต\',\'Polished Tiles\',\'\')', 1, 'successfully'),
(499, '2017-01-25 16:01:18', '2017-01-25 09:01:18', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,14,\'กรุยเชิง\',\'Border Tiles\',\'\')', 1, 'successfully'),
(500, '2017-01-25 16:02:10', '2017-01-25 09:02:10', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,14,\'ชุดแต่งแกรนิต\',\'Carpet \',\'\')', 1, 'successfully'),
(501, '2017-01-25 16:02:25', '2017-01-25 09:02:25', 2, 'product_catagories', 18, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=18,name=\'ชุดแต่งแกรนิต\',name_english=\'Carpet Tiles\',description=\'\' WHERE id =18 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 18 OR name != \'ชุดแต่งแกรนิต\' OR name_english != \'Carpet Tiles\' OR description != \'\' )', 1, 'successfully'),
(502, '2017-01-25 16:02:33', '2017-01-25 09:02:33', 2, 'product_catagories', 17, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=17,name=\'กรุยเชิง\',name_english=\'Border Tiles\',description=\'\' WHERE id =17 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 17 OR name != \'กรุยเชิง\' OR name_english != \'Border Tiles\' OR description != \'\' )', 1, 'successfully'),
(503, '2017-01-25 16:02:42', '2017-01-25 09:02:42', 2, 'product_catagories', 16, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=16,name=\'แกรนิต\',name_english=\'Polished Tiles\',description=\'\' WHERE id =16 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 16 OR name != \'แกรนิต\' OR name_english != \'Polished Tiles\' OR description != \'\' )', 1, 'successfully'),
(504, '2017-01-25 16:02:51', '2017-01-25 09:02:51', 2, 'product_catagories', 15, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=15,name=\'กระเบื้อง\',name_english=\'Tiles\',description=\'\' WHERE id =15 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 15 OR name != \'กระเบื้อง\' OR name_english != \'Tiles\' OR description != \'\' )', 1, 'successfully'),
(505, '2017-01-25 16:03:23', '2017-01-25 09:03:23', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,15,\'กระเบื้องอาร์ทสโตน\',\'Artstone Tiles\',\'\')', 1, 'successfully'),
(506, '2017-01-25 16:03:36', '2017-01-25 09:03:36', 2, 'product_catagories', 19, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=19,name=\'กระเบื้องอาร์ทสโตน\',name_english=\'Artstone Tiles\',description=\'\' WHERE id =19 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 19 OR name != \'กระเบื้องอาร์ทสโตน\' OR name_english != \'Artstone Tiles\' OR description != \'\' )', 1, 'successfully'),
(507, '2017-01-25 16:06:00', '2017-01-25 09:06:00', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,19,\'Accessories\',\' Accessories\',\'\')', 1, 'successfully'),
(508, '2017-01-25 16:06:11', '2017-01-25 09:06:11', 2, 'product_catagories', 20, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=20,name=\'Accessories\',name_english=\' Accessories\',description=\'\' WHERE id =20 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 20 OR name != \'Accessories\' OR name_english != \' Accessories\' OR description != \'\' )', 1, 'successfully'),
(509, '2017-01-25 16:06:51', '2017-01-25 09:06:51', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,20,\'อ่างอาบน้ำแมซซาจ\',\'Massage Bathtub\',\'\')', 1, 'successfully'),
(510, '2017-01-25 16:07:10', '2017-01-25 09:07:10', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,20,\'เตาแก๊ส\',\'Cooking Range\',\'\')', 1, 'successfully'),
(511, '2017-01-25 16:07:10', '2017-01-25 09:07:10', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,20,\'เตาแก๊ส\',\'Cooking Range\',\'\')', 1, 'successfully'),
(512, '2017-01-25 16:07:35', '2017-01-25 09:07:35', 2, 'product_catagories', 21, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=21,name=\'อ่างอาบน้ำแมซซาจ\',name_english=\'Massage Bathtub\',description=\'\' WHERE id =21 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 21 OR name != \'อ่างอาบน้ำแมซซาจ\' OR name_english != \'Massage Bathtub\' OR description != \'\' )', 1, 'successfully'),
(513, '2017-01-25 16:07:48', '2017-01-25 09:07:48', 2, 'product_catagories', 22, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=22,name=\'เตาแก๊ส\',name_english=\'Cooking Range\',description=\'\' WHERE id =22 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 22 OR name != \'เตาแก๊ส\' OR name_english != \'Cooking Range\' OR description != \'\' )', 1, 'successfully'),
(514, '2017-01-25 16:08:09', '2017-01-25 09:08:09', 2, 'product_catagories', 23, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=20,name=\'อะไหล่\',name_english=\'Spare Part\',description=\'\' WHERE id =23 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 20 OR name != \'อะไหล่\' OR name_english != \'Spare Part\' OR description != \'\' )', 1, 'successfully'),
(515, '2017-01-25 16:08:19', '2017-01-25 09:08:19', 2, 'product_catagories', 23, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=23,name=\'อะไหล่\',name_english=\'Spare Part\',description=\'\' WHERE id =23 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 23 OR name != \'อะไหล่\' OR name_english != \'Spare Part\' OR description != \'\' )', 1, 'successfully'),
(516, '2017-01-25 16:08:52', '2017-01-25 09:08:52', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,23,\'บล็อกแก้ว\',\'Glass Block\',\'\')', 1, 'successfully'),
(517, '2017-01-25 16:11:43', '2017-01-25 09:11:43', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,24,\'น้ำยาเคมี\',\'Chemical Cleaning\',\'\')', 1, 'successfully'),
(518, '2017-01-25 16:12:23', '2017-01-25 09:12:23', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,24,\'หลังคา\',\'Roof\',\'\')', 1, 'successfully'),
(519, '2017-01-25 16:12:54', '2017-01-25 09:12:54', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,26,\'กล่องสุขภัณฑ์\',\'Sanitary Ware BOX\',\'\')', 1, 'successfully'),
(520, '2017-01-25 16:20:04', '2017-01-25 09:20:04', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,27,\'ไม้บัวพีวีซี\',\'Wooden Cornice PVC\',\'\')', 1, 'successfully'),
(521, '2017-01-25 16:20:28', '2017-01-25 09:20:28', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,28,\'โมเสค\',\'Mosaic\',\'\')', 1, 'successfully'),
(522, '2017-01-25 16:20:44', '2017-01-25 09:20:44', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'อิฐมวลเย็น\',\'Block\',\'\')', 1, 'successfully'),
(523, '2017-01-25 16:21:02', '2017-01-25 09:21:02', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'กระดาษฟอร์ม\',\'Form Paper\',\'\')', 1, 'successfully'),
(524, '2017-01-25 16:21:21', '2017-01-25 09:21:21', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'เสื้อพนักงาน\',\'BATH LINE Uniform\',\'\')', 1, 'successfully'),
(525, '2017-01-25 16:21:35', '2017-01-25 09:21:35', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'สินค้าตัวอย่าง\',\'Sample Product\',\'\')', 1, 'successfully'),
(526, '2017-01-25 16:22:13', '2017-01-25 09:22:13', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'ชักโครกทูพีช(ไทย)\',\'Two Piece Toilet Thai\',\'\')', 1, 'successfully'),
(527, '2017-01-25 16:22:30', '2017-01-25 09:22:30', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'อ่างล้างหน้า(ไทย)\',\'Wash Basin Thai\',\'\')', 1, 'successfully'),
(528, '2017-01-25 16:23:13', '2017-01-25 09:23:13', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'ขาตั้งอ่าง(ไทย)\',\'Pedestal Wash Basin Thai\',\'\')', 1, 'successfully'),
(529, '2017-01-25 16:23:32', '2017-01-25 09:23:32', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'แท่นโชว์\',\'Booth Show Product\',\'\')', 1, 'successfully'),
(530, '2017-01-25 16:24:36', '2017-01-25 09:24:36', 2, 'product_catagories', 11, 1, 'INSERT', 'INSERT INTO product_catagories (id,created,modified,owner,product_catagories_parent_id,name,name_english,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,29,\'ปูนกาว(ไทย) \',\'Glue Cement\',\'\')', 1, 'successfully'),
(531, '2017-01-25 16:25:17', '2017-01-25 09:25:17', 2, 'product_catagories', 24, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=24,name=\'บล็อกแก้ว\',name_english=\'Glass Block\',description=\'\' WHERE id =24 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 24 OR name != \'บล็อกแก้ว\' OR name_english != \'Glass Block\' OR description != \'\' )', 1, 'successfully'),
(532, '2017-01-25 16:25:33', '2017-01-25 09:25:33', 2, 'product_catagories', 25, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=25,name=\'น้ำยาเคมี\',name_english=\'Chemical Cleaning\',description=\'\' WHERE id =25 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 25 OR name != \'น้ำยาเคมี\' OR name_english != \'Chemical Cleaning\' OR description != \'\' )', 1, 'successfully'),
(533, '2017-01-25 16:25:45', '2017-01-25 09:25:45', 2, 'product_catagories', 26, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=26,name=\'หลังคา\',name_english=\'Roof\',description=\'\' WHERE id =26 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 26 OR name != \'หลังคา\' OR name_english != \'Roof\' OR description != \'\' )', 1, 'successfully'),
(534, '2017-01-25 16:25:58', '2017-01-25 09:25:58', 2, 'product_catagories', 27, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=27,name=\'กล่องสุขภัณฑ์\',name_english=\'Sanitary Ware BOX\',description=\'\' WHERE id =27 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 27 OR name != \'กล่องสุขภัณฑ์\' OR name_english != \'Sanitary Ware BOX\' OR description != \'\' )', 1, 'successfully'),
(535, '2017-01-25 16:26:10', '2017-01-25 09:26:10', 2, 'product_catagories', 28, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=28,name=\'ไม้บัวพีวีซี\',name_english=\'Wooden Cornice PVC\',description=\'\' WHERE id =28 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 28 OR name != \'ไม้บัวพีวีซี\' OR name_english != \'Wooden Cornice PVC\' OR description != \'\' )', 1, 'successfully'),
(536, '2017-01-25 16:26:35', '2017-01-25 09:26:35', 2, 'product_catagories', 29, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=29,name=\'โมเสค\',name_english=\'Mosaic\',description=\'\' WHERE id =29 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 29 OR name != \'โมเสค\' OR name_english != \'Mosaic\' OR description != \'\' )', 1, 'successfully'),
(537, '2017-01-25 16:26:54', '2017-01-25 09:26:54', 2, 'product_catagories', 30, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=30,name=\'อิฐมวลเย็น\',name_english=\'Block\',description=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 30 OR name != \'อิฐมวลเย็น\' OR name_english != \'Block\' OR description != \'\' )', 1, 'successfully'),
(538, '2017-01-25 16:27:22', '2017-01-25 09:27:22', 2, 'product_catagories', 31, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=31,name=\'กระดาษฟอร์ม\',name_english=\'Form Paper\',description=\'\' WHERE id =31 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 31 OR name != \'กระดาษฟอร์ม\' OR name_english != \'Form Paper\' OR description != \'\' )', 1, 'successfully'),
(539, '2017-01-25 16:27:34', '2017-01-25 09:27:34', 2, 'product_catagories', 32, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=32,name=\'เสื้อพนักงาน\',name_english=\'BATH LINE Uniform\',description=\'\' WHERE id =32 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 32 OR name != \'เสื้อพนักงาน\' OR name_english != \'BATH LINE Uniform\' OR description != \'\' )', 1, 'successfully'),
(540, '2017-01-25 16:27:47', '2017-01-25 09:27:47', 2, 'product_catagories', 33, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=33,name=\'สินค้าตัวอย่าง\',name_english=\'Sample Product\',description=\'\' WHERE id =33 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 33 OR name != \'สินค้าตัวอย่าง\' OR name_english != \'Sample Product\' OR description != \'\' )', 1, 'successfully'),
(541, '2017-01-25 16:27:58', '2017-01-25 09:27:58', 2, 'product_catagories', 34, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=34,name=\'ชักโครกทูพีช(ไทย)\',name_english=\'Two Piece Toilet Thai\',description=\'\' WHERE id =34 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 34 OR name != \'ชักโครกทูพีช(ไทย)\' OR name_english != \'Two Piece Toilet Thai\' OR description != \'\' )', 1, 'successfully'),
(542, '2017-01-25 16:28:09', '2017-01-25 09:28:09', 2, 'product_catagories', 35, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=35,name=\'อ่างล้างหน้า(ไทย)\',name_english=\'Wash Basin Thai\',description=\'\' WHERE id =35 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 35 OR name != \'อ่างล้างหน้า(ไทย)\' OR name_english != \'Wash Basin Thai\' OR description != \'\' )', 1, 'successfully'),
(543, '2017-01-25 16:28:21', '2017-01-25 09:28:21', 2, 'product_catagories', 36, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=36,name=\'ขาตั้งอ่าง(ไทย)\',name_english=\'Pedestal Wash Basin Thai\',description=\'\' WHERE id =36 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 36 OR name != \'ขาตั้งอ่าง(ไทย)\' OR name_english != \'Pedestal Wash Basin Thai\' OR description != \'\' )', 1, 'successfully'),
(544, '2017-01-25 16:28:32', '2017-01-25 09:28:32', 2, 'product_catagories', 37, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=37,name=\'แท่นโชว์\',name_english=\'Booth Show Product\',description=\'\' WHERE id =37 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 37 OR name != \'แท่นโชว์\' OR name_english != \'Booth Show Product\' OR description != \'\' )', 1, 'successfully'),
(545, '2017-01-25 16:28:43', '2017-01-25 09:28:43', 2, 'product_catagories', 38, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_parent_id=38,name=\'ปูนกาว(ไทย) \',name_english=\'Glue Cement\',description=\'\' WHERE id =38 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_parent_id != 38 OR name != \'ปูนกาว(ไทย) \' OR name_english != \'Glue Cement\' OR description != \'\' )', 1, 'successfully'),
(546, '2017-01-25 16:31:08', '2017-01-25 09:31:08', 2, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=1,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111606\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 1 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111606\' )', 1, 'successfully'),
(547, '2017-01-25 16:31:35', '2017-01-25 09:31:35', 2, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111606\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111606\' )', 1, 'successfully'),
(548, '2017-01-25 16:33:51', '2017-01-25 09:33:51', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,2,1,15,\'B-4654A\',\'TALAS\',\'ทาลัส\',\'พร้อมฝารองนั่งอัตโนมัติ\',\'8859199111606\')', 1, 'successfully'),
(549, '2017-01-25 16:34:13', '2017-01-25 09:34:13', 2, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(550, '2017-01-25 22:43:19', '2017-01-25 15:43:19', 1, 'task_action_type', 6, 1, 'INSERT', 'UPDATE task_action_type SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'INSERT_MULTIPLE\',description=\'INSERT_MULTIPLE\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'INSERT_MULTIPLE\' OR description != \'INSERT_MULTIPLE\' )', 1, 'successfully'),
(551, '2017-01-25 22:43:19', '2017-01-25 15:43:19', 1, 'task_action_type', 5, 1, 'UPDATE', 'UPDATE task_action_type SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'INSERT_MULTIPLE\',description=\'INSERT_MULTIPLE\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'INSERT_MULTIPLE\' OR description != \'INSERT_MULTIPLE\' )', 1, 'successfully'),
(552, '2017-01-25 23:41:08', '2017-01-25 16:41:08', 1, 'retail_pc', 1, 1, 'UPDATE', 'UPDATE retail_pc SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,name=\'\',employee_id=2,agent_id=1 WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR name != \'\' OR employee_id != 2 OR agent_id != 1 )', 1, 'successfully'),
(553, '2017-01-26 02:53:03', '2017-01-25 19:53:03', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(554, '2017-01-26 02:53:40', '2017-01-25 19:53:40', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(555, '2017-01-26 02:54:07', '2017-01-25 19:54:07', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(556, '2017-01-26 02:54:12', '2017-01-25 19:54:12', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(557, '2017-01-26 02:55:10', '2017-01-25 19:55:10', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(558, '2017-01-26 02:56:33', '2017-01-25 19:56:33', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,14),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,22),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,35),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,12),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,53);', 1, 'successfully'),
(559, '2017-01-26 03:00:18', '2017-01-25 20:00:18', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,21),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,4),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,25),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,33),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,3);', 1, 'successfully'),
(560, '2017-01-26 03:00:59', '2017-01-25 20:00:59', 1, 'task', 30, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=5,task_status_id=1,job_id=11,amphur_id=1,province_id=1,country=\'ไทย\',name=\'ลงบันทึก สต็อค สินค้าคงเหลือ ประจำวัน\',description=\'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =30 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 5 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 1 OR province_id != 1 OR country != \'ไทย\' OR name != \'ลงบันทึก สต็อค สินค้าคงเหลือ ประจำวัน\' OR description != \'โดยให้กรอกข้อมูล รายงานการขายสินค้า BATHLINE ที่อยู่ในร้าน ทุกๆ วัน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(561, '2017-01-26 03:04:48', '2017-01-25 20:04:48', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,11,843,7,\'ไทย\',\'ประวัติ การบันทึก ย้อนหลัง 7 วัน\',\'ประวัติ การบันทึก ย้อนหลัง 7 วัน\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(562, '2017-01-26 03:07:19', '2017-01-25 20:07:19', 1, 'task_action_type', 6, 1, 'INSERT', 'INSERT INTO task_action_type (id,created,modified,owner,name,description) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'EDIT_CREDENTIAL_TIME\',\'\')', 1, 'successfully'),
(563, '2017-01-26 03:07:27', '2017-01-25 20:07:27', 1, 'task', 37, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=6,task_status_id=1,job_id=11,amphur_id=843,province_id=7,country=\'ไทย\',name=\'ประวัติ การบันทึก ย้อนหลัง 7 วัน\',description=\'ประวัติ การบันทึก ย้อนหลัง 7 วัน\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =37 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 6 OR task_status_id != 1 OR job_id != 11 OR amphur_id != 843 OR province_id != 7 OR country != \'ไทย\' OR name != \'ประวัติ การบันทึก ย้อนหลัง 7 วัน\' OR description != \'ประวัติ การบันทึก ย้อนหลัง 7 วัน\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(564, '2017-01-26 03:19:24', '2017-01-25 20:19:24', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,37,14)', 1, 'successfully'),
(565, '2017-01-26 03:27:53', '2017-01-25 20:27:53', 1, 'retail_stock_report', 3, 1, 'UPDATE', 'UPDATE retail_stock_report SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,agent_id=1,product_id=1,quantity_remain=1 WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR agent_id != 1 OR product_id != 1 OR quantity_remain != 1 )', 1, 'successfully'),
(566, '2017-01-26 03:28:44', '2017-01-25 20:28:44', 1, 'retail_stock_report', 4, 1, 'UPDATE', 'UPDATE retail_stock_report SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,agent_id=1,product_id=1,quantity_remain=1 WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR agent_id != 1 OR product_id != 1 OR quantity_remain != 1 )', 1, 'successfully'),
(567, '2017-01-26 04:00:33', '2017-01-25 21:00:33', 1, 'product_catagories', 4, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=5,name=\'ชักโครกทูพีช ทอร์นาโด\',name_english=\'Two Piece Tornado Toilet\',description=\'fgfg\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 5 OR name != \'ชักโครกทูพีช ทอร์นาโด\' OR name_english != \'Two Piece Tornado Toilet\' OR description != \'fgfg\' )', 1, 'successfully'),
(568, '2017-01-26 04:00:50', '2017-01-25 21:00:50', 1, 'product_catagories', 4, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=5,name=\'ชักโครกทูพีช ทอร์นาโด\',name_english=\'Two Piece Tornado Toilet\',description=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 5 OR name != \'ชักโครกทูพีช ทอร์นาโด\' OR name_english != \'Two Piece Tornado Toilet\' OR description != \'\' )', 1, 'successfully'),
(569, '2017-01-26 04:15:16', '2017-01-25 21:15:16', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,55),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,5),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,5),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,5);', 1, 'successfully'),
(570, '2017-01-26 04:51:03', '2017-01-25 21:51:03', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,5);', 1, 'successfully'),
(571, '2017-01-26 05:20:07', '2017-01-25 22:20:07', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,4);', 1, 'successfully'),
(572, '2017-01-26 05:20:41', '2017-01-25 22:20:41', 1, 'retail_stock_report', 9, 1, 'INSERT', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,2);', 1, 'successfully'),
(573, '2017-01-26 05:25:09', '2017-01-25 22:25:09', 1, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(574, '2017-01-26 05:25:30', '2017-01-25 22:25:30', 1, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALASs\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALASs\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(575, '2017-01-26 05:25:59', '2017-01-25 22:25:59', 1, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(576, '2017-01-26 05:26:32', '2017-01-25 22:26:32', 1, 'product', 2, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654A\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'พร้อมฝารองนั่งอัตโนมัติ\',barcode=\'8859199111606\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654A\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'พร้อมฝารองนั่งอัตโนมัติ\' OR barcode != \'8859199111606\' )', 1, 'successfully'),
(577, '2017-01-26 15:04:39', '2017-01-26 08:04:39', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,2,1,15,\'B-4681\',\'New Pronto\',\'นิวปรอนโต้\',\'ใช้น้ำ3/4.5ลิตร\',\'8859199111675\')', 1, 'successfully'),
(578, '2017-01-26 15:06:10', '2017-01-26 08:06:10', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,2,1,15,\'B-4613\',\'DANAS\',\'ดานัส\',\'ใช้น้ำ \',\'\')', 1, 'successfully'),
(579, '2017-01-26 15:06:29', '2017-01-26 08:06:29', 2, 'product', 4, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4613\',name_english=\'DANAS\',short_description=\'ดานัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาUF\',barcode=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4613\' OR name_english != \'DANAS\' OR short_description != \'ดานัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาUF\' OR barcode != \'\' )', 1, 'successfully'),
(580, '2017-01-26 15:06:41', '2017-01-26 08:06:41', 2, 'product', 4, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4613\',name_english=\'DANAS\',short_description=\'ดานัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาUF\',barcode=\'8859199110999\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4613\' OR name_english != \'DANAS\' OR short_description != \'ดานัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาUF\' OR barcode != \'8859199110999\' )', 1, 'successfully'),
(581, '2017-01-26 15:06:57', '2017-01-26 08:06:57', 2, 'product', 3, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4681\',name_english=\'New Pronto\',short_description=\'นิวปรอนโต้\',long_description=\'ใช้น้ำ3/4.5ลิตร ฝาUF\',barcode=\'8859199111675\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4681\' OR name_english != \'New Pronto\' OR short_description != \'นิวปรอนโต้\' OR long_description != \'ใช้น้ำ3/4.5ลิตร ฝาUF\' OR barcode != \'8859199111675\' )', 1, 'successfully'),
(582, '2017-01-26 15:07:11', '2017-01-26 08:07:11', 2, 'product', 2, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654A\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'พร้อมฝารองนั่งอัตโนมัติ\',barcode=\'8859199111606\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654A\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'พร้อมฝารองนั่งอัตโนมัติ\' OR barcode != \'8859199111606\' )', 1, 'successfully'),
(583, '2017-01-26 15:07:19', '2017-01-26 08:07:19', 2, 'product', 1, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาUF\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาUF\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(584, '2017-01-26 15:07:56', '2017-01-26 08:07:56', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,2,1,15,\'B-4620\',\'SPEEDY\',\'สปีดี้\',\'ใช้น้ำ \',\'\')', 1, 'successfully'),
(585, '2017-01-26 15:08:26', '2017-01-26 08:08:26', 2, 'product', 5, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=2,product_status_id=1,supplier_id=15,name=\'B-4620\',name_english=\'SPEEDY\',short_description=\'สปีดี้\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาPP\',barcode=\'8859199111040\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 2 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4620\' OR name_english != \'SPEEDY\' OR short_description != \'สปีดี้\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาPP\' OR barcode != \'8859199111040\' )', 1, 'successfully'),
(586, '2017-01-26 15:09:18', '2017-01-26 08:09:18', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-1619\',\'VICTORY\',\'วิคทอรี่\',\'ใช้น้ำ 3/6 ลิตร ฝาSlide Click\',\'8859199110050\')', 1, 'successfully'),
(587, '2017-01-26 15:10:06', '2017-01-26 08:10:06', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-1673\',\'WIN\',\'วิน\',\'ใช้น้ำ 3/6 ลิตร ฝาSlide Click Long Curve\',\'8859199110111\')', 1, 'successfully');
INSERT INTO `task_log` (`id`, `created`, `modified`, `owner`, `record_name`, `record_document`, `task_id`, `task_action_type`, `query`, `task_log_status_id`, `task_msg`) VALUES
(588, '2017-01-26 15:11:16', '2017-01-26 08:11:16', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,18,\'B-4024\',\'THE BEST\',\'เดอะเบสท์\',\'ใช้น้ำ 2.5/4 ลิตร ฝาSlow Downธรรมดา\',\'8859199110067\')', 1, 'successfully'),
(589, '2017-01-26 15:16:35', '2017-01-26 08:16:35', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,18,\'B-4023\',\'BOOM\',\'บูม\',\'ใช้น้ำ 2.5/4ลิตร ฝาSlow Down\',\'8859199110104\')', 1, 'successfully'),
(590, '2017-01-26 15:17:27', '2017-01-26 08:17:27', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,18,\'B-4078\',\'SUPER SAVE\',\'ซุปเปอร์เซฟ\',\'ใช้น้ำ 3/6ลิตร ฝาSlow Down\',\'8859199110142\')', 1, 'successfully'),
(591, '2017-01-26 15:18:19', '2017-01-26 08:18:19', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-1674\',\'SUPER JET\',\'ซุปเปอร์เจ็ท\',\'ใช้น้ำ 3/6ลิตร ฝาSlide Click\',\'8859199111651\')', 1, 'successfully'),
(592, '2017-01-26 15:18:50', '2017-01-26 08:18:50', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-4026\',\'FIN\',\'ฟิน\',\'ใช้น้ำ 3/6ลิตร ฝาSlow Down\',\'8859199111644\')', 1, 'successfully'),
(593, '2017-01-26 15:19:45', '2017-01-26 08:19:45', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-2144\',\'PREMA\',\'พรีม่า\',\'ใช้น้ำ 3/6ลิตร ฝาSlow Down\',\'8859199111637\')', 1, 'successfully'),
(594, '2017-01-26 15:21:58', '2017-01-26 08:21:58', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,30,\'B-2145\',\'ORCA\',\'ออก้า\',\'ใช้น้ำ 3/6ลิตร ฝาSlide Click\',\'8859199111699\')', 1, 'successfully'),
(595, '2017-01-26 15:22:28', '2017-01-26 08:22:28', 2, 'product', 14, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=1,product_status_id=1,supplier_id=30,name=\'B-2145\',name_english=\'ORCA\',short_description=\'ออก้า\',long_description=\'ใช้น้ำ 3/6ลิตร ฝาEasy Click , UF\',barcode=\'8859199111699\' WHERE id =14 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 1 OR product_status_id != 1 OR supplier_id != 30 OR name != \'B-2145\' OR name_english != \'ORCA\' OR short_description != \'ออก้า\' OR long_description != \'ใช้น้ำ 3/6ลิตร ฝาEasy Click , UF\' OR barcode != \'8859199111699\' )', 1, 'successfully'),
(596, '2017-01-26 15:23:21', '2017-01-26 08:23:21', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'ฺB-1607\',\'BEBE\',\'เบบี้\',\'ใช้น้ำ 3/6ลิตร \',\'8859199111422\')', 1, 'successfully'),
(597, '2017-01-26 15:40:04', '2017-01-26 08:40:04', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,4,1,15,\'B-4607\',\'SPIRAL\',\'สไปรัล\',\'ใช้น้ำ 3/4.5ลิตร ฝาSlow Down \',\'8859199111019\')', 1, 'successfully'),
(598, '2017-01-26 15:40:50', '2017-01-26 08:40:50', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,3,1,18,\'B-008\',\'SUPER BIG\',\'ซุปเปอร์บิ๊ก\',\'ใช้น้ำ 3/6ลิตร Slow Down\',\'8859199110203\')', 1, 'successfully'),
(599, '2017-01-26 15:41:21', '2017-01-26 08:41:21', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,3,1,18,\'B-2024\',\'LOVELY\',\'เลิฟลี่\',\'ใช้น้ำ 3/6 ลิตร ฝาSlow Down\',\'8859199110234\')', 1, 'successfully'),
(600, '2017-01-26 15:41:55', '2017-01-26 08:41:55', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,3,1,18,\'B-2025\',\'LUCKY\',\'ลัคกี้\',\'ใชน้ำ 3/6ลิตร ฝาSlow Down\',\'8859199110241\')', 1, 'successfully'),
(601, '2017-01-26 15:44:27', '2017-01-26 08:44:27', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,9,1,29,\'B-7280\',\'JUMBO\',\'จัมโบ้\',\'37x50x41cm.\',\'8859199110265\')', 1, 'successfully'),
(602, '2017-01-26 15:45:34', '2017-01-26 08:45:34', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,9,1,16,\'B-111 W\',\'COMFORT WHITE\',\'สบาย สีขาว\',\'38x46x38cm.\',\'8859199110302\')', 1, 'successfully'),
(603, '2017-01-26 15:46:28', '2017-01-26 08:46:28', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,9,1,16,\'B-111 B\',\'COMFORT BLUE\',\'สบาย สีฟ้า\',\'38x46x38cm.\',\'8859199110272\')', 1, 'successfully'),
(604, '2017-01-26 15:47:16', '2017-01-26 08:47:16', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,9,1,16,\'B-111 P\',\'COMFORT PINK\',\'สบาย สีชมพู\',\'38x46x38cm.\',\'8859199110289\')', 1, 'successfully'),
(605, '2017-01-26 15:47:53', '2017-01-26 08:47:53', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,9,1,16,\'B-111 G\',\'COMFORT GREEN\',\'สบาย สีเขียวอ่อน\',\'38x46x38cm.\',\'8859199110296\')', 1, 'successfully'),
(606, '2017-01-26 15:49:08', '2017-01-26 08:49:08', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,3,1,28,\'B-2138\',\'IMPERIAL\',\'อิมพีเรียล\',\'ใช้น้ำ 6ลิตร ฝาSlow Down\',\'8859199111736\')', 1, 'successfully'),
(607, '2017-01-26 15:51:18', '2017-01-26 08:51:18', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,3,1,28,\'B-2188\',\'MODULAR\',\'โมดูลล่า\',\'ใช้น้ำ 3/6ลิตร ฝาSlow Down\',\'885919911191\')', 1, 'successfully'),
(608, '2017-01-26 15:51:29', '2017-01-26 08:51:29', 2, 'product', 26, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=2,product_catagories_id=3,product_status_id=1,supplier_id=28,name=\'B-2188\',name_english=\'MODULAR\',short_description=\'โมดูลล่า\',long_description=\'ใช้น้ำ 3/6ลิตร ฝาSlow Down\',barcode=\'8859199111910\' WHERE id =26 AND ( id != id OR created != created OR modified != modified OR owner != 2 OR product_catagories_id != 3 OR product_status_id != 1 OR supplier_id != 28 OR name != \'B-2188\' OR name_english != \'MODULAR\' OR short_description != \'โมดูลล่า\' OR long_description != \'ใช้น้ำ 3/6ลิตร ฝาSlow Down\' OR barcode != \'8859199111910\' )', 1, 'successfully'),
(609, '2017-01-26 16:02:47', '2017-01-26 09:02:47', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,29,\'B-4201\',\'TRIUMP\',\'ไทรอัมพ์\',\'ใช้น้ำ 3/6ลิตร ฝาEasy Click with BIDET\',\'8859199111743\')', 1, 'successfully'),
(610, '2017-01-26 16:03:50', '2017-01-26 09:03:50', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,2,1,15,\'B-4610\',\'MAXIMUM\',\'แม็กซิมั่ม\',\'ใช้น้ำ 3/6ลิตร ฝาPP Easy Click\',\'8859199131420\')', 1, 'successfully'),
(611, '2017-01-26 16:20:08', '2017-01-26 09:20:08', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,18,\'B-1672\',\'NATURA\',\'นาทูร่า\',\'\',\'8859199110036\')', 1, 'successfully'),
(612, '2017-01-26 16:23:06', '2017-01-26 09:23:06', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-1674 G\',\'SUPER JET GOLD\',\'ซุปเปอร์เจ็ท ขอบทอง\',\'ใช้น้ำ 3/6ลิตร ฝาSlide Click\',\'\')', 1, 'successfully'),
(613, '2017-01-26 16:23:55', '2017-01-26 09:23:55', 2, 'product', 2, 1, 'INSERT', 'INSERT INTO product (id,created,modified,owner,product_catagories_id,product_status_id,supplier_id,name,name_english,short_description,long_description,barcode) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,2,1,1,15,\'B-1674 S\',\'SUPER JET SILVER\',\'ซุปเปอร์เจ็ท ขอบเงิน\',\'ใช้น้ำ 3/6ลิตร ฝาSlide Click\',\'\')', 1, 'successfully'),
(614, '2017-01-26 18:33:16', '2017-01-26 11:33:16', 1, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=1,name=\'ห้องนํ้า\',name_english=\'Bathroom\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 1 OR name != \'ห้องนํ้า\' OR name_english != \'Bathroom\' OR description != \'\' )', 1, 'successfully'),
(615, '2017-01-26 18:33:30', '2017-01-26 11:33:30', 1, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=1,name=\'สุขภัณฑ์\',name_english=\'Sanitary Ware\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 1 OR name != \'สุขภัณฑ์\' OR name_english != \'Sanitary Ware\' OR description != \'\' )', 1, 'successfully'),
(616, '2017-01-26 18:33:55', '2017-01-26 11:33:55', 1, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=1,name=\'root\',name_english=\'root\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 1 OR name != \'root\' OR name_english != \'root\' OR description != \'\' )', 1, 'successfully'),
(617, '2017-01-26 18:34:10', '2017-01-26 11:34:10', 1, 'product_catagories', 2, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=1,name=\'ห้องนํ้า\',name_english=\'Bathroom\',description=\'root\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 1 OR name != \'ห้องนํ้า\' OR name_english != \'Bathroom\' OR description != \'root\' )', 1, 'successfully'),
(618, '2017-01-26 18:34:19', '2017-01-26 11:34:19', 1, 'product_catagories', 5, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=2,name=\'สุขภัณฑ์\',name_english=\'Sanitary Ware\',description=\'\' WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 2 OR name != \'สุขภัณฑ์\' OR name_english != \'Sanitary Ware\' OR description != \'\' )', 1, 'successfully'),
(619, '2017-01-26 18:34:45', '2017-01-26 11:34:45', 1, 'product_catagories', 3, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=5,name=\'ชักโครก\',name_english=\'Toilet\',description=\'\' WHERE id =3 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 5 OR name != \'ชักโครก\' OR name_english != \'Toilet\' OR description != \'\' )', 1, 'successfully'),
(620, '2017-01-26 18:36:32', '2017-01-26 11:36:32', 1, 'product_catagories', 4, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=5,name=\'บาธไลน์\',name_english=\'Bathline\',description=\'\' WHERE id =4 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 5 OR name != \'บาธไลน์\' OR name_english != \'Bathline\' OR description != \'\' )', 1, 'successfully'),
(621, '2017-01-26 18:42:51', '2017-01-26 11:42:51', 1, 'product', 16, 1, 'UPDATE', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=1,product_status_id=1,supplier_id=15,name=\'B-4607\',name_english=\'SPIRAL\',short_description=\'สไปรัล\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาSlow Down \',barcode=\'8859199111019\' WHERE id =16 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 1 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4607\' OR name_english != \'SPIRAL\' OR short_description != \'สไปรัล\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาSlow Down \' OR barcode != \'8859199111019\' )', 1, 'successfully'),
(622, '2017-01-26 18:45:13', '2017-01-26 11:45:13', 1, 'product_catagories', 2, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=2,name=\'ห้องนํ้า\',name_english=\'Bathroom\',description=\'root\' WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 2 OR name != \'ห้องนํ้า\' OR name_english != \'Bathroom\' OR description != \'root\' )', 1, 'successfully'),
(623, '2017-01-26 18:46:13', '2017-01-26 11:46:13', 1, 'product_catagories', 1, 1, 'UPDATE', 'UPDATE product_catagories SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_parent_id=2,name=\'root\',name_english=\'root\',description=\'\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_parent_id != 2 OR name != \'root\' OR name_english != \'root\' OR description != \'\' )', 1, 'successfully'),
(624, '2017-01-27 01:50:58', '2017-01-26 18:50:58', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่มลักษณะ\',\'เพิ่มลักษณะ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(625, '2017-01-27 01:51:13', '2017-01-26 18:51:13', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข ลักษณะ\',\'เพิ่มลักษณะ\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(626, '2017-01-27 01:51:35', '2017-01-26 18:51:35', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่ม ลักษณะ ตัวเลือก\',\'เพิ่ม ลักษณะ ตัวเลือก\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(627, '2017-01-27 01:51:44', '2017-01-26 18:51:44', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข ลักษณะ ตัวเลือก\',\'แก้ไข ลักษณะ ตัวเลือก\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(628, '2017-01-27 01:52:33', '2017-01-26 18:52:33', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,1,1,3,843,7,\'ไทย\',\'เพิ่ม ลักษณะ สินค้า\',\'เพิ่ม ลักษณะ สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(629, '2017-01-27 01:52:42', '2017-01-26 18:52:42', 1, 'task', 37, 1, 'INSERT', 'INSERT INTO task (id,created,modified,owner,task_parent_id,task_action_type_id,task_status_id,job_id,amphur_id,province_id,country,name,description,task_open,task_close,error_msg_thai,error_msg_english,success_msg_thai,success_msg_english) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1,3,843,7,\'ไทย\',\'แก้ไข ลักษณะ สินค้า\',\'แก้ไข ลักษณะ สินค้า\',\'2017-01-15\',\'2018-01-15\',\'\',\'\',\'\',\'\')', 1, 'successfully'),
(630, '2017-01-27 01:53:00', '2017-01-26 18:53:00', 1, 'task', 38, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=1,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country=\'ไทย\',name=\'เพิ่ม หมวดหมู่ ลักษณะ \',description=\'เพิ่ม หมวดหมู่ ลักษณะ \',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =38 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 1 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country != \'ไทย\' OR name != \'เพิ่ม หมวดหมู่ ลักษณะ \' OR description != \'เพิ่ม หมวดหมู่ ลักษณะ \' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(631, '2017-01-27 01:53:13', '2017-01-26 18:53:13', 1, 'task', 39, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=2,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country=\'ไทย\',name=\'แก้ไข หมวดหมู่ ลักษณะ \',description=\'แก้ไข หมวดหมู่ ลักษณะ \',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =39 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 2 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country != \'ไทย\' OR name != \'แก้ไข หมวดหมู่ ลักษณะ \' OR description != \'แก้ไข หมวดหมู่ ลักษณะ \' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(632, '2017-01-27 01:54:24', '2017-01-26 18:54:24', 1, 'db_reference', 17, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product_attribute\',\'product_attribute\')', 1, 'successfully'),
(633, '2017-01-27 01:54:32', '2017-01-26 18:54:32', 1, 'db_reference', 17, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product_attribute_option\',\'product_attribute_option\')', 1, 'successfully'),
(634, '2017-01-27 01:54:40', '2017-01-26 18:54:40', 1, 'db_reference', 17, 1, 'INSERT', 'INSERT INTO db_reference (id,created,modified,owner,name,db_name) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,\'product_attribute_value\',\'product_attribute_value\')', 1, 'successfully'),
(635, '2017-01-27 01:55:43', '2017-01-26 18:55:43', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,38,17)', 1, 'successfully'),
(636, '2017-01-27 01:55:47', '2017-01-26 18:55:47', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,39,17)', 1, 'successfully'),
(637, '2017-01-27 01:55:53', '2017-01-26 18:55:53', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,40,18)', 1, 'successfully'),
(638, '2017-01-27 01:55:57', '2017-01-26 18:55:57', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,41,18)', 1, 'successfully'),
(639, '2017-01-27 01:56:02', '2017-01-26 18:56:02', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,42,19)', 1, 'successfully'),
(640, '2017-01-27 01:56:06', '2017-01-26 18:56:06', 1, 'task_db_log', 31, 1, 'INSERT', 'INSERT INTO task_db_log (id,created,modified,owner,task_id,db_reference_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,43,19)', 1, 'successfully'),
(641, '2017-01-27 01:57:39', '2017-01-26 18:57:39', 1, 'task', 42, 1, 'UPDATE', 'UPDATE task SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,task_parent_id=1,task_action_type_id=5,task_status_id=1,job_id=3,amphur_id=843,province_id=7,country=\'ไทย\',name=\'เพิ่ม ลักษณะ สินค้า\',description=\'เพิ่ม ลักษณะ สินค้า\',task_open=\'2017-01-15\',task_close=\'2018-01-15\',error_msg_thai=\'\',error_msg_english=\'\',success_msg_thai=\'\',success_msg_english=\'\' WHERE id =42 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR task_parent_id != 1 OR task_action_type_id != 5 OR task_status_id != 1 OR job_id != 3 OR amphur_id != 843 OR province_id != 7 OR country != \'ไทย\' OR name != \'เพิ่ม ลักษณะ สินค้า\' OR description != \'เพิ่ม ลักษณะ สินค้า\' OR task_open != \'2017-01-15\' OR task_close != \'2018-01-15\' OR error_msg_thai != \'\' OR error_msg_english != \'\' OR success_msg_thai != \'\' OR success_msg_english != \'\' )', 1, 'successfully'),
(642, '2017-01-27 02:19:25', '2017-01-26 19:19:25', 1, 'product_attribute_value', 2, 1, 'INSERT', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,3,3);', 1, 'successfully'),
(643, '2017-01-27 02:19:35', '2017-01-26 19:19:35', 1, 'product_attribute_value', 2, 1, 'INSERT', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,3,2);', 1, 'successfully'),
(644, '2017-01-27 02:20:07', '2017-01-26 19:20:07', 1, 'product_attribute_value', 2, 1, 'UPDATE', 'UPDATE product_attribute_value SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_id=6,product_attribute_id=2,product_attribute_option_id=1 WHERE id =2 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_id != 6 OR product_attribute_id != 2 OR product_attribute_option_id != 1 )', 1, 'successfully'),
(645, '2017-01-27 02:21:50', '2017-01-26 19:21:50', 1, 'product_attribute_value', 5, 1, 'edit', 'UPDATE product_attribute_value SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_id=3,product_attribute_id=3,product_attribute_option_id=3 WHERE id =5 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_id != 3 OR product_attribute_id != 3 OR product_attribute_option_id != 3 )', 1, 'successfully'),
(646, '2017-01-27 02:23:17', '2017-01-26 19:23:17', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,3,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,2);', 1, 'successfully'),
(647, '2017-01-27 02:26:02', '2017-01-26 19:26:02', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,1,2,1);', 1, 'successfully'),
(648, '2017-01-27 02:26:27', '2017-01-26 19:26:27', 1, 'product', 1, 1, 'EDIT', 'UPDATE product SET id=id,created=created,modified=CURRENT_TIMESTAMP,owner=1,product_catagories_id=1,product_status_id=1,supplier_id=15,name=\'B-4654\',name_english=\'TALAS\',short_description=\'ทาลัส\',long_description=\'ใช้น้ำ 3/4.5ลิตร ฝาUF\',barcode=\'8859199111057\' WHERE id =1 AND ( id != id OR created != created OR modified != modified OR owner != 1 OR product_catagories_id != 1 OR product_status_id != 1 OR supplier_id != 15 OR name != \'B-4654\' OR name_english != \'TALAS\' OR short_description != \'ทาลัส\' OR long_description != \'ใช้น้ำ 3/4.5ลิตร ฝาUF\' OR barcode != \'8859199111057\' )', 1, 'successfully'),
(649, '2017-01-27 02:49:43', '2017-01-26 19:49:43', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,3),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,2,1);', 1, 'successfully'),
(650, '2017-01-27 02:50:03', '2017-01-26 19:50:03', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,1);', 1, 'successfully'),
(651, '2017-01-27 02:50:15', '2017-01-26 19:50:15', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(652, '2017-01-27 02:51:12', '2017-01-26 19:51:12', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(653, '2017-01-27 02:51:36', '2017-01-26 19:51:36', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(654, '2017-01-27 02:51:54', '2017-01-26 19:51:54', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(655, '2017-01-27 02:52:38', '2017-01-26 19:52:38', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(656, '2017-01-27 02:52:57', '2017-01-26 19:52:57', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(657, '2017-01-27 02:54:18', '2017-01-26 19:54:18', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(658, '2017-01-27 02:55:53', '2017-01-26 19:55:53', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(659, '2017-01-27 02:55:56', '2017-01-26 19:55:56', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(660, '2017-01-27 02:56:17', '2017-01-26 19:56:17', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(661, '2017-01-27 02:56:19', '2017-01-26 19:56:19', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(662, '2017-01-27 02:56:22', '2017-01-26 19:56:22', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(663, '2017-01-27 02:56:47', '2017-01-26 19:56:47', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(664, '2017-01-27 02:56:55', '2017-01-26 19:56:55', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(665, '2017-01-27 02:56:57', '2017-01-26 19:56:57', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(666, '2017-01-27 02:57:05', '2017-01-26 19:57:05', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(667, '2017-01-27 02:57:29', '2017-01-26 19:57:29', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(668, '2017-01-27 02:57:36', '2017-01-26 19:57:36', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(669, '2017-01-27 02:58:02', '2017-01-26 19:58:02', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(670, '2017-01-27 02:58:16', '2017-01-26 19:58:16', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(671, '2017-01-27 02:59:26', '2017-01-26 19:59:26', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(672, '2017-01-27 02:59:27', '2017-01-26 19:59:27', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(673, '2017-01-27 02:59:33', '2017-01-26 19:59:33', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(674, '2017-01-27 03:01:06', '2017-01-26 20:01:06', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(675, '2017-01-27 03:01:35', '2017-01-26 20:01:35', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(676, '2017-01-27 03:01:52', '2017-01-26 20:01:52', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,2,1),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,5,1,2);', 1, 'successfully'),
(677, '2017-01-27 03:02:18', '2017-01-26 20:02:18', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,2);', 1, 'successfully'),
(678, '2017-01-27 03:02:29', '2017-01-26 20:02:29', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,2);', 1, 'successfully'),
(679, '2017-01-27 03:03:18', '2017-01-26 20:03:18', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,1,1);', 1, 'successfully'),
(680, '2017-01-27 03:05:03', '2017-01-26 20:05:03', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,3),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,3,2,2);', 1, 'successfully'),
(681, '2017-01-27 03:05:19', '2017-01-26 20:05:19', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,4,2,3),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,4,2,2);', 1, 'successfully'),
(682, '2017-01-27 03:06:06', '2017-01-26 20:06:06', 1, 'product_attribute_value', 2, 1, 'INSERT_MULTIPLE', 'INSERT INTO product_attribute_value (id,created,modified,owner,product_id,product_attribute_id,product_attribute_option_id) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,4,2,2),(DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,4,2,1);', 1, 'successfully'),
(683, '2017-01-27 03:07:32', '2017-01-26 20:07:32', 1, 'retail_stock_report', 9, 1, 'INSERT_MULTIPLE', 'INSERT INTO retail_stock_report (id,created,modified,owner,agent_id,product_id,quantity_remain) VALUES (DEFAULT,CURRENT_TIMESTAMP,CURRENT_TIMESTAMP,1,2,1,2);', 1, 'successfully');

-- --------------------------------------------------------

--
-- Table structure for table `task_log_status`
--

CREATE TABLE `task_log_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task_log_status`
--

INSERT INTO `task_log_status` (`id`, `created`, `modified`, `owner`, `name`, `description`) VALUES
(1, '2017-01-25 04:00:24', '2017-01-24 21:00:25', 1, 'root', 'root');

-- --------------------------------------------------------

--
-- Table structure for table `task_status`
--

CREATE TABLE `task_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `task_status`
--

INSERT INTO `task_status` (`id`, `created`, `modified`, `owner`, `name`, `description`, `boolean`) VALUES
(1, '2017-01-15 11:13:34', '2017-01-15 04:15:08', 1, 'ACTIVATE', 'สถานะเปิด', 1),
(2, '2017-01-15 11:14:55', '2017-01-15 04:14:55', 1, 'DEACTIVATE', 'สถานะปิด', 0);

-- --------------------------------------------------------

--
-- Table structure for table `trader`
--

CREATE TABLE `trader` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` text COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `city` text COLLATE utf8_unicode_ci NOT NULL,
  `province` text COLLATE utf8_unicode_ci NOT NULL,
  `country` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `post_code` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `phone` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `bank_account_2` varchar(64) COLLATE utf8_unicode_ci NOT NULL,
  `tax_identification` varchar(64) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `trader`
--

INSERT INTO `trader` (`id`, `created`, `modified`, `owner`, `name`, `description`, `city`, `province`, `country`, `post_code`, `email`, `phone`, `bank_account`, `bank_account_2`, `tax_identification`) VALUES
(1, '2017-01-20 15:08:51', '2017-01-23 20:46:22', 2, 'SHANTOU JIXIANG TRADING CO.,LTD.', 'EMON1=MANGO, EMON2=FENNIE', 'ROOM 201 NO.32', 'CHANGPING ROAD', 'CHINA', '', 'marketing@huiquan-chaozhou.com.cn, zheng.202@qq.com', '0086-768-6933518', '', '', ''),
(2, '2017-01-24 10:41:12', '2017-01-23 20:41:12', 2, 'SHENZHEN XINYAONGYONGHONG IMP&EXP TRADE LIMITED COMPANY CHINA', 'FANNY', 'ROOM 623 ALONG WATERWAY MAN KAM TO EXPORT', 'DECLARATION BUILDING LUOHU AREA SHENZHEN', 'CHINA', '', '', '0086-013433788155', '', '', ''),
(3, '2017-01-24 10:45:30', '2017-01-23 20:45:30', 2, 'FOSHAN ITO IMP. & EXP. CO.,LTD.', 'DAVID', 'BLDG.3 HONGYI CERAMICS-CITY', 'WUGANG RD.FOSHAN GUANGDONG', 'CHINA', '', 'davidlai2000@vip.163.com', '0086-757-83300640', '', '', ''),
(4, '2017-01-24 10:51:44', '2017-01-23 20:51:44', 2, 'FOSHAN GAOMING HENGRUI EXP.& IMP.CO.,LTD.', 'BATHWOOD=SUNEE', 'NO.56 CANGJIANG RD HECHENG GAOMING DISTRICT', 'FOSHAN CITY GUANGDONG', 'CHINA', '', 't.zhouqing@hotmail.com ', '0086-138-26157838', '', '', ''),
(5, '2017-01-24 10:57:01', '2017-01-23 20:57:01', 2, 'FOSHAN SINCERE BUILDING MATERIALS CO.,LTD.', 'POLISHED TILES=CINDY, MIKI', 'FOSHAN INTERNATIONAL CERAMICS EXHIBITION CENTER', 'LOT BO.20-21 BLOCK A3 4TH JIHUA ROAD FOSHAN ', 'CHINA', '', 'cindy@sincerechina.net', '0086-159-15204091', '', '', ''),
(6, '2017-01-24 10:59:14', '2017-01-24 09:01:27', 2, 'SHENZHEN MITI IMPORT & EXPORT TRADING CO.,LTD.CHINA', 'LETOP=SOPHIA', 'RM1707 JINGGUANG CENTER SHENNAN ROAD EAST', 'LUOHU SHENZHEN', 'CHINA', '', 'sophia@honli.com', '0086-768-6837092', '', '', ''),
(7, '2017-01-24 11:18:18', '2017-01-24 09:00:42', 2, 'FOSHAN HONGRUI TRADE CORPORATION LTD.', 'TIANYA=MILDRED', 'NO.56 CANGJIANG ROAD HECHENG', 'GAOMING DISTRICT FOSHAN CITY', 'CHINA', '', 'mildredmak@yahoo.com.cn', '0086-136-30146193', '', '', ''),
(8, '2017-01-24 11:25:33', '2017-01-24 09:01:06', 2, 'SHENZHEN LIJIATONGDA TRADE CO.,LTD.', 'JIALONG=GLADDYS', 'NO.8 ROAD FENGER INDUSTRIAL AREA', 'GUXIANG TOWN CHAOAN GUANGDONG', 'CHINA', '', '411747612@qq.com', '0086-768-6926158', '', '', ''),
(9, '2017-01-24 15:51:48', '2017-01-24 08:51:48', 2, 'LAND CAPITAL INTERNATIONAL LIMITED', 'TILES ARTSTONE:JASSE', '1521 15/F WINNERWAY BLDG', 'HONGYUAN RD DONGGUAN CITY GUANGDONG', 'CHINA', '', '', '0086-769-22412138', '', '', ''),
(10, '2017-01-24 15:53:27', '2017-01-24 08:53:27', 2, 'SHENZHEN YIHAODI IMPORT AND EXPORT CO.,LTD.', 'BOMEI : ABLE (2P LOW COST)', 'FUQING NO.1 ROAD', 'CHAOZHOU', 'CHINA', '', '', '0768-6874406', '', '', ''),
(11, '2017-01-24 15:56:24', '2017-01-24 08:56:24', 2, 'GUANGDONG SHUNDE FOREIGN TRADE DEVELOPMENT CO.,LTD.', 'COOKING RANGE : ANGELA', '12 RONG QI MAIN ROAD, ', 'RONGGUI SHUNDE GUANGDONG ', 'CHINA', '', '', '0086-0757-25523788', '', '', ''),
(12, '2017-01-24 15:59:17', '2017-01-25 08:16:19', 2, 'ZHONGSHAN MEITU PLASTIC IND.,CO.,LTD.', 'MEITU : BILLY', 'DACHE INDUSTRIAL AREA,', 'NANLANG,ZHONGSHAN,GUANGDONG', 'CHINA', '', '', '86-760-85211111', '', '', ''),
(13, '2017-01-24 16:13:59', '2017-01-24 09:13:59', 2, 'PRIME TRADE INC.,', 'TILES VIETNAM : TAMNT', 'BINH XUYEN INDUSTRY ZONE, BINH XUYEN', 'DISTRICT VINH PHUC PROVINCE', 'VIETNAM', '', '', '0084-2113888987', '', '', ''),
(14, '2017-01-24 16:18:49', '2017-01-24 09:18:49', 2, 'VIGLACERA CERAMIC TILES TRADING JSC', 'TILES LOW COST : NGUYEN', '2ND FLOOR VIGLACERA TOWER METRI', 'TU LIEM HANOI', 'VIETNAM', '', '', '043-5430726', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `vehicle`
--

CREATE TABLE `vehicle` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `vehicle_brand_id` int(4) NOT NULL,
  `vehicle_catagory_id` int(4) NOT NULL,
  `purchased_year` date NOT NULL,
  `license_number` varchar(32) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `vehicle_brand`
--

CREATE TABLE `vehicle_brand` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `vehicle_brand`
--

INSERT INTO `vehicle_brand` (`id`, `created`, `modified`, `owner`, `name`, `description`) VALUES
(1, '2017-01-19 21:24:15', '2017-01-19 14:24:15', 1, 'KIA', 'KIA'),
(2, '2017-01-19 21:24:19', '2017-01-19 14:24:19', 1, 'FORD', 'FORD'),
(3, '2017-01-19 21:24:23', '2017-01-19 14:24:23', 1, 'HONDA', 'HONDA'),
(4, '2017-01-19 21:24:30', '2017-01-19 14:24:30', 1, 'TOYOTA', 'TOYOTA'),
(5, '2017-01-19 21:24:36', '2017-01-19 14:24:36', 1, 'SUZUKI', 'SUZUKI'),
(6, '2017-01-19 21:24:47', '2017-01-19 14:24:47', 1, 'HYUNDAI', 'HYUNDAI'),
(7, '2017-01-19 21:25:42', '2017-01-19 14:25:42', 1, 'ISUZU', 'ISUZU'),
(8, '2017-01-19 21:25:56', '2017-01-19 14:25:56', 1, 'CHEVROLET', 'CHEVROLET'),
(9, '2017-01-19 21:26:06', '2017-01-19 14:26:06', 1, 'MAZDA', 'MAZDA'),
(10, '2017-01-19 21:26:14', '2017-01-19 14:26:14', 1, 'TATA', 'TATA'),
(11, '2017-01-19 21:26:25', '2017-01-19 14:26:25', 1, 'THAIRUNG', 'THAIRUNG'),
(12, '2017-01-19 21:26:40', '2017-01-19 14:26:40', 1, 'SSANGYONG', 'SSANGYONG'),
(13, '2017-01-19 21:27:07', '2017-01-19 14:27:07', 1, 'MITSUBISHI', 'MITSUBISHI'),
(14, '2017-01-19 21:27:17', '2017-01-19 14:27:17', 1, 'SUBURU', 'SUBURU');

-- --------------------------------------------------------

--
-- Table structure for table `vehicle_catagory`
--

CREATE TABLE `vehicle_catagory` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `vehicle_catagory_parent_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `vehicle_catagory`
--

INSERT INTO `vehicle_catagory` (`id`, `created`, `modified`, `owner`, `name`, `description`, `vehicle_catagory_parent_id`) VALUES
(1, '2017-01-19 21:28:26', '2017-01-19 14:32:33', 1, 'root', 'root', 1),
(2, '2017-01-19 21:29:30', '2017-01-19 14:29:30', 1, 'SEDAN', 'SEDAN', 1),
(3, '2017-01-19 21:30:01', '2017-01-19 14:30:01', 1, 'PICKUP TRUCK', 'PICKUP TRUCK', 1),
(4, '2017-01-19 21:30:06', '2017-01-19 14:30:06', 1, 'TRUCK', 'TRUCK', 1),
(5, '2017-01-19 21:32:25', '2017-01-19 14:32:25', 1, 'TRAILER', 'TRAILER', 1),
(6, '2017-01-19 21:32:56', '2017-01-19 14:32:56', 1, 'TRAILER HEAD', 'TRAILER HEAD', 1),
(7, '2017-01-19 21:33:43', '2017-01-19 14:33:43', 1, 'MUV', 'MUV', 1),
(8, '2017-01-19 21:33:54', '2017-01-19 14:33:54', 1, 'MOTOCYCLE', 'MOTOCYCLE', 1),
(9, '2017-01-19 21:34:02', '2017-01-19 14:34:02', 1, 'BICYCLE', 'BICYCLE', 1),
(10, '2017-01-19 21:34:26', '2017-01-19 14:34:26', 1, 'VAN', 'VAN', 1);

-- --------------------------------------------------------

--
-- Table structure for table `vehicle_log`
--

CREATE TABLE `vehicle_log` (
  `id` int(11) UNSIGNED NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `vehicle_id` int(4) NOT NULL,
  `vehicle_status_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `vehicle_status`
--

CREATE TABLE `vehicle_status` (
  `id` int(11) NOT NULL,
  `created` datetime NOT NULL,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `owner` int(4) UNSIGNED NOT NULL,
  `name` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `boolean` int(1) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `vehicle_status`
--

INSERT INTO `vehicle_status` (`id`, `created`, `modified`, `owner`, `name`, `description`, `boolean`) VALUES
(1, '2017-01-19 21:47:59', '2017-01-19 14:48:16', 1, 'ACTIVE', 'ACTIVE', 1),
(2, '2017-01-19 21:48:28', '2017-01-19 14:48:28', 1, 'ACCIDENT', 'ACCIDENT', 0),
(3, '2017-01-19 21:48:54', '2017-01-19 14:48:54', 1, 'REPAIRING', 'REPAIRING', 0),
(4, '2017-01-19 21:49:11', '2017-01-19 14:49:11', 1, 'DISABLE', 'DISABLE', 0),
(5, '2017-01-19 21:49:39', '2017-01-19 14:49:39', 1, 'MAINTAINING', 'MAINTAINING', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `agent`
--
ALTER TABLE `agent`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_agent_region` (`region_id`),
  ADD KEY `FK_agent_agent_type` (`agent_type_id`),
  ADD KEY `FK_agent_province` (`province_id`);

--
-- Indexes for table `agent_credit_log`
--
ALTER TABLE `agent_credit_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_agent_credit_log_agent` (`agent_id`);

--
-- Indexes for table `agent_type`
--
ALTER TABLE `agent_type`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `amphur`
--
ALTER TABLE `amphur`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `attachment`
--
ALTER TABLE `attachment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_attachment_attachment_type` (`attachment_type_id`);

--
-- Indexes for table `attachment_type`
--
ALTER TABLE `attachment_type`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `authentication`
--
ALTER TABLE `authentication`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username_UNIQUE` (`username`),
  ADD UNIQUE KEY `id_UNIQUE` (`id`),
  ADD UNIQUE KEY `email_UNIQUE` (`email`),
  ADD UNIQUE KEY `national_id` (`national_id`),
  ADD KEY `FK_authentication_employee` (`employee_id`);

--
-- Indexes for table `db_reference`
--
ALTER TABLE `db_reference`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `delivery`
--
ALTER TABLE `delivery`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_delivery_order_list` (`order_list_id`),
  ADD KEY `FK_delivery_employee` (`employee_id`);

--
-- Indexes for table `delivery_log`
--
ALTER TABLE `delivery_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_delivery_log_delivery` (`delivery_id`),
  ADD KEY `FK_delivery_log_delivery_process_status` (`delivery_process_status_id`),
  ADD KEY `FK_delivery_log_vehicle` (`vehicle_id`);

--
-- Indexes for table `delivery_process_status`
--
ALTER TABLE `delivery_process_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employee_suffix`
--
ALTER TABLE `employee_suffix`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `job`
--
ALTER TABLE `job`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_job_job` (`job_parent_id`);

--
-- Indexes for table `job_log`
--
ALTER TABLE `job_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_job_log_job` (`job_id`),
  ADD KEY `FK_job_log_employee` (`employee_id`),
  ADD KEY `FK_job_log_job_log_status` (`job_log_status_id`);

--
-- Indexes for table `job_log_status`
--
ALTER TABLE `job_log_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `loginattempts`
--
ALTER TABLE `loginattempts`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `note`
--
ALTER TABLE `note`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_note_employee` (`from`),
  ADD KEY `FK_note_employee_2` (`to`);

--
-- Indexes for table `note_type`
--
ALTER TABLE `note_type`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_note_type_note_type` (`note_type_parent_id`);

--
-- Indexes for table `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_order_detail_order_list` (`order_list_id`),
  ADD KEY `FK_order_detail_order_detail_status` (`order_detail_status_id`),
  ADD KEY `FK_order_detail_product` (`product_id`);

--
-- Indexes for table `order_detail_status`
--
ALTER TABLE `order_detail_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_list`
--
ALTER TABLE `order_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_log`
--
ALTER TABLE `order_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_order_log_order_list` (`order_list_id`),
  ADD KEY `FK_order_log_order_process_status` (`order_process_status_id`);

--
-- Indexes for table `order_process_status`
--
ALTER TABLE `order_process_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_product_product_status` (`product_status_id`),
  ADD KEY `FK_product_supplier` (`supplier_id`),
  ADD KEY `FK_product_product_catagories` (`product_catagories_id`);

--
-- Indexes for table `product_attribute`
--
ALTER TABLE `product_attribute`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_product_attribute_product_attribute` (`product_attribute_parent_id`),
  ADD KEY `FK_product_attribute_product_catagories` (`product_catagories_id`);

--
-- Indexes for table `product_attribute_option`
--
ALTER TABLE `product_attribute_option`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_product_attribute_option_product_attribute` (`product_attribute_id`);

--
-- Indexes for table `product_attribute_value`
--
ALTER TABLE `product_attribute_value`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_product_attribute_value_product` (`product_id`),
  ADD KEY `FK_product_attribute_value_product_attribute` (`product_attribute_id`),
  ADD KEY `FK_product_attribute_value_product_attribute_option` (`product_attribute_option_id`);

--
-- Indexes for table `product_catagories`
--
ALTER TABLE `product_catagories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_status`
--
ALTER TABLE `product_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `province`
--
ALTER TABLE `province`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `region`
--
ALTER TABLE `region`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_region_region` (`region_parent_id`);

--
-- Indexes for table `retail_pc`
--
ALTER TABLE `retail_pc`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_retail_pc_employee` (`employee_id`),
  ADD KEY `FK_retail_pc_agent` (`agent_id`);

--
-- Indexes for table `retail_stock_report`
--
ALTER TABLE `retail_stock_report`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_retail_stock_report_agent` (`agent_id`),
  ADD KEY `FK_retail_stock_report_product` (`product_id`);

--
-- Indexes for table `supplier`
--
ALTER TABLE `supplier`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `supplier_link_trader`
--
ALTER TABLE `supplier_link_trader`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_supplier_link_trader_supplier` (`supplier_id`),
  ADD KEY `FK_supplier_link_trader_trader` (`trader_id`);

--
-- Indexes for table `task`
--
ALTER TABLE `task`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_task_task` (`task_parent_id`),
  ADD KEY `FK_task_task_action_type` (`task_action_type_id`),
  ADD KEY `FK_task_task_status` (`task_status_id`),
  ADD KEY `FK_task_job` (`job_id`);

--
-- Indexes for table `task_action_type`
--
ALTER TABLE `task_action_type`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `task_db_log`
--
ALTER TABLE `task_db_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_task_db_log_task` (`task_id`),
  ADD KEY `FK_task_db_log_db_reference` (`db_reference_id`);

--
-- Indexes for table `task_log`
--
ALTER TABLE `task_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_task_log_task` (`task_id`),
  ADD KEY `FK_task_log_task_log_status` (`task_log_status_id`);

--
-- Indexes for table `task_log_status`
--
ALTER TABLE `task_log_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `task_status`
--
ALTER TABLE `task_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `trader`
--
ALTER TABLE `trader`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `vehicle`
--
ALTER TABLE `vehicle`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_vehicle_vehicle_brand` (`vehicle_brand_id`),
  ADD KEY `FK_vehicle_vehicle_catagory` (`vehicle_catagory_id`);

--
-- Indexes for table `vehicle_brand`
--
ALTER TABLE `vehicle_brand`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `vehicle_catagory`
--
ALTER TABLE `vehicle_catagory`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_vehicle_catagory_vehicle_catagory` (`vehicle_catagory_parent_id`);

--
-- Indexes for table `vehicle_log`
--
ALTER TABLE `vehicle_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_vehicle_log_vehicle` (`vehicle_id`),
  ADD KEY `FK_vehicle_log_vehicle_status` (`vehicle_status_id`);

--
-- Indexes for table `vehicle_status`
--
ALTER TABLE `vehicle_status`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `agent`
--
ALTER TABLE `agent`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `agent_credit_log`
--
ALTER TABLE `agent_credit_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `agent_type`
--
ALTER TABLE `agent_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `amphur`
--
ALTER TABLE `amphur`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=999;
--
-- AUTO_INCREMENT for table `attachment`
--
ALTER TABLE `attachment`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `attachment_type`
--
ALTER TABLE `attachment_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `db_reference`
--
ALTER TABLE `db_reference`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
--
-- AUTO_INCREMENT for table `delivery`
--
ALTER TABLE `delivery`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `delivery_log`
--
ALTER TABLE `delivery_log`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `delivery_process_status`
--
ALTER TABLE `delivery_process_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `employee`
--
ALTER TABLE `employee`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=97;
--
-- AUTO_INCREMENT for table `employee_suffix`
--
ALTER TABLE `employee_suffix`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `job`
--
ALTER TABLE `job`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
--
-- AUTO_INCREMENT for table `job_log`
--
ALTER TABLE `job_log`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT for table `job_log_status`
--
ALTER TABLE `job_log_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `loginattempts`
--
ALTER TABLE `loginattempts`
  MODIFY `ID` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
--
-- AUTO_INCREMENT for table `note`
--
ALTER TABLE `note`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `note_type`
--
ALTER TABLE `note_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `id` int(11) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `order_detail_status`
--
ALTER TABLE `order_detail_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `order_list`
--
ALTER TABLE `order_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `order_log`
--
ALTER TABLE `order_log`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `order_process_status`
--
ALTER TABLE `order_process_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;
--
-- AUTO_INCREMENT for table `product_attribute`
--
ALTER TABLE `product_attribute`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `product_attribute_option`
--
ALTER TABLE `product_attribute_option`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `product_attribute_value`
--
ALTER TABLE `product_attribute_value`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `product_catagories`
--
ALTER TABLE `product_catagories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;
--
-- AUTO_INCREMENT for table `product_status`
--
ALTER TABLE `product_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `province`
--
ALTER TABLE `province`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;
--
-- AUTO_INCREMENT for table `region`
--
ALTER TABLE `region`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `retail_pc`
--
ALTER TABLE `retail_pc`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `retail_stock_report`
--
ALTER TABLE `retail_stock_report`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `supplier`
--
ALTER TABLE `supplier`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;
--
-- AUTO_INCREMENT for table `supplier_link_trader`
--
ALTER TABLE `supplier_link_trader`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
--
-- AUTO_INCREMENT for table `task`
--
ALTER TABLE `task`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;
--
-- AUTO_INCREMENT for table `task_action_type`
--
ALTER TABLE `task_action_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
--
-- AUTO_INCREMENT for table `task_db_log`
--
ALTER TABLE `task_db_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
--
-- AUTO_INCREMENT for table `task_log`
--
ALTER TABLE `task_log`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=684;
--
-- AUTO_INCREMENT for table `task_log_status`
--
ALTER TABLE `task_log_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `task_status`
--
ALTER TABLE `task_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `trader`
--
ALTER TABLE `trader`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT for table `vehicle`
--
ALTER TABLE `vehicle`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `vehicle_brand`
--
ALTER TABLE `vehicle_brand`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT for table `vehicle_catagory`
--
ALTER TABLE `vehicle_catagory`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `vehicle_log`
--
ALTER TABLE `vehicle_log`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `vehicle_status`
--
ALTER TABLE `vehicle_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `agent`
--
ALTER TABLE `agent`
  ADD CONSTRAINT `FK_agent_agent_type` FOREIGN KEY (`agent_type_id`) REFERENCES `agent_type` (`id`),
  ADD CONSTRAINT `FK_agent_region` FOREIGN KEY (`region_id`) REFERENCES `region` (`id`);

--
-- Constraints for table `agent_credit_log`
--
ALTER TABLE `agent_credit_log`
  ADD CONSTRAINT `FK_agent_credit_log_agent` FOREIGN KEY (`agent_id`) REFERENCES `agent` (`id`);

--
-- Constraints for table `attachment`
--
ALTER TABLE `attachment`
  ADD CONSTRAINT `FK_attachment_attachment_type` FOREIGN KEY (`attachment_type_id`) REFERENCES `attachment_type` (`id`);

--
-- Constraints for table `authentication`
--
ALTER TABLE `authentication`
  ADD CONSTRAINT `FK_authentication_employee` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`id`);

--
-- Constraints for table `delivery`
--
ALTER TABLE `delivery`
  ADD CONSTRAINT `FK_delivery_employee` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`id`),
  ADD CONSTRAINT `FK_delivery_order_list` FOREIGN KEY (`order_list_id`) REFERENCES `order_list` (`id`);

--
-- Constraints for table `delivery_log`
--
ALTER TABLE `delivery_log`
  ADD CONSTRAINT `FK_delivery_log_delivery` FOREIGN KEY (`delivery_id`) REFERENCES `delivery` (`id`),
  ADD CONSTRAINT `FK_delivery_log_delivery_process_status` FOREIGN KEY (`delivery_process_status_id`) REFERENCES `delivery_process_status` (`id`),
  ADD CONSTRAINT `FK_delivery_log_vehicle` FOREIGN KEY (`vehicle_id`) REFERENCES `vehicle` (`id`);

--
-- Constraints for table `job`
--
ALTER TABLE `job`
  ADD CONSTRAINT `FK_job_job` FOREIGN KEY (`job_parent_id`) REFERENCES `job` (`id`);

--
-- Constraints for table `job_log`
--
ALTER TABLE `job_log`
  ADD CONSTRAINT `FK_job_log_employee` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`id`),
  ADD CONSTRAINT `FK_job_log_job` FOREIGN KEY (`job_id`) REFERENCES `job` (`id`),
  ADD CONSTRAINT `FK_job_log_job_log_status` FOREIGN KEY (`job_log_status_id`) REFERENCES `job_log_status` (`id`);

--
-- Constraints for table `note`
--
ALTER TABLE `note`
  ADD CONSTRAINT `FK_note_employee` FOREIGN KEY (`from`) REFERENCES `employee` (`id`),
  ADD CONSTRAINT `FK_note_employee_2` FOREIGN KEY (`to`) REFERENCES `employee` (`id`);

--
-- Constraints for table `note_type`
--
ALTER TABLE `note_type`
  ADD CONSTRAINT `FK_note_type_note_type` FOREIGN KEY (`note_type_parent_id`) REFERENCES `note_type` (`id`);

--
-- Constraints for table `order_detail`
--
ALTER TABLE `order_detail`
  ADD CONSTRAINT `FK_order_detail_order_detail_status` FOREIGN KEY (`order_detail_status_id`) REFERENCES `order_detail_status` (`id`),
  ADD CONSTRAINT `FK_order_detail_order_list` FOREIGN KEY (`order_list_id`) REFERENCES `order_list` (`id`),
  ADD CONSTRAINT `FK_order_detail_product` FOREIGN KEY (`product_id`) REFERENCES `product` (`id`);

--
-- Constraints for table `order_log`
--
ALTER TABLE `order_log`
  ADD CONSTRAINT `FK_order_log_order_list` FOREIGN KEY (`order_list_id`) REFERENCES `order_list` (`id`),
  ADD CONSTRAINT `FK_order_log_order_process_status` FOREIGN KEY (`order_process_status_id`) REFERENCES `order_process_status` (`id`);

--
-- Constraints for table `product`
--
ALTER TABLE `product`
  ADD CONSTRAINT `FK_product_product_catagories` FOREIGN KEY (`product_catagories_id`) REFERENCES `product_catagories` (`id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `FK_product_product_status` FOREIGN KEY (`product_status_id`) REFERENCES `product_status` (`id`),
  ADD CONSTRAINT `FK_product_supplier` FOREIGN KEY (`supplier_id`) REFERENCES `supplier` (`id`);

--
-- Constraints for table `product_attribute`
--
ALTER TABLE `product_attribute`
  ADD CONSTRAINT `FK_product_attribute_product_attribute` FOREIGN KEY (`product_attribute_parent_id`) REFERENCES `product_attribute` (`id`),
  ADD CONSTRAINT `FK_product_attribute_product_catagories` FOREIGN KEY (`product_catagories_id`) REFERENCES `product_catagories` (`id`) ON UPDATE CASCADE;

--
-- Constraints for table `product_attribute_option`
--
ALTER TABLE `product_attribute_option`
  ADD CONSTRAINT `FK_product_attribute_option_product_attribute` FOREIGN KEY (`product_attribute_id`) REFERENCES `product_attribute` (`id`);

--
-- Constraints for table `product_attribute_value`
--
ALTER TABLE `product_attribute_value`
  ADD CONSTRAINT `FK_product_attribute_value_product` FOREIGN KEY (`product_id`) REFERENCES `product` (`id`),
  ADD CONSTRAINT `FK_product_attribute_value_product_attribute` FOREIGN KEY (`product_attribute_id`) REFERENCES `product_attribute` (`id`),
  ADD CONSTRAINT `FK_product_attribute_value_product_attribute_option` FOREIGN KEY (`product_attribute_option_id`) REFERENCES `product_attribute_option` (`id`);

--
-- Constraints for table `region`
--
ALTER TABLE `region`
  ADD CONSTRAINT `FK_region_region` FOREIGN KEY (`region_parent_id`) REFERENCES `region` (`id`);

--
-- Constraints for table `retail_pc`
--
ALTER TABLE `retail_pc`
  ADD CONSTRAINT `FK_retail_pc_agent` FOREIGN KEY (`agent_id`) REFERENCES `agent` (`id`),
  ADD CONSTRAINT `FK_retail_pc_employee` FOREIGN KEY (`employee_id`) REFERENCES `employee` (`id`);

--
-- Constraints for table `retail_stock_report`
--
ALTER TABLE `retail_stock_report`
  ADD CONSTRAINT `FK_retail_stock_report_agent` FOREIGN KEY (`agent_id`) REFERENCES `agent` (`id`),
  ADD CONSTRAINT `FK_retail_stock_report_product` FOREIGN KEY (`product_id`) REFERENCES `product` (`id`);

--
-- Constraints for table `supplier_link_trader`
--
ALTER TABLE `supplier_link_trader`
  ADD CONSTRAINT `FK_supplier_link_trader_supplier` FOREIGN KEY (`supplier_id`) REFERENCES `supplier` (`id`),
  ADD CONSTRAINT `FK_supplier_link_trader_trader` FOREIGN KEY (`trader_id`) REFERENCES `trader` (`id`);

--
-- Constraints for table `task`
--
ALTER TABLE `task`
  ADD CONSTRAINT `FK_task_job` FOREIGN KEY (`job_id`) REFERENCES `job` (`id`),
  ADD CONSTRAINT `FK_task_task` FOREIGN KEY (`task_parent_id`) REFERENCES `task` (`id`),
  ADD CONSTRAINT `FK_task_task_action_type` FOREIGN KEY (`task_action_type_id`) REFERENCES `task_action_type` (`id`),
  ADD CONSTRAINT `FK_task_task_status` FOREIGN KEY (`task_status_id`) REFERENCES `task_status` (`id`);

--
-- Constraints for table `task_db_log`
--
ALTER TABLE `task_db_log`
  ADD CONSTRAINT `FK_task_db_log_db_reference` FOREIGN KEY (`db_reference_id`) REFERENCES `db_reference` (`id`),
  ADD CONSTRAINT `FK_task_db_log_task` FOREIGN KEY (`task_id`) REFERENCES `task` (`id`);

--
-- Constraints for table `task_log`
--
ALTER TABLE `task_log`
  ADD CONSTRAINT `FK_task_log_task` FOREIGN KEY (`task_id`) REFERENCES `task` (`id`),
  ADD CONSTRAINT `FK_task_log_task_log_status` FOREIGN KEY (`task_log_status_id`) REFERENCES `task_log_status` (`id`);

--
-- Constraints for table `vehicle`
--
ALTER TABLE `vehicle`
  ADD CONSTRAINT `FK_vehicle_vehicle_brand` FOREIGN KEY (`vehicle_brand_id`) REFERENCES `vehicle_brand` (`id`),
  ADD CONSTRAINT `FK_vehicle_vehicle_catagory` FOREIGN KEY (`vehicle_catagory_id`) REFERENCES `vehicle_catagory` (`id`);

--
-- Constraints for table `vehicle_catagory`
--
ALTER TABLE `vehicle_catagory`
  ADD CONSTRAINT `FK_vehicle_catagory_vehicle_catagory` FOREIGN KEY (`vehicle_catagory_parent_id`) REFERENCES `vehicle_catagory` (`id`);

--
-- Constraints for table `vehicle_log`
--
ALTER TABLE `vehicle_log`
  ADD CONSTRAINT `FK_vehicle_log_vehicle` FOREIGN KEY (`vehicle_id`) REFERENCES `vehicle` (`id`),
  ADD CONSTRAINT `FK_vehicle_log_vehicle_status` FOREIGN KEY (`vehicle_status_id`) REFERENCES `vehicle_status` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
